{"title":"Kristina Ohlsson - Askungar - 2009 - DAISY","uid":6877357,"size":247085501,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:00530b359427d81f9779a2972ca75415f2b13af3&amp;dn=Kristina+Ohlsson+-+Askungar+-+2009+-+DAISY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"totomas1","files":-1,"time":1323508934,"description":"En liten flicka forsvinner fran ett x2000-tag som just rullat in pa Centralen i Stockholm. Flickans pappa blir snabbt misstankt och alla resurser laggs pa att lokalisera honom.\nI en annan del av Sverige lever en ung kvinna gomd, radd for att en dag aterfinnas av mannen som hon forst trodde var den prins och befriare som hon sedan barnsben vantat pa. Hon vet battre an nagon annan varfor flickan ar forsvunnen, och an en gang forbereder hon sig for flykt.\n\nPolisutredningen leds av den legendariske kommissarien Alex Recht. Vid hans sida finns den ivrige kriminalinspektoren Peder Rydh. Och inte minst den civilanstallda utredaren Fredrika Bergman, hon som skulle bli violinist men istallet hamnade inom polisen och som tvingas kampa i motvind nar hon vill leda bort utredningen fran det spar man forst slagit in pa.\n\nSamtidigt vaxer fallet och kantas av utstuderad ondska. Utredningsgruppen maste snabbt komma upp i garningsmannens tempo innan ytterligare liv gar forlorade. Hur mycket tid har de egentligen pa sig innan han gor sitt nasta drag? Och vem ar kvinnan som likt en skugga figurerar i utredningens utkant? ar det henne man maste finna for att fa den sista pusselbiten att falla pa plats?\n\nUpplasare: Hans Sandquist","torrent":{"xt":"urn:btih:00530b359427d81f9779a2972ca75415f2b13af3","amp;dn":"Kristina+Ohlsson+-+Askungar+-+2009+-+DAISY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00530b359427d81f9779a2972ca75415f2b13af3","infoHashBuffer":{"type":"Buffer","data":[0,83,11,53,148,39,216,31,151,121,162,151,44,167,84,21,242,177,58,243]},"announce":[],"urlList":[]}}