{"title":"Civilization V Trainer v 4.0.7","uid":6622472,"size":12541,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:010a2cebb559e4e04956f769ec63e5c8c45ad699&amp;dn=Civilization+V+Trainer+v+4.0.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DelphiUniverse","files":-1,"time":1314046062,"description":"Civilization V Trainer v 4.0.7 for Civilization 5 v 1.0.1.348 ..by DelphiUniverse\n\n-------------\n4.0.7 Changes\n-------------\n\n* Added functionality to clear individual values\n  from the 6 primary cheats. You normally use\n  ALT + Insert, Alt + Home etc to set values. You\n  can toggle the Caps Lock key, when it is toggled\n  it will set values to zero instead. So toggle\n  Caps-Lock when you want to zero out a specific\n  value. The hotkeys are still the same.\n\n* Added possibility to override the movement value in\n  the movement editbox. If you toggle Caps-Lock it will\n  apply zero (0) movement points in the game, and is good\n  for resetting movement points for units. Once you turn\n  off caps-lock again, it will use the value shown in the\n  edit box. Keep in mind that you must still enable the\n  cheat for it to apply zero movement points.\n\n  ( See hotkeys note further down in this file )\n\n* Rearranged controls a bit\n* Changed font for controls\n* Changed resource button values to a more pleasant set of\n  values instead of all the 9,99,999's\n* Changed hotkeys default values a tad in Settings.ini\n* Added error check when loading the civ process\n* Added comma thousand separator on all buttons with numbers\n* Removed quit dialog, it acted as a safety measure in the\n  days when you had to restart civ before you launched the\n  trainer. Those days are over, you can start the trainer\n  before or after you launch civ, no need for quit dialog\n* Trainer window will now properly center on screen.\n\n-----------------------\n4.0.6 Changes (Earlier)\n-----------------------\n\n* Removed antidebug code because some people\n  actually run the trainer sandboxed.\n* Added a mutex object to prevent problems\n  with the civ process\n\n-----------------------\n4.0.5 Changes (Earlier)\n-----------------------\n\n* Code reduction\n* Little bit error checking code\n* Little bit smarter algoritm used for some functions\n* Changed default sound for hotkeys\n\n----------------------\n 4.0.4 Changes (Earlier)\n ----------------------\n\n * Technical rearrangement to prevent crashes\n * Subclassed edit boxes to allow only digits and - characters\n * Trainer can now be start in any order you like, before or\n   after. You can even shut it down and restart it without\n   starting civilization again.\n * You do not have to do a next turn anymore to have the gold\n   cheat work.\n\n-----------------------\n4.0.3 Changes (Earlier)\n-----------------------\n\n* Default values for 6 primary Hotkeys are now customizable. You can\n edit Settings.ini and set custom values that will apply when\n using the different hotkeys.\n\n-----------------------\n4.0.2 Changes (Earlier)\n-----------------------\n\n* ALT + BACKSPACE hotkey will now only execute and make sound\n  if switched cheats are activated. If they are not activated\n  it will not make sound anymore, nor execute.\n\n* ALT + LEFT will no longer execute and make sound if there are\n  no slots to free.\n\n* ALT + RIGHT will no longer execute and make sound if all 6\n  resources are already set to zero.\n\n-----------------------\n4.0.1 Changes (Earlier)\n-----------------------\n\n* Fixed a problem with the gold pointer.\n\n* Made startup slightly faster\n\n* ALT + BACKSPACE didn't produce sound, is fixed now\n\n* Added customization options by adding a Settings.ini file\n  (If you use minimize on run, it will minimize after 6 seconds\n   automatically so that you can have a short peek at the window\n   attributes before it minimizes)\n\n* Changed sound type when using hotkeys, can be customized too\n\n* When trainer minimizes it will turn to the lowest priority and\n  in addition to that it will suspend the thread for 10 ms for each\n  iteration. When Trainer window is restored again it will remove\n  the 10 ms suspension and increase priority to normal again.\n\n-----------------------\n4.0 Changes (Earlier)\n-----------------------\n\n* Edit boxes now support signed numbers\n* Startup time reduced\n* Size of program greatly reduced\n* Hotkeys a tad quicker now\n* Some things still lacking in terms of customization\n\nMy previous trainer project was deleted by myself and so I had\nto code everything fresh. This new version is working, but I\nexpect it to have a few bugs here and there, they will be fixed\nin later versions. Consider this a beta version.\n\nThe size of the executable in the previous version was some 23 KB\nit has been reduced to 13 KB and I've also hard-coded all the\nprevious dll's directly into the executable, so the trainer is\nreduced in size by 2.5 times the previous version.\n\nIt is not optimized nor is it tweaked yet. This is a kind of a\nquick release just to be able to play with the trainer.\n\n\n-------------\nAbout Trainer\n-------------\n\nThis trainer is designed to work with Civilization 5 v 1.0.1.348\nDirectX 9 and DirectX 11.\n\nDo not attempt to use it with earlier or future versions of the game.\nIt will contaminate and corrupt memory if you do.\n\nThis trainer will give you the following:\n\n* Gold\n* Golden Age Progress\n* Golden Age Turns\n* Culture\n* Strategic Resources\n* Luxury Resources\n* Clear spent resource slots\n* Great General\n* Unit Experience\n* Movement\n* Heal units\n* City Modifier\n* Full hotkey support\n* Customizable (See Settings.ini)\n\n------------\nInstallation\n------------\n\n1. Create a new folder anywhere you like.\n2. Extract archive into that folder.\n3. Done.\n\n----------\nHow to use\n----------\n\nStart Trainer or Game in any order you like.\n\n---------------\nSwitched Cheats\n---------------\n\n1: MOVEMENT SWITCH:\nThis cheat will give unlimited movement points to units. Activate it and then click any unit, in any number, in any priority and move them around. Always remember to deactivate a switched cheat before making another turn.\n\nSet the initial movement point in the left editbox to set a default initial value for your units. Why would you want to set a initial movement score when the movement is already infinite?\n\nThe reason is simple: Because if you have 1 movement point left, it will cancel if you try to move it more than 1 hex, its pretty annoying. The default initial value is already set so you do not need to worry about it.\n\n2: EXPERIENCE SWITCH:\nThis cheat will give experience to your units. Set a initial experience value in the editbox on the left, then click all your units. You only need to click them once. Then deactivate the cheat when finished.\n\n3: HEALING SWITCH:\nThis cheat will set health points on your units. Set the health point you want in the editbox on the left side (it can be in the range of 0-10 where 0 is no health and 10 is full health) Then click all units you want to set this health value upon. Deactivate the cheat when finished.\n\n4: CITY MODIFIER SWITCH:\nThis is probably the most complex cheat to use. (It's really not that complex). This cheat will set the city modifier value (it is in percentage %).\n\nIt will set the modifier value on 3 things: Production, Science and Gold. To have this cheat work you will need to buy OR sell a building that affects any of these 3 areas. Thats it.\n\nQuick hint: I recommend buying:\nUniversity (to enable modifier for science)\nFactory (to enable production modifier)\nStock Exchange (to enable gold modifier)\n\nYou can also sell buildings that affects these areas, the modifier will update that way too.\n\n-------\nHotkeys\n-------\n\n(CAPS-LOCK-OFF) ALT + F1\t= Movement Cheat\n(CAPS-LOCK-ON)  ALT + F1\t= Movement Cheat with zero points\n\n(CAPS-LOCK-OFF) ALT + F2\t= Give Unit Experience\n(CAPS-LOCK-OFF) ALT + F3\t= Set Health on units\n(CAPS-LOCK-OFF) ALT + F5\t= Set City Modifier (Science,Production and Gold)\n\nALT + BACKSPACE = Turn off all cheat switches\n\n(CAPS-LOCK-OFF) ALT + INSERT\t= Resources (Set value to value found in Settings.ini)\n(CAPS-LOCK-OFF) ALT + HOME\t= Gold (Set value to value found in Settings.ini)\n(CAPS-LOCK-OFF) ALT + PAGEUP\t= Culture (Set value to value found in Settings.ini)\n(CAPS-LOCK-OFF) ALT + DELETE\t= Golden Age Progress (Set value to value found in Settings.ini)\n(CAPS-LOCK-OFF) ALT + END\t= Golden Age Turns (Set value to value found in Settings.ini)\n(CAPS-LOCK-OFF) ALT + PGDOWN\t= Great General Progress (Set value to value found in Settings.ini)\n\n(CAPS-LOCK-ON) ALT + INSERT\t= Zero Resources\n(CAPS-LOCK-ON) ALT + HOME\t= Zero Gold\n(CAPS-LOCK-ON) ALT + PAGEUP\t= Zero Culture\n(CAPS-LOCK-ON) ALT + DELETE\t= Zero Golden Progress\n(CAPS-LOCK-ON) ALT + END\t= Zero Golden Turns\n(CAPS-LOCK-ON) ALT + PGDOWN\t= Zero Great General Progress\n\nALT + LEFT\t= Free all used resource slots\nALT + RIGHT\t= Zero all (Will zero out the following):\n\t\t\t1: Gold\n\t\t\t2: Golden Age Progress\n\t\t\t3: Golden Age Turns\n\t\t\t4: Culture\n\t\t\t5: All Strategic and Luxury Resources\n\t\t\t6: Great General Progress\n\n---------------\nUpDown Controls\n---------------\n\nI have added Up-Down controls to all edit boxes in the program.\nYou may change values in an edit box in many ways:\n\n1: Click a button to choose a predefined value.\n2: Click the edit box and type a custom value.\n3: Click the up-down control buttons to change values.\n4: Use the up-down arrow keys on your keyboard.\n5: Use mouse wheel to change values.\n\n---------------\nTroubleshooting\n---------------\n\nQ1: Trainer doesnt work?\nA1: Use only with Civ 5 version 1.0.1.348. It will not work with other versions.\n\nQ2: Trainer still doesnt work?\nA2: Your firewall/antivirus blocked it or sandboxed it. Unblock it, shut down trainer and restart it again\n\nQ3: Trainer is still not working?\nA3: The 6 primary cheats will only update after you click a city or do a next turn.\n\nQ4: I use WinXP and the trainer runs and quits almost instantly?\nA4: Try to run it using Win98 Compatability mode.\n\n--------\nFeedback\n--------\n\nPlease report new suggestions and bug reports here on CivFanatics or on ThePirateBay.org where you can find me under\nthe name of DelphiUniverse. Send an e-mail to the address found in the .rar archive comment section.\n\n------\nAuthor\n------\n\nCoded by DelphiUniverse using Microsoft Macro Assembly.\n\nMy favorite coding equipment:\n\n* SteelSeries 7G keyboard (Nothing close to it, nothing above it)\n* 26&quot; 2ms screen for coding happiness\n","torrent":{"xt":"urn:btih:010a2cebb559e4e04956f769ec63e5c8c45ad699","amp;dn":"Civilization+V+Trainer+v+4.0.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"010a2cebb559e4e04956f769ec63e5c8c45ad699","infoHashBuffer":{"type":"Buffer","data":[1,10,44,235,181,89,228,224,73,86,247,105,236,99,229,200,196,90,214,153]},"announce":[],"urlList":[]}}