{"title":"game of thrones 2011 season 1","uid":7018650,"size":4581663795,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:011a7fbd26561f95235f4f8f9ef4825b87d10d12&amp;dn=game+of+thrones+2011+season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CA2ONT3","files":1,"time":1328750739,"description":"Game of thrones season 1 comes compressed in a .zip file\n\nDIRECTOR\tDavid Benioff (Creator), D.B. Weiss (Creator), Timothy Van Patten, Brian Kirk, Daniel Minahan, Alan Taylor\nSCREENWRITER\tDavid Benioff, D.B. Weiss, Bryan Cogman, Jane Espenson, George R. R. Martin (Novels: George R. R. Martin)\nCOMPOSER\tRamin Djawadi\nCINEMATOGRAPHER\tMatt Jensen, Marco Pontecorvo, Alik Sakharov\nCAST\tSean Bean, Lena Headey, Michelle Fairley, Peter Dinklage, Emilia Clarke, Nikolaj Coster-Waldau, Mark Addy, Kit Harington, Aidan Gillen, Iain Glen, Maisie Williams, Jack Gleeson, Sophie Turner, Jason Momoa, Harry Lloyd, Richard Madden, Julian Glover, Alfie Allen, Ron Donachie, Isaac Hempstead Wright, Charles Dance, Natalia Tena, Peter Vaughan, Conleth Hill, Donald Sumpter, Rory McCann, Amrita Acharia, Susan Brown, Jerome Flynn, Ian McElhinney\nSTUDIO/PRODUCER\tBroadcast by HBO Network; Home Box Office (HBO) / Management 360\nOFFICIAL WEB\thttp://www.hbo.com/#/game-of-thrones\nAWARDS\t2011: 2 Emmy awards: Supp. act (Dinklage), Title design. 11 nominations including Drama\n2011: Golden Globes: Best Supporting Actor TV (Dinklage) 2 nominations\n2011: Satellite Awards: Best Supporting Actor (Peter Dinklage)\nGENRE\tTV Series.\t Drama.\t Adventure.\t Fantasy | Medieval Fantasy\nSYNOPSIS/PLOT\tTV Series. 10 episodes. An adaptation of George R. R. Martin's epic fantasy series &quot;A Song of Ice and Fire,&quot; in which kings, queens, knights and renegades use swords and magic to battle for the throne. Seven noble families fight for control of the mythical land of Westeros. Political and sexual intrigue abound. The primary families are the Stark, Lannister, and Baratheon families. Robert Baratheon, King of Westeros, asks his old friend Eddard Stark to serve as his chief advisor. Eddard, suspecting that his predecessor had been murdered, accepts so that he can investigate further. It turns out more than one family is plotting to take the throne. The Queen's family, the Lannisters, may be hatching a plot to take control. Across the sea, the last surviving members of the previously deposed ruling family, the Targaryens, are also plotting a return to power. The conflict between these families and others, including the Greyjoys, the Tullys, the Arryns, and the Tyrells, leads to war. Meanwhile, in the north, an ancient evil awakens. Amidst war and the political confusion, a brotherhood of misfits, The Night's Watch, is all that stands between the realms of men and the horrors beyond.","torrent":{"xt":"urn:btih:011a7fbd26561f95235f4f8f9ef4825b87d10d12","amp;dn":"game+of+thrones+2011+season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"011a7fbd26561f95235f4f8f9ef4825b87d10d12","infoHashBuffer":{"type":"Buffer","data":[1,26,127,189,38,86,31,149,35,95,79,143,158,244,130,91,135,209,13,18]},"announce":[],"urlList":[]}}