{"title":"History Of French Horror Films Collection","uid":6623537,"size":86115721125,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:01d956aed89407d77669d200d3f10b38f6aebf31&amp;dn=History+Of+French+Horror+Films+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"forcefox","files":313,"time":1314092743,"description":"HISTORY OF FRENCH HORROR FILMS COLLECTION (1896-2010)\n\nENGLISH SUBTITLES AND SOME FILMS ENGLISH DUBBED. 1 OR 2 FILMS NO SUBTITLES OR ENGLISH DUBBED.\n\nFrance's tradition of filmmaking is as long and as rich as any country's. Although it's more renowned for its high dramas, its edgy experimentalism and its art house sensibilities, French cinema also has an eclectic history within the horror genre.\n\nPioneers\n\nEven before its had a viable movie industry, France displayed an obsession with macabre visual arts through the popularity of the Grand Guignol Theater in Paris, a forum dedicated to horrific plays that climaxed in gruesome violence. It didn't take long, then, for the country to adapt its dark curiosity to the fledgling cinema.\n\nGeorges MÃƒÂ©liÃƒÂ¨s, famed for creating the first science fiction film with 1902's A Trip to the Moon, had, some six years earlier, directed what is believed to be the first horror movie, a three-minute short entitled The House of the Devil. A simple film with little plot, its imagery of bats, witches, ghosts, skeletons, cauldrons and Satan himself established an early template for supernatural cinema. MÃƒÂ©liÃƒÂ¨s followed that up with a dozen horror-themed shorts over the next decade (amidst the 500-plus films he shot), with titles such as The Devil's Laboratory, The Infernal Boiling Pot, The Cave of the Demons and Summoning the Spirits. MÃƒÂ©liÃƒÂ¨s' films were extravaganzas of magic tricks and special effects, creating the sort of visual awe and grotesque displays that would characterize later horror cinema.\n\nPioneering filmmaker Abel Gance likewise directed early supernatural shorts, such as The Mask of Horror (1912) and Help! (1924), but made a more indelible mark with his feature films. In 1919, he directed I Accuse, a frank anti-war response to France's involvement in World War I that culminated in the corpses of dead soldiers rising from their graves to declare their opposition to war. Gance would later remake the film in 1938 on the verge of World War II.\n\nIn 1929, surrealist Luis BuÃƒÂ±uel directed one of the most famous examples of French avant-garde cinema, Un Chien Andalou (An Andalusian Dog), which featured horrific imagery aimed at shocking the viewer -- including the famed shot of a woman's eye being slit with a razor.\n\nOld Standards\n\nDespite the groundbreaking early work of French filmmakers, many French horror movies made between the late '20s and the early '60s recycled old classic works. For instance:\n\n    * In 1928, Jean Epstein brought Edgar Allan Poe's story &quot;The Fall of the House of Usher&quot; to the screen.\n    * Maurice Tourneur's La Main du Diable (Carnival of Sinners) (1943) is a retelling of the age-old Faust legend, with a man selling his soul to the Devil in exchange for wealth and success.\n    * Beauty and the Beast (1946) was one of the most important films of this era, horror or otherwise, for its breathtaking visuals, set design and cinematography.\n    * The Hunchback of Notre Dame (1956), starring Anthony Quinn as Quasimodo, was a natural choice to film in the actual Notre Dame Cathedral in Paris.\n    * Acclaimed director Jean Renoir made his only venture into horror in 1959 with a version of Robert Louis Stevenson's tale of Dr. Jekyll and Mr. Hyde, entitled The Doctor's Horrible Experiment.\n    * The Hands of Orloc (1960) revisited a lesser-known tale of a hand transplant gone awry, which had been filmed twice previously, first in Germany and then in the US.\n\nInnovation\n\nWith 1955's Diabolique, however, French suspense-horror began to show the sort of cutting-edge artistry that characterized the country's other film genres. On par with Hitchcock's best, the tale of murder and revenge was a sensation around the world, eventually spawning an American remake four decades later.\n\nLater, in 1960, director Georges Franju delivered Eyes Without a Face, often considered the best French horror film of all time. Both horrific and eerily beautiful, Franju's work is a modern Frankenstein tale of sorts, with a mad doctor frantically trying to find a suitable donor for his disfigured daughter's face transplant.\n\nLess artistic but equally innovative was Jean Rollin, who's often credited with directing the first French vampire movie, 1967's The Rape of the Vampire. The film established a formula that would become Rollin's trademark: gothic, artsy, erotic horror that often revolves around female vampires. Substance plays second fiddle to style in his work, which stirred up controversy due to its extreme sexuality commingled with graphic violence. Rollin would later establish levels of gore previously unknown in French horror with the zombie flick The Grapes of Death (1978).\n\nMore restrained is Roman Polanski's The Tenant (1976), a psychological mystery about a man (played by Polanski himself) descending into madness after moving into an eerie apartment building. It mines horror within the realities of urban life and interpersonal relations and is uncompromising in its dark, ambiguous conclusion.\n\nModern Horror\n\nThis new wave of progressive horror bore little fruit in the '80s, however, when horror cinema around the world came to be dominated by low-brow slashers and zombie flicks. It wasn't until the turn of the 21st century that French horror began to generate enough quality content on a consistent level to make a name for itself.\n\nModern French horror and suspense is among the most edgy of any nation's cinematic efforts. The films thrive on unsettling the audience, whether on a psychological level -- as in With a Friend Like Harry... (2000) or CachÃƒÂ© (2005) -- or on a visceral, violent level, as with High Tension (2003), Sheitan (2006) or Inside (2007). Like all envelope-pushing art, they sometimes spur controversy -- see Trouble Every Day's notorious blend of sex and cannibalism or the Frontier(s) violence so extreme that it was threatened with an NC-17 rating -- but at the same time, French horror continues to prove its innovation.\n\nThe haunted orphanage tale Saint Ange (2004), for instance, predated the similarly-themed Spanish hit The Orphanage by three years, and They Came Back (2004) put a dramatic, realistic spin on zombie lore. Meanwhile, movies like Brotherhood of the Wolf, Requiem and Blood Mallory mix horror with action, comedy and other genres to craft an undefinable style. \n\n Notable French Horror Movies:\n\n    * The House of the Devil (1896)\n    * I Accuse (1919)\n    * The Fall of the House of Usher (1928)\n    * Un Chien Andalou (An Andalusian Dog) (1929)\n    * I Accuse (1938)\n    * La Main du Diable (Carnival of Sinners) (1943)\n    * Beauty and the Beast (1946)\n    * Diabolique (1955)\n    * The Hunchback of Notre Dame (1956)\n    * Les Louves (Demoniac) (1958)\n    * Blood and Roses (1960)\n    * Eyes Without a Face (1960)\n    * The Hands of Orloc (1960)\n    * The Rape of the Vampire (1967)\n    * Girl Slaves of Morgana Le Fay (1971)\n    * Man With the Transplanted Brain (1971)\n    * Shock Treatment (1973)\n    * The Tenant (1976)\n    * Grapes of Death (1978)\n    * Zombie Lake (1981)\n    * The Living Dead Girl (1982)\n    * Frankenstein 90 (1984)\n    * Baby Blood (1990)\n    * Deep in the Woods (2000)\n    * Six-Pack (2000)\n    * With a Friend Like Harry... (2000)\n    * Brotherhood of the Wolf (2001)\n    * Requiem (2001)\n    * Trouble Every Day (2001)\n    * Bloody Mallory (2002)\n    * In My Skin (2002)\n    * MalÃƒÂ©fique (2002)\n    * High Tension (2003)\n    * Saint Ange (2004)\n    * They Came Back (2004)\n    * CachÃƒÂ© (2005)\n    * Sheitan (2006)\n    * Them (2006)\n    * Eden Log (2007)\n    * Frontier(s) (2007)\n    * Inside (2007)\n    * Mutants (2010)\n    * The Horde (2010)\n\n\n\nFILMS IN HISTORY OF FRENCH HORROR FILMS COLLECTION (1896-2010)\n\nAn Chien Andalou (1929)\nAquarium (2002)\nBaby Blood (1990)\nBaise-moi (2000)\nBELPHEGOR Phantom Of The Louvre (2001)\nBlood And Roses (1960)\nBloody Mallory (2002)\nBroceliande (2002)\nBrotherhood Of The Wolf (2001)\nCache (2005)\nCalvaire (2004)\nClass Trip (1998)\nDark Portals THE CHRONICLES OF VIDOCQ (2001)\nDaughters Of Darkness (1971)\nDeep In The Woods (2000)\nDevil Story (1985)\nDoctor Jeckyll's Mistresses (1964)\nDoctor Orloff Against The Invisible Man (1971)\nDont Deliver Us From Evil (1971)\nDont Look Back (2009)\nEden Log (2007)\nEmpire Of The Wolves (2005)\nEyes Without A Face (1960)\nFaceless (1988)\nFall Of The House Of Usher (1928)\nFears Of The Dark (2007)\nFemale Vampire (1973)\nFrankenstein 90 (1984)\nFrontiers (2007)\nGeorge Melies FIRST WIZARD OF CINEMA-5 discs (1896-1913)\nGirl Slaves Of Morgana Le Fay (1971)\nGradiva (2006)\nHarry He's Here To Help (2000)\nHellphone (2007)\nHistoires Extroardinaires- SPIRITS OF THE DEAD (1968)\nHumains (2009)\nHunchback Of Notre Dame (1956)\nI Am The Ripper (2004)\nInland Empire (2006)\nI Stand Alone (1998)\nIn My Skin (2002)\nInside (2007)\nIrreversible (2002)\nJ'Accuse (1919)\nJ'Accuse (1938)\nLa Belle Et La Bete- BEAUTY AND THE BEAST (1946)\nLa Main Du Diable- CARNIVAL OF SINNERS (1943)\nLady Blood (2010)\nLeonor (1975)\nLes Diaboliques (1955)\nLes Louves (1957)\nMalefique (2003)\nMartyrs (2008)\nMill Of The Stone Women (1960)\nMulholland Drive (2001)\nMutants (2009)\nNight Of Death (1980)\nOasis Of The Zombies (1981)\nOgroff The Mad Mutilator (1983)\nRabid Grannies (1988)\nRequiem (2001)\nResonnances (2006)\nRevenge Of The Living Dead Girls (1987)\nSaint Ange (2004)\nSheitan (2006)\nSerial Lover (1998)\nSeven Women For Satan (1976)\nSilent Hill (2006)\nSix-Pack (2000)\nSombre (1998)\nSwitchblade Romance- HAUTE TENSION (2003)\nTell No One (2006)\nThe Awful Doctor Orloff (1962)\nThe Beast (1975)\nThe Blood Rose (1970)\nThe Broken (2008)\nThe Butcher (1970)\nThe Crimson Rivers (2000)\nThe Crimson Rivers 2 ANGELS OF THE APOCALYPSE (2004)\nThe Doctor's Horrible Experiment (1959)\nThe Grapes Of Death (1978)\nThe Hands Of Orlac (1964)\nThe Living Dead Girl (1982)\nThe Night Of The Hunted (1980)\nThe Rape Of The Vampire (1968)\nThe Tenant (1976)\nThe Vanishing (1988)\nThe Witching Hour (2006)\nThem (2006)\nThey Came Back (2003)\nTraitement De Choc- SHOCK TREATMENT (1973)\nTrouble Every Day (2001)\nUn Jeu D'Enfants (2001)\nVertige (2009)\nVinyan (2008)\nZombie Lake (1981)\nAND A FEW MORE FILMS THAT I HAVE NOT LISTED","torrent":{"xt":"urn:btih:01d956aed89407d77669d200d3f10b38f6aebf31","amp;dn":"History+Of+French+Horror+Films+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01d956aed89407d77669d200d3f10b38f6aebf31","infoHashBuffer":{"type":"Buffer","data":[1,217,86,174,216,148,7,215,118,105,210,0,211,241,11,56,246,174,191,49]},"announce":[],"urlList":[]}}