{"title":"The.Guardian.S01E16.HDTV.XviD-The.Buzzsaw","uid":6509645,"size":367058944,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:02b09ab2d6c6e9926b765176b1e2a0b46d0eb00b&amp;dn=The.Guardian.S01E16.HDTV.XviD-The.Buzzsaw&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"The.Buzzsaw","files":-1,"time":1309569630,"description":"                      Welcome to {Buzzsaw Tv}\n\n\n                                                                                                  Please look fot the following names \n                to ensure you do NOT get a fake file.\n\n                {EZTV, Sceneline, VTV, extremezone, The.Buzzsaw,\n                 TvTeam, .BONE. , and anyone who has either a \n                 green or hot pink &quot;Skull and Crossbones&quot; under\n                 thier torrent name! Don't be fooled by those idiots \n                 who keep changing their name and downloading fake\n                 files. Also check out www.torrentday.com where only  \n                 they upload the files and they are never any fakes!} \n\n\n\n         \n                          \n                          Series:  &quot;The Guardian&quot;\n\n                      \n                      Season One (1) Episode Sixteen (16)\n\n   \n     *Starring Simon Baker as Nick Fallin who also stars in &quot;The Mentalist&quot; as Patrick Jane*\n\n\n\n    Nick Fallin is a hotshot lawyer working at his father's ultrasuccessful Pittsburgh law firm. Unfortunately, the high life has gotten the best of Nick. Arrested for drug use, he's sentenced to do 1,500 hours of community service, somehow to be squeezed into his 24/7 cutthroat world of mergers, acquisitions and board meetings. Reluctantly, he's now The Guardian - a part-time child advocate at Legal Aid Services, where one case after another is an eye-opening instance of kids caught up in difficult circumstances. Written by GG\n\n\nCBS DVD (distributed by Paramount) has released the all three seasons of The Guardian on DVD in Region 1.\n \n \n\n     This series revolves around protagonist Nick Fallin (Simon Baker), a hotshot lawyer working at his father's ultrasuccessful Pittsburgh law firm. Unfortunately, the high life has gotten the best of Nick. Arrested for drug use, he's sentenced to do 1,500 hours of community service, somehow to be squeezed into his 24/7 cutthroat world a corporate attorney sentenced to 1500 hours community service with Legal Services of Pittsburgh as the result of a drug conviction. The plot focused on Nick's community service and recovery from drug addiction, as well as his strained relationship with his father who was president of the corporate law firm where Nick was employed full time. \n\n     Starring Simon Baker who is known also as Patrick Jane from the CBS American police procedural television series, The Mentalist. Baker made a fantastic decision to join the cast of &quot;The Guardian&quot; and star in David Hollander's award winning creation. Other actors that co-star in this ultra-popular multi-award winning television series include Alan Rosenberg, Dabney Coleman, Charles Malik Whitfield, and many others. &quot;The Guardian&quot; won 6 Golden Globe awards and was nominated for 10 more respectively!\n\n     Buzzsaw TV will be uploading a new episode of &quot;The Guardian&quot; almost daily, and in the order that was established to follow the plot. All uploads will be &quot;Avi&quot; format exclusively, and as always have great picture and audio quality. Sixty-seven(67) episodes total over the next two+ months, and don't forget to always explore The.Buzzsaw as we are committed to bringing the highest rated TV shows and movies that are not found easily on the web.\n\n","torrent":{"xt":"urn:btih:02b09ab2d6c6e9926b765176b1e2a0b46d0eb00b","amp;dn":"The.Guardian.S01E16.HDTV.XviD-The.Buzzsaw","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02b09ab2d6c6e9926b765176b1e2a0b46d0eb00b","infoHashBuffer":{"type":"Buffer","data":[2,176,154,178,214,198,233,146,107,118,81,118,177,226,160,180,109,14,176,11]},"announce":[],"urlList":[]}}