{"title":"Het Wassende Water, (3DVD)( dvd 1)(nl subs) Jack TBS","uid":6509486,"size":4657252165,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:02e55ebeb5bef5d304f891f2349bca94ca9392e6&amp;dn=Het+Wassende+Water%2C+%283DVD%29%28+dvd+1%29%28nl+subs%29+Jack+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Betty-Boop","files":-1,"time":1309562848,"description":"Het Wassende Water, (3DVD)( dvd 1)\n\n[img]http://img827.imageshack.us/img827/4339/posterlu.jpg[/img]\n\nEen oer-Hollands drama met acteurs van naam. Een kijkcijfersucces uit 1986 met meer dan 6 miljoen kijkers. Een prachtige tv-verfilming van het beroemde boek van Herman de Man - dat alles is Het Wassende Water.\n\nDe serie speelt zich af in de Lopikerwaard anno 1900, waar de welgestelde boerenfamilie Beijen de hoeve Watersnoodt beheert. Een regelmatig leven, maar met de voortdurende dreiging van overstromingen. En met de angst voor het onbekende en de toorn van God. De dominee dondert: &quot;De straf zal komen en de dijken zullen breken.&quot;\n\nGieljan Beijen (Thom Hoffman) is een stuurse, zwijgzame jongeman die in opstand komt tegen zijn protestantse opvoeding. Eerst gehoorzaamt hij nog aan de strenge stem van zijn moeder, boerin Thera (Kitty Courbois). Hij laat zijn grote liefde Nelia in de steek en trouwt met Aaigie, terwijl hij niet van haar houdt. Aaigie sterft in haar eerste kraambed. Uit woest verdriet en uit protest, slaat Gieljan aan het dolen.\n\n\nEnglish\n\nA traditional Dutch name of drama with actors. A ratings success in 1986 with over 6 million viewers. A stunning television adaptation of the famous book by Herman de Man - all this is the rising water. \n\nThe series is set in the Lopikerwaard in 1900, where the wealthy peasant family Beijen Watersnoodt manages the farm. A regular life, but with the constant threat of flooding. And with the fear of the unknown and the wrath of God. The pastor thunders: &quot;The punishment will come and the levees will break.&quot; \n\nGieljan Beijen (Thom Hoffman) is a surly, taciturn young man who rebels against his Protestant upbringing. At first he had to obey the stern voice of his mother, farmer Thera (Kitty Courbois). He shows his love Nelia abandon Aaigie and marries, but he does not love her. Aaigie dies in her first childbirth. Of wild sorrow and protest strikes Gieljan to wander. \n\n\n\nBeeld........: 4:3\nGeluid.......: Dolby Digital 2.0\nTaalkeuze....: Nederlands\nExtra's:\n\nEXTRA - Documentaire Herman de Man (1986 - 45 min.)\n\nNCRV-documentaire van Jelte Rep over de schrijver van het boek Het wassende water. Als zoontje van een joodse koopman groeide De Man op in de Lopikerwaard. Hij leerde de streek kennen toen hij met koopwaar van boerderij naar boerderij trok. Op die lange tochten werd de schrijver Herman de Man geboren, die zoveel lezers heeft ontroerd met zijn verhalen. Zijn eigen leven was stormachtig en tragisch. In de oorlogsjaren verloor hij het grootste deel van zijn gezin en kort daarna kwam hij om het leven, toen de KLM Dakota waarin hij naar Nederland vloog neerstortte.","torrent":{"xt":"urn:btih:02e55ebeb5bef5d304f891f2349bca94ca9392e6","amp;dn":"Het+Wassende+Water%2C+%283DVD%29%28+dvd+1%29%28nl+subs%29+Jack+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02e55ebeb5bef5d304f891f2349bca94ca9392e6","infoHashBuffer":{"type":"Buffer","data":[2,229,94,190,181,190,245,211,4,248,145,242,52,155,202,148,202,147,146,230]},"announce":[],"urlList":[]}}