{"title":"top.chef.s09e05.dont.be.tardy.for.the.dinner.party.proper.hdtv.x","uid":6867299,"size":366995456,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:031e9989364c51c23804fdc772f681ac97963b31&amp;dn=top.chef.s09e05.dont.be.tardy.for.the.dinner.party.proper.hdtv.x&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FatFredd229","files":1,"time":1323151220,"description":"Genre: Reality-TV\n\nYear: 2011\n\nCountry: USA\n\nRuntime: 42 min\n\nProducer: Tom Colicchio\n\nCast: Judge: Tom Colicchio, Padma Lakshmi and Gail Simmons\n\n\n\n.: Plot :.\n\nBravo launches the search for the world's next top chef. Each week a group of talented chefs, professionally trained and self-taught, will be given a culinary challenge and well known judges will eliminate one contestant each week until a winner is named. The ten-episode, one-hour series capitalizes on the network's knack for finding and fostering top creative talent, while still delivering on the personalities and conflict that make for deliciously fun entertainment.\n\n\n\nEach episode of &quot;Top Chef&quot; holds two challenges for the chefs. The first is a quickfire test of their basic abilities and the second is a more involved elimination challenge designed to test the versatility and invention of the chefs as they take on unique culinary trials such as working with unusual and exotic foods or catering for a range of demanding clients. The food will be tasted and evaluated by the host and judges, but will also be served to the customers for whom the challenge is aimed, whether it be patrons at a five star restaurant or a room full of hungry kids. Food has to appeal to the diner as well as the critics if the chef is to survive.\n\n\n\nThe winning chef will receive $100,000 in seed money to help encourage their culinary career, be featured in Food &amp; Wine magazine, appear at the Food &amp; Wine Classic in Aspen in June 2006, and most importantly, earn the prestigious title of &quot;Top Chef.&quot;\n","torrent":{"xt":"urn:btih:031e9989364c51c23804fdc772f681ac97963b31","amp;dn":"top.chef.s09e05.dont.be.tardy.for.the.dinner.party.proper.hdtv.x","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"031e9989364c51c23804fdc772f681ac97963b31","infoHashBuffer":{"type":"Buffer","data":[3,30,153,137,54,76,81,194,56,4,253,199,114,246,129,172,151,150,59,49]},"announce":[],"urlList":[]}}