{"title":"Hentai / Slutty Princess Diaries 1-2-3","uid":6635037,"size":968535514,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:03c8be44244afbe1d3c085ababaa422447da3065&amp;dn=Hentai+%2F+Slutty+Princess+Diaries+1-2-3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jimevjr","files":6,"time":1314528445,"description":"UNCENSORED Japanese audio with English subs \n\n\nSlutty Princess Diaries - Vol 1 [Japanese](Episode 1)\n\nAfter losing his mom to a mysterious death, Distol swore to himself that he will be the best swordsman \nin the world. However, his tragedy doesn't end there... Eight years after his mother's death, more bad \nnews is brought to Distol. His sister, Princess Qoona, is chosen as the Holy Maiden. The Holy Maiden \nsacrifices her own life to give power to the seal that binds the demon king within. Normally, this would \nbe a thing be proud of, but Distol does not want to lose another person he loves. As Distol curses himself \nfor not being able to protect the person that he loves, a witch appears out of nowhere and makes an offer \nto Distol. The offer is: In return of giving great powers, you must invade Bastarauge, take the nation's \ntreasure, kidnap Princess Elena, and corrupt her from within. A new dark age is about to begin...\n\nSlutty Princess Diaries - Vol 2 [Japanese](Episode 2)\n\nDistol, the prince of Asteria, loses everything he loves except for one, his beloved Princess Qoona. However, \nshe too is about to be lost because she was chosen as the Holy Maiden, a sacrifice for the seal that binds \nthe demon king. Distol must invade Bastarauge and get its treasure as he does his best in corrupting Princess \nElena to weaken the seal that lies within her body. He must embrace evil to save his one and only love, \nPrincess Qoona...\n\nSlutty Princess Diaries - Vol 3 [Japanese](Episode 3)\n\nDistol finally completes his end of the deal and now he can save Princess Qoona...or so he thought. The treasure \nhe has taken from Bastarauge was to break the seal that Princess Elena carries inside her body, and now that the \nseal is broken, the great Demon King has awakened! The witch, Eleanor, used Distol to awaken her true master. \nRealizing what he has done, Distol, now vows to fight for the side of good, and destroy the Demon King. What \nfate awaits the world? Is it a new dark-age, or will the side of good bring peace to the world? Only God may \nknow the answer to that question.","torrent":{"xt":"urn:btih:03c8be44244afbe1d3c085ababaa422447da3065","amp;dn":"Hentai+%2F+Slutty+Princess+Diaries+1-2-3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03c8be44244afbe1d3c085ababaa422447da3065","infoHashBuffer":{"type":"Buffer","data":[3,200,190,68,36,74,251,225,211,192,133,171,171,170,66,36,71,218,48,101]},"announce":[],"urlList":[]}}