{"title":"Wondershare ViVideo 2.0.0.10 Portable(CondazArow)","uid":6621520,"size":107440349,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:04c44c5558ac5b97fcaa069823c392ae9ef5ecc6&amp;dn=Wondershare+ViVideo+2.0.0.10+Portable%28CondazArow%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CondazArow","files":13,"time":1313973415,"description":"CondazArow\n\n-----------------\n\n\nWhy Choose Vivideo?\nWondershare Vivideo, an easy-to-use video editor with all the video editing tools you need, allows you to create Hollywood-like home movies with text, filter, motion and transition effects from all regular videos, audios and photos. Besides, you can directly upload your video to YouTube for sharing with family and friends, save videos for playback on portable devices like iPhone, iPad, iPod, etc. or burn DVD for better video preservation. No matter it's a wedding video, love movie, travel story, life documentary or party record, it is just so easy to turn it to a treasured home video and share it with everyone!\nManage Various Video, Audio and Photo Formats\nSupport all SD and HD videos, including WMV, AVI, MP4, FLV, MOV, MKV, MTS, etc. You can also capture videos directly with a video capture device or add videos from camcorders and other external hard drives directly. \nAdd background music to your videos to add more flavor. All regular audio formats like MP3, WMA, WAV, M4A, AAC, AC3, OGG, etc. are supported.\nImport photos like BMP, JPG, PNG, GIF, etc. and create home movies with photos and videos combined. \n\nEdit and Enhance Your Media Files with Fantasy\nEdit and personalize videos/photos/audios with video editing features like trim, crop, rotate, set fade in &amp; fade out, adjust duration, etc.\nAdd stylish captions on your videos and photos with customizable font, color, etc. to for better video meaning conveying. \nBring your movie to the next level instantly with professional and creative filter effects. 30+ filters are ready for your videos and photos. \nAdd transition effects between two clips and apply motion effects to photos so as to achieve a natural and smooth transition. \n\nShare Your Videos with Family and Friends in Multiple Ways\nGet optimized videos for playback on your portable devices like iPhone, iPad, PSP, iPod, Wii, Zune, etc.\nSave edited videos to local hard drive for further use in a variety of video formats.\nDirectly upload your video creation to YouTube for sharing with more people by filling in necessary information.\nBurn videos to DVD discs or save as DVD folder or ISO image files to preserve videos in a better way. \n\nThanks for seeding and commenting on my torrents!!!","torrent":{"xt":"urn:btih:04c44c5558ac5b97fcaa069823c392ae9ef5ecc6","amp;dn":"Wondershare+ViVideo+2.0.0.10+Portable%28CondazArow%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04c44c5558ac5b97fcaa069823c392ae9ef5ecc6","infoHashBuffer":{"type":"Buffer","data":[4,196,76,85,88,172,91,151,252,170,6,152,35,195,146,174,158,245,236,198]},"announce":[],"urlList":[]}}