{"title":"BORG: Incursion - The Next Level","uid":6862565,"size":129468825,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:04cb54a6a5926a748a3415a3144629225829c453&amp;dn=BORG%3A+Incursion+-+The+Next+Level&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Maverick2587","files":1,"time":1322953207,"description":"v1.0 of the completed mod. Please read the available readme file in the downloaded zip for full information. hide detail -\n\nThis mod is my own attempt to breath some life into the 12 year old Star Trek Armada 1. Contents can be found as follows:\n\n- Each of the four sides has had a complete set of replacement base ships and stations for it.\n- Federation, Romulan and Klingon sides have complete access to stations and ships from the Cardassian/Dominion combine.\n- All four sides have a second level of construction advancements. This includes new facilities and updates according to each sides main objective or capability.\n- Hero ships are, for the most part, more unique and generally have classes of ship that cannot be regularly built.\n- All single player maps have had minor changes to them. Although the missions remain the same there will be differences to the maps themselves. This includes additional units or phsyical changes to the map layout themselves.\n- Map editor has been updated to give access to create new maps using may of the new units available (unfortunately, due to limitations of the editor itself access to everything isn't possible at this time).\n\nSo as you can see. Alot has been changed and whilst this project has only be announced for a short time, it has been going for some nine months or so.\n\nFor further information please refer to the mods main readme file located in the main zip file download. Thanks for downloading this mod.\n\nMajor A Payne.\n\nGame: Star Trek: Armada I\n","torrent":{"xt":"urn:btih:04cb54a6a5926a748a3415a3144629225829c453","amp;dn":"BORG%3A+Incursion+-+The+Next+Level","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04cb54a6a5926a748a3415a3144629225829c453","infoHashBuffer":{"type":"Buffer","data":[4,203,84,166,165,146,106,116,138,52,21,163,20,70,41,34,88,41,196,83]},"announce":[],"urlList":[]}}