{"title":"Dead or Alive - Youthquake","uid":6602995,"size":287340329,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:04eef8977aabf05e7c82466ef4268158745eccba&amp;dn=Dead+or+Alive+-+Youthquake&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"cdda-flac","files":-1,"time":1313290037,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/512upD-kACL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/512upD-kACL._SS500_.jpg&lt;/a&gt;\n\n\nTitle: Youthquake\nArtist: Dead or Alive\nAudio CD (October 25, 1990)\nOriginal Release Date: 1985\nNumber of Discs: 1 \nGenre: Pop\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. You Spin Me Round (Like a Record)\n02. I Wanna Be a Toy\n03. DJ Hit That Button\n04. In Too Deep\n05. Big Daddy of the Rhythm\n06. Cake and Eat It\n07. Lover, Come Back to Me\n08. My Heart Goes Bang\n09. It's Been a Long Time\n\n\nAllmusic Review:\nSwitching to the noted Stock/Aitken/Waterman production team, Peter Burns and crew brought it all together on an undisputed-'80s classic. Though arguably the singles hold up better in the end than the album does, there's no question that in terms of sheer hooks, fun, and drama, Youthquake is a pure pop delight by any measure. No question that the band's over the top image had a lot to do with it -- Burns in particular dressed and posed in the kind of outfits and presentations that made Boy George look like a missionary -- but all it takes is the first song to get any party going. &quot;You Spin Me Round (Like a Record)&quot; has an instantly catchy chorus, bright, kicky synth tones, and fantastic delivery from Burns, right from the opening: &quot;And I!&quot;\n \nNo less great is the other huge single, &quot;Lover Come Back to Me&quot;.&quot; When Burns commands at the end of the chorus, &quot;Kick it right down, right down!&quot; it's as memorable as mass media pop of any stripe ever gets. The Stock/Aitken/Waterman crew doesn't do all that much different per sÃƒÂ© on this album than Zeus B Held did on the previous one. While once or twice the trio's tendency towards relative blandness gets the better of the material, most of the time it's a good marriage between Burns' overarching sense of style, and his projection and commercial aims. Where things falter is when the clichÃƒÂ©s creep in. Orchestral stabs weren't anything new by the time &quot;I Wanna Be a Toy&quot; was littered with them, while everything from sampling stutters to drum pads inevitably call to mind everyone who tinkered with them first. But just let Burns crank up his theatrical wail and amiable sense of sleaze over a good beat and melody, like the string-tinged Philly disco sweep of &quot;In Too Deep,&quot; or his desire to &quot;send this sloppy kiss to you&quot; on &quot;Big Daddy of the Rhythm,&quot; and the results beat out all objections.","torrent":{"xt":"urn:btih:04eef8977aabf05e7c82466ef4268158745eccba","amp;dn":"Dead+or+Alive+-+Youthquake","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04eef8977aabf05e7c82466ef4268158745eccba","infoHashBuffer":{"type":"Buffer","data":[4,238,248,151,122,171,240,94,124,130,70,110,244,38,129,88,116,94,204,186]},"announce":[],"urlList":[]}}