{"title":"Bopup.Observer.v4.4.1.Network.Instant.Messenger.Software.Multili","uid":6569999,"size":9843364,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:067621eefa12daef0afe48079a7c44324746954b&amp;dn=Bopup.Observer.v4.4.1.Network.Instant.Messenger.Software.Multili&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"boffon","files":-1,"time":1311900068,"description":"Bopup Observer version 4.4.1.6372\nSecure one-way instant messenger for alerting and notification purposes\n\nThis torrent includes English, German, Spanish, French, Dutch and Russian \nsetup packages of the product.\n========================================================================\n\n[OVERVIEW]\n\nBopup Observer is a secure one-way messenger designed for alerting and \nnotification purposes. This clear, easy to use and light-weight IM \nclient can be deployed on LAN or enterprise-size networks and helps you \nkeep users informed and updated instantly. \n\nThe messenger supports rich-text messages including links, font and \ncolor formatting, emoticons, and it can receive files and directories \nfrom the IM server and other users. You can get urgent messages or \nactivate the Confirmation Mode on the IM server that pops up the program \nwhen a message is received and keeps it on top until the user clicks the \nConfirm Message button. \n\nMessaging and File Transfer are encrypted with strong algorithms so that \npersonal and group conversations are safe and secure even if you receive \nmessages and files via the Internet. You will never lose any information \nyou receive because offline messages and transfers are stored and \nautomatically delivered by the server when the recipient goes online. \n\nNo user experience and skills are needed to use the program. The smart \nand comfortable user interface with advanced usability options and popup \nnotifications allows you to join the IM network in a few mouse clicks. \nThe messenger completely supports the Terminal Server/Citrix environment \nand can be used simultaneously by multiple users on one computer. Bopup \nObserver can automatically download and install updates from the IM \nserver. \n\nThe centralized client/server architecture offers complete and flexible \nmanagement for controlling your IM infrastructure. The central server \nlogs all user activity and archives all messages and file transfers with \nthe reporting, search and printing options. It allows you to manage \nmessaging groups, users' contact information and permissions to send and \nview other users, assign and distribute important files and documents to \nusers. It is easy to import user accounts from your Active Directory \n(LDAP) and start an efficient Instant Messaging system right now. \n\n\nKey features:\n\nSECURE COMMUNICATION\nAll messages and file transfers are encoded with strong encryption \nalgorithms. That is the first and primary way to make corporate IM safe \nand secure. \n\nMESSAGING GROUPS\nThe centralized management of user groups allows organizing a flexible \nIM structure with a list of assigned groups and send/receive-only \npermissions available to each user. \n\nEASE OF USE\nThe smart and handy user interface is intuitive and easy. It really is. \n\nOFFLINE MESSAGING AND FILE TRANSFER\nDeliver important information to users even if they are currently \nunavailable and receive such messages and files. Offline messages and \ntransfers are stored on the IM server and automatically delivered to the \nrecipient when he goes online. \n\nFILE DISTRIBUTION\nReceive files and documents that are assigned to you on the IM server. \nThis feature offers an easy and secure distributing files and \ndirectories with a set of advanced flags. \n\nFAVORITE MESSAGES\nSelect your favorite messages with important information and they will \nbe always in your message list until you delete them. \n\nTERMINAL SERVER SUPPORT\nThe complete support for the Terminal Server, Citrix environments and \nWindows XP Fast User Switching feature. The messenger can be used by \nmultiple users connected to the same server via Terminal Client sessions \nor by several users who have logon sessions on the same computer. \n\nCENTRALIZED NOTIFICATION\nReceive notifications and urgent messages from the IM server and stay \nupdated on any events and information. These messages are automatically \nsent by the server on the scheduled time and at the specified intervals. \n\nCONFIRMATION MODE\nActivate the confirmation mode on IM server that pops-up the program on \nmessage reception and keeps it on top of other windows until user clicks \nthe Confirm Message button. \n\nMESSAGE AND TRANSFER LOGGING &amp; ARCHIVING\nBrowse, search and view the entire message and file transfer archive on \nthe IM server. Print data for any period, for any person. \n\nINSTANT UPDATES FROM THE IM SERVER\nThe messenger can be instantly updated from the central IM server. This \nfeature allows you to keep client versions up-to-date and deploy new \nsoftware updates and patches in a completely automated way without \nhaving to manually install it on all user computers. \n\n\n[SYSTEM REQUIREMENTS]\n\nThe following minimum system configuration is required: \n\n* 533 MHz processor (or higher recommended) \n* 64 MB RAM \n* 3 MB free disk space \n* Microsoft Windows 98/ME/NT 4.0/2000/XP/2003/Vista/7\n* Network configured for TCP/IP protocol \n* Internet connection (*Optional)\n\n\n[LIMITATIONS]\n\nThis is 30-day trial version! For advanced details and purchasing \ninformation please refer B Labs website and product page at      &lt;a href=&quot;\nhttp://www.bopup.com/products/observer/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bopup.com/products/observer/&lt;/a&gt;\n\n\n========================================================================\nCopyright (C) 2000-2011 B Labs. All rights reserved.   &lt;a href=&quot;\nhttp://www.bopup.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bopup.com/&lt;/a&gt;\t","torrent":{"xt":"urn:btih:067621eefa12daef0afe48079a7c44324746954b","amp;dn":"Bopup.Observer.v4.4.1.Network.Instant.Messenger.Software.Multili","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"067621eefa12daef0afe48079a7c44324746954b","infoHashBuffer":{"type":"Buffer","data":[6,118,33,238,250,18,218,239,10,254,72,7,154,124,68,50,71,70,149,75]},"announce":[],"urlList":[]}}