{"title":"Blind Faith - CJ Lyons (epub, mobi, opf, pdf)","uid":6653482,"size":2947314,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:06b16e912932ba72e39a5e1dc8128f1a8faf6505&amp;dn=Blind+Faith+-+CJ+Lyons+%28epub%2C+mobi%2C+opf%2C+pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"B1adE007","files":-1,"time":1315242893,"description":"The files are in .pdf, .mobi, .epub and .opf\nPlease seed, +1 and comment\nTHANK YOU!!\nB1adE007  \n\n\n\nReview\nTOP PICK! 4 1/2 Stars: This story is so fast paced with so many mesmerizing characters, &quot;fantastic&quot; is not high enough praise. Lyons proves once again that she is a master of suspense and nontraditional romance.~RT Book Reviews\n\nBLIND FAITH by CJ Lyons had five stars written all over it from the moment I started reading. This is a great novel, and I would definitely recommend CJ Lyons and her thrillers to readers. ~Chicklitplus.com/blind-faith-cj-lyons/\nProduct Description\nCJ Lyons' romantic thrillers have been described as &quot;the perfect blend of romance and suspense&quot; by New York Times Bestseller Sandra Brown.\n\nTOP PICK! &quot;This story is so fast paced with so many mesmerizing characters, 'fantastic' is not high enough praise. Lyons proves once again that she is a master of suspense and nontraditional romance.&quot;~RT Book Reviews\n\nWhen her husband and son are murdered, she thought she'd lost it all. But for Sarah Durandt the nightmare is just beginning...\n\nSarah has just witnessed the execution of the man who confessed to killing her husband and son, among others. She leaves with no closure as the killer has refused her repeated requests to reveal the site of her family's graves. Sarah returns home to her small town of Hopewell in the Adirondacks Mountains and vows to search until she finds Sam and Josh.\n\nHer hunt leads her to a trail of lies and unearths a new killer. In a race to save everything she holds dear, Sarah is forced to place her faith in the man who betrayed her...","torrent":{"xt":"urn:btih:06b16e912932ba72e39a5e1dc8128f1a8faf6505","amp;dn":"Blind+Faith+-+CJ+Lyons+%28epub%2C+mobi%2C+opf%2C+pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06b16e912932ba72e39a5e1dc8128f1a8faf6505","infoHashBuffer":{"type":"Buffer","data":[6,177,110,145,41,50,186,114,227,154,94,29,200,18,143,26,143,175,101,5]},"announce":[],"urlList":[]}}