{"title":"Adobe Dreamweaver CS5: Webseiten programmieren und ..","uid":6531381,"size":27333231,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07ad00d6f5fab6e95e7245a7b8eb8ac133983ff3&amp;dn=Adobe+Dreamweaver+CS5%3A+Webseiten+programmieren+und+..&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_F1_","files":-1,"time":1310366292,"description":"Richard Beer, Susann Gailus, &quot;Adobe Dreamweaver CS5: Webseiten programmieren und gestalten mit (X)HTML, Ajax, CSS, PHP und MySQL&quot; \n G.lileo D.sign | 2010 | ISBN: 3836215675 | 731 pages | PDF | 26 MB \n\n Die Welt der professionellen WYSIWYG-Webeditoren ist klein geworden und der ehemalige Makromedia-Editor Dreamweaver ist relativ allein auf der WWW-Autobahn - seit Adobe die Website-Werkstatt aufgekauft hat, ist Dreamweaver ein komplexer Teil der CS-Meute; mit Adobe Dreamweaver CS5: Webseiten programmieren und gestalten mit (X)HTML, Ajax, CSS, PHP und MySQL packen Richard Beer und Susann Gailus von firstART das vielfÃƒÂ¤ltige Einsatzspektrum des Editors umfassend in ein Handbuch, das sowohl den Einstieg in die Arbeit als auch das tÃƒÂ¤gliche Nachschlagen bei Fragen und Problemen ermÃƒÂ¶glicht. \n\n In ihrem Handbuch tragen die beiden Autoren der aktuellen Entwicklung im Web Rechnung: AJAX und CSS stehen im Vordergrund; praktische und erklÃƒÂ¤rende Teile sind deutlich voneinander getrennt, wohingegen die Verzahnung zur buchunterstÃƒÂ¼tzenden Website sehr eng ist. Auch die auf der beiliegenden DVD enthaltenen Videolektionen unterstÃƒÂ¼tzen die Kapitel direkt. Beer und Gailus gehen den ganzen Weg von den Programmgrundlagen der Bedienung und Optionen/Einstellungen bis hin zu dynamischen Webseiten und die Zusammenarbeit mit anderen Tools von Datenbanken bis Flash. Die praktische Umsetzung wird durch die Arbeit an einem realistischen Website-Projekt unterstÃƒÂ¼tzt, angefangen von statischen Webseiten bis hin zur dynamischen Datenbankanbindung. \n\n Das Einsatzspektrum des Adobe Dreamweaver CS5-Handbuchs ist unbegrenzt: Grafikdesigner, Projektleiter und Programmierer - je nach Zielsetzung benÃƒÂ¶tigt der Leser dann unterschiedliche Vorkenntnisse, die HTML, CSS und Javascript, PHP- und MySQL-Kenntnisse umfassen. ÃƒÅ“brigens: Angesichts der Web-RealitÃƒÂ¤t ist ein GroÃƒÅ¸teil des Buchs fÃƒÂ¼r den PC konzipiert. \n\n\n Adobe Dreamweaver CS5: Webseiten programmieren und gestalten mit (X)HTML, Ajax, CSS, PHP und MySQL ist ein treuer Wegbegleiter fÃƒÂ¼r alle Dreamweaver CS5-Fragen in Theorie und Praxis. --Wolfgang TreÃƒÅ¸/textico.de","torrent":{"xt":"urn:btih:07ad00d6f5fab6e95e7245a7b8eb8ac133983ff3","amp;dn":"Adobe+Dreamweaver+CS5%3A+Webseiten+programmieren+und+..","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07ad00d6f5fab6e95e7245a7b8eb8ac133983ff3","infoHashBuffer":{"type":"Buffer","data":[7,173,0,214,245,250,182,233,94,114,69,167,184,235,138,193,51,152,63,243]},"announce":[],"urlList":[]}}