{"title":"Stress Field of the Earth's Crust","uid":6512876,"size":4315641,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07b15fc4e7850b5b41dfcd4d047cd850a96023dc&amp;dn=Stress+Field+of+the+Earth%5C%27s+Crust&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_F1_","files":-1,"time":1309705078,"description":"Arno Zang, Ove Stephansson, &quot;Stress Field of the Earth's Crust&quot; \n Sp in ger | 2009 | ISBN: 1402084439 | 240 pages | PDF | 4.11 MB \n\n This book about rock stress is suitable for students in geosciences and engineering, who need to broaden their horizon about the Stress Field of the EarthÃ‚Â´s Crust. The book covers the topic in a way such that geoscience students will be able to grasp the Cauchy Stress Principle without fear of matrix transformations in an exercise. Students interested in math, physics and engineering will learn to cement a strain gauge on a rock specimen, measure residual strains by multiple overcoring and evaluate the results. Leading edge technology in determining stress (Kaiser Effect) is presented together with classical methods (Hydraulic Fracturing). In addition, borehole techniques (Breakouts) and drillcore techniques (Anelastic Strain Recovery) are illustrated. With respect to stress data, we choose locations of global interest where integrated stress determination strategies have been applied. Each case study presented has special application, like the scientific ultra-deep drilling project (KTB, Germany), drilling of seismic active fault zones (SAFOD, USA) and excavation for nuclear waste disposal (Forsmark, Sweden). Stress compilations viewed by the World Stress Map project are presented and interpreted in terms of plate tectonics. The purpose of this book is twofold. First, to report on the current field of knowledge in rock stress to students at an introduction level and second, to inform readers about stress measurements in underground excavations of public interest and about global rock stress in plate tectonic settings.\n\n\n This textbook consists of three main chapters accompanied by a DVD containing twelve video lectures presenting the same material in a self-instructed way. Exercises, laboratory testing and colour animations are included to emphasize the role of stress in various fields of solid earth sciences.","torrent":{"xt":"urn:btih:07b15fc4e7850b5b41dfcd4d047cd850a96023dc","amp;dn":"Stress+Field+of+the+Earth%5C%27s+Crust","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07b15fc4e7850b5b41dfcd4d047cd850a96023dc","infoHashBuffer":{"type":"Buffer","data":[7,177,95,196,231,133,11,91,65,223,205,77,4,124,216,80,169,96,35,220]},"announce":[],"urlList":[]}}