{"title":"Cowboys &amp; Alien - Joan D. Vinge","uid":6590638,"size":278390168,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:095333d03855420f7dd090415040b08ebb1343e0&amp;dn=Cowboys+%26+Alien+-+Joan+D.+Vinge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"captainelliotspencer","files":12,"time":1312809244,"description":"A stranger with no memory of his past stumbles into the hardscrabble desert town of Absolution. The only hint to his history is a mysterious shackle that encircles one wrist. What he discovers is that the people of Absolution don't welcome strangers, and nobody makes a move on its streets unless ordered to do so by the iron-fisted Colonel Dolarhyde. It's a town that lives in fear.\n\nButt Absolution is about to experience fear it can scarcely comprehend as the desolate city is attacked by marauders from the sky. Screaming down with breathtaking velocity and blinding lights to abduct the helpless one by one, these mysterious visitors challenge everything the residents have ever known.\n\nNow, the stranger they rejected is their only hope for salvation. As this gunslinger slowly starts to remember who he is and what he's experienced, he realizes he holds a secret that could give the town a fighting chance against the alien force. With the help of the elusive traveler Ella, he pulls together a posse comprised of former opponents - townsfolk, Dolarhyde and his boys, outlaws and Chiricahua Apache warriors - all in danger of annihilation. Unlikely allies united against a common enemy, they will prepare for an epic showdown for survival. \n\nUnabridged.\nRead by Fred Berman\n\n------------------------------------------\nVisit us for loads more:\n\nwww.audiobookvault.ws\n------------------------------------------","torrent":{"xt":"urn:btih:095333d03855420f7dd090415040b08ebb1343e0","amp;dn":"Cowboys+%26+Alien+-+Joan+D.+Vinge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"095333d03855420f7dd090415040b08ebb1343e0","infoHashBuffer":{"type":"Buffer","data":[9,83,51,208,56,85,66,15,125,208,144,65,80,64,176,142,187,19,67,224]},"announce":[],"urlList":[]}}