{"title":"Arista: 25 Years Of Number 1 Hits.DVDRip.XviD","uid":6596129,"size":749050526,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:09e2b3845306911507b71bff23f8647b521b5c75&amp;dn=Arista%3A+25+Years+Of+Number+1+Hits.DVDRip.XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"giljan","files":2,"time":1313022168,"description":"\nBrowse giljan &lt;a href=&quot;\nhttp://thepiratebay.se/user/giljan&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/giljan&lt;/a&gt;\n\n\n\n\nArista: 25 Years Of Number 1 Hits.DVDRip.XviD\n\n\nArista's greatest recording artists of the last 25 years gather for this May 15th concert in honor of the record label's 25th anniversary. The highly significant place that Arista Records holds in rock history is highlighted here by the high quality of the music performances and the excitement of the celebrities who introduce each segment. Packed with celebrity guests and classic music, this is a once-in-a-lifetime concert. Release Notes: DVD Features: Notes: Features performances not aired on television. Region 1 Keep Case Full Frame - 1.33 Audio: Dolby Digital 5.1 - English Additional Release Material: Bonus Feature/Short - Performances not seen on the television broadcast Behind-the-scenes footage Prduction Interviews - Stars Chapters: 1. Santana - Maria Maria, Smooth 2. Barry Manilow - Medley: Mandy/Can't Smile Without You/Copacabana/Even Now/Ready To Take A Chance Again/It's A Miracle/Daybreak/This One's For You/I Write The Songs 3. Annie Lennox - Why 4. Brooks And Dunn - My Maria (With Lee Roy Parnell) 5. Alan Jackson - Chattahooche 6. Aretha Franklin - Medley: I Knew You Were Waiting (For Me)/It Hurts Like Hell/Freeway Of Love (With Boyz II Men) 7. Sarah McLachlan - Angel 8. Puff Daddy - Mo' Money Mo' Problems, I'll Be Missing You (With Faith Evans &amp; 112) 9. Arista Hitmakers 2000 featuring: Westlife (&quot;Swear It Again&quot;), LFO (&quot;Summer Girls&quot;), Next (&quot;Too Close&quot;), Monica (&quot;For You I Will&quot;), Deborah Cox (&quot;Nobody's Supposed To Be Here&quot; Slow to Fast Version) 10. Toni Braxton - Un-Break My Heart (With David Foster) 11. Patti Smith - Because This Night (With Sarah McLachlan) 12. Whitney Houston - Medley: I Wanna Dance With Somebody (Who Loves Me)/How Will I Know/I Believe In You And Me/I Will Always Love You/My Love Is Your Love (With Monica, Deborah Cox, Angie Stone, Faith Evens, and Bobby Brown) 13. Kenny G - Songbird/Tribute To Clive Evans 14. Finale: Dionne Warwick, Natalie Cole, Melissa Etheridge, Carole King, Barry Manilow, Kenny G, Deborah Cox, Monica, Next, Westlife, David Foster - That's What Friends Are For \n","torrent":{"xt":"urn:btih:09e2b3845306911507b71bff23f8647b521b5c75","amp;dn":"Arista%3A+25+Years+Of+Number+1+Hits.DVDRip.XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09e2b3845306911507b71bff23f8647b521b5c75","infoHashBuffer":{"type":"Buffer","data":[9,226,179,132,83,6,145,21,7,183,27,255,35,248,100,123,82,27,92,117]},"announce":[],"urlList":[]}}