{"title":"Tom Clancy's Rainbow Six Lockdown (DVD5) [NTSC], PS2","uid":6526422,"size":3191053951,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:0a332e81e35629ecbce118bea7811d078678078f&amp;dn=Tom+Clancy%5C%27s+Rainbow+Six+Lockdown+%28DVD5%29+%5BNTSC%5D%2C+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Big_dude","files":-1,"time":1310176046,"description":"Rainbow Six Lockdown for the Ps2                                    Rel. 09/06/2005\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         ISO\nGenre.:        FPS, Action\nRating:        M (Mature)\nConversion:    DVD9 To DVD5\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method.\n\n\nCompressed with 7Zip, Game was tested and works.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\nRelease Notes - DNAS was patched, also includes an emulator + fmcb/esr if you\n                need it.\n\n\n\nGame Description:\n\nLockdown is the third Rainbow Six game to appear on the consoles, this time with Red Storm Entertainment fully behind the wheel. Once again, you play as Domingo 'Ding' Chavez, leading a small commando team on black-ops missions. This time, however, the developer strays from the realistic squad-based action in favor of more arcadish gameplay. The main single player campaign is based around a dangerous virus and hostages. In certain missions, you play as sniper Dieter Weber, picking off terrorists from higher ground and providing cover while the team infiltrates the building.\n\nThe differences between the console versions are the number of missions and the availability of certain gadgets. There is an offline two-player, split-screen cooperative mode available (up to 4 over Xbox live) and full online multiplayer up to 16 players featuring traditional deathmatch, objective-based games and CTF modes, on Xbox and PS2. While the PS2 version includes a Rivalry mode, Xbox online multiplayer has an RPG element: the P.E.C. mode (Persistent Elite Creation). Before playing, you choose an avatar and a class with specific abilities (commando, engineer, spec op and medic). While playing, you earn credits and experience, which can be traded in for new weapons, items or amour. Gear regularly needs to be repaired, shown by the durability level, and experience can be used to assign skills points to abilities, individualizing your character.\n\n\nFeatures:\n\n* Stunning graphics and ultra-realistic &quot;ragdoll&quot; physics deliver staggering\n  realism and spectacular close quarter firefights.\n\n* Superior multiplayer experience: One of the best multiplayer games ever returns\n  with the classics: Adversarial &amp; Cooperative modes through Split-Screen &amp; on-\n  line. Additional exclusive modes will make their appearance with: PlayStationÃ‚Â®2 -\n  New Rivalry Mode pits Rainbow operatives against trained mercenaries in \n  objective-driven, team-based adversarial gameplay.\n\n* Increasingly intelligent enemy A.I.\n\n* New weapons and equipment.\n\n* Tension-building sound effects.\n\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:0a332e81e35629ecbce118bea7811d078678078f","amp;dn":"Tom+Clancy%5C%27s+Rainbow+Six+Lockdown+%28DVD5%29+%5BNTSC%5D%2C+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a332e81e35629ecbce118bea7811d078678078f","infoHashBuffer":{"type":"Buffer","data":[10,51,46,129,227,86,41,236,188,225,24,190,167,129,29,7,134,120,7,143]},"announce":[],"urlList":[]}}