{"title":"HISTORY OF POP AND ROCK MUSIC - part 316","uid":6659007,"size":1259512488,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0a40e8d03650ebbed9fccb0c687d8962381f9ce1&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+316&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1315438313,"description":"  \n\n                 PART  316\n\n\n\n        JIMI HENDRIX  -  Sunshine of Your Love (1969)   \n        TEN YEARS AFTER  -  Good Morning Little School Girl  (1969)\n        TEN YEARS AFTER  -  I`m Going Home  (1969)  Woodstock\n        CANNED  HEAT  -  Leaving This Town  (1969) Woodstock\n        JOHNNY WINTER  -  Mean Town Blues (1969)  Woodstock\n        MOUNTAIN  -  Southbound Train  (1969)  Woodstock\n        JOHNNY WINTER  -  Mean Town Blues (1970)\n        JOHNNY WINTER  -  Rock and Roll Hootchie Koo  (1973)\n        TEN YEARS AFTER  -  Love Like a Man (1983)\n        TEN YEARS AFTER  - Good Morning Little School Girl  (1983)\n\n\n\n\n        &quot;Sunshine of Your Love&quot; is a 1967 song by the British supergroup Cream. The song was originally released on the album &quot;Disraeli Gears&quot; in November 1967,and was later released as a single in January 1968. It is Cream's only gold-selling single in the United States. It features a distinctive electric/bass guitar riff and an acclaimed guitar solo from Eric Clapton.The song was written by Jack Bruce, Pete Brown and Clapton.In 2004, the song was ranked at #65 on Rolling Stone magazine's list of The 500 Greatest Songs of All Time. In March 2005, Q magazine placed &quot;Sunshine of Your Love&quot; at #19 on its list of the 100 Greatest Guitar Tracks. In 2009 it was named the 44th best hard rock song of all time by VH1. The song is also a part of the Rock and Roll Hall of Fame's 500 Songs That Shaped Rock and Roll list.\n      Jimi Hendrix performed &quot;Sunshine of Your Love&quot; as a setlist staple throughout his 1968 and 1969 concerts, employing wailing guitar riffs in place of the lyrics and ending the song by dramatically slowing the tempo to a grinding halt, as well as including leitmotifs from other Cream songs such as &quot;Outside Woman Blues&quot;. Recordings of the song can be found on Experience Vol. 1, The Last Experience Concert: Live at the Royal Albert Hall as well as the 2010 release Valleys of Neptune in their entirety (slightly less than seven minutes) and in a truncated version on BBC Sessions. During a January 1969 appearance on the &quot;Happening for Lulu&quot; television show, Hendrix halted his band near the end of the set and broke into &quot;Sunshine of Your Love&quot;, running the show past its scheduled end time.\n       &quot;Good Morning, School Girl&quot; or &quot;Good Morning Little Schoolgirl&quot; is a blues standard that has been &quot;covered countless times across the decades&quot;. First recorded by John Lee &quot;Sonny Boy&quot; Williamson in 1937, later it was a R&amp;B chart success for Smokey Hogg. In 1950, the song reached #5 in the Billboard R&amp;B chart. In the late 1950s and early 1960s, several versions of &quot;Good Morning Little Schoolgirl&quot; were recorded as acoustic country-style blues, including versions by John Lee Hooker, Lightnin' Hopkins, Mississippi Fred McDowell, Muddy Waters and Doctor Ross. In 1965, Junior Wells with Buddy Guy recorded it as a Chicago blues, with a distinctive guitar and bass line, for their influential Hoodoo Man Blues album.  &quot;Good Morning, School Girl&quot; was covered by Ten Years After on their album  &quot;Ssssh&quot;, released in 1969. The album charted #20 at Billboard 200 and #4 at the UK charts.Many blues and other artists have recorded Sonny Boy Williamson's &quot;Good Morning Little Schoolgirl&quot;, including: Rod Stewart, Chuck Berry, \nGrateful Dead, Johnny Winter, Paul Rodgers with Jeff Beck, Van Morrison and Widespread Panic.\n      &quot;I`m Going Home&quot; is a song by Ten Years After from their &quot;Undead&quot; album. It was the second album by Ten Years After, recorded live at the small jazz club, Klooks Kleek, in London, May 1968. This album set out to give listeners a real feel to what it was like to hear Ten Years After. Their eponymous first album was bluesy, but less emotional and passionate, and so the band decided to record the album live. The result was a combination of blues, boogie and jazz playing that merged more traditional rock and roll with 1950's-style jump blues. This album became the introduction that many aspiring musicians used as a learning tool to explore beyond rock and pop boundaries and into more improvised stylings.\n     &quot;Love Like a Man&quot; is a popular song and hit single by Ten Years After first released in 1970 and taken from their album &quot;Cricklewood Green&quot; .Written by the group's lead vocalist Alvin Lee and produced by the group, it was the band's fourth single. The song entered the UK charts at #48 in June 1970 and reached #10 in August finally leaving the chart in October 1970.\n\n\nFrom Wikipedia, the free encyclopedia","torrent":{"xt":"urn:btih:0a40e8d03650ebbed9fccb0c687d8962381f9ce1","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+316","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a40e8d03650ebbed9fccb0c687d8962381f9ce1","infoHashBuffer":{"type":"Buffer","data":[10,64,232,208,54,80,235,190,217,252,203,12,104,125,137,98,56,31,156,225]},"announce":[],"urlList":[]}}