{"title":"Jewel - 0304","uid":6623427,"size":547914019,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0be36143cae0c17b0158e682e85f253aef394543&amp;dn=Jewel+-+0304&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cdda-flac","files":-1,"time":1314089136,"description":"\n &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/1d/ce/0093225b9da0f7591abd7110.L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/1d/ce/0093225b9da0f7591abd7110.L.jpg&lt;/a&gt;\n\n\nTitle: 0304\nArtist: Jewel\nAudio CD (June 3, 2003) \nNumber of Discs: 1\nGenre: Pop\nFormat: Free Lossless Audio Codec\n\nIncludes Music video: Jewel - Intuition.mpg\n\n\nTrack Listing:\n\n01. Stand\n02. Run 2 U\n03. Intuition\n04. Leave The Lights On\n05. 2 Find U\n06. Fragile Heart\n07. Doin' Fine\n08. 2 Become 1\n09. Haunted\n10. Sweet Temptation\n11. Yes U Can\n12. U &amp; Me = Love\n13. America\n14. Becoming\n15. Intuition (Ford's Radio Mix)\n\n\nAmazon Review:\nWhy pick on a girl for taking a chance? After experiencing flagging sales, Jewel has become proactive and given herself a cosmetic and artistic makeover. But 0304 isn't the winsome thrush's first leap into the unknown. Hiring Shakira producer Lester A. Mendez to give her solemn, folksy songs a pop sheen and some dance beats isn't as radical as starring as a Civil War widow in an Ang Lee film. Besides it's a lot more interesting to hear her squeeze her chaste, malleable soprano around an accordion solo in the futuristic namedropping fable &quot;Intuition&quot; or her voice a beat-driven condemnation of the George W. Bush regime on &quot;America&quot; to see her sashaying on the silver screen in those tight bodices and hoop skirts. Although she has changed the very structure and sound of her songs, Jewel's undeniable talent shines through. She still has a way with words and her voice is remains as pure as an Alaskan stream.\n\nAllmusic Review:\nWithin the liner notes to her fourth album, 0304, Jewel includes a note to her fans, explaining, &quot;This album may seem different to you,&quot; which is putting it mildly. For a singer who has been making low-key singer/songwriter albums so unassuming that on her debut the two singles had to be re-recorded for mass consumption, it is a big shock to put on 0304 and hear that she has abandoned folkiness and adult pop to make her dance-pop album, of all things. A move that's even more shocking when you consider that when this was released in June of 2003, the teen-driven dance-pop boom of the late '90s/early 2000s was over, so it doesn't necessarily even sound like part of the mainstream of the time, suggesting that this isn't a calculated effort to ride the latest hip trends. No, the music on 0304 is the wild, weird result of Jewel's desire to create a &quot;modern interpretation of big band music. A record that (is) lyric-driven, like Cole Porter stuff, that also has a lot of swing...that combined dance, urban, and folk music.&quot; While the big band and Cole Porter allusions are a stretch -- although it is true that this is as lyric-driven as her previous three records -- with the assistance of producer Lester Mendez, she has managed to blend dance, urban, and folk -- complete with pop overtones, of course -- in previously unimaginable ways. Like Sheryl Crow's eponymous second album, this picks up familiar strands of contemporary pop music and familiar themes in Jewel's own work, but the way they're assembled is disarmingly idiosyncratic -- it has a polished, commercial sheen, but the songs take weird twists and turns in their arrangements, structure, and lyrics (another thing this shares with Sheryl Crow is a predilection for odd pop-culture references and name-dropping). More than anything, it's the weird juxtapositions in the production -- the accordions and dance beats on &quot;Intuition&quot;; the way her protest tune, &quot;America,&quot; ends in an electro-crash; the muted jazz trumpets on her Nelly Furtado-styled &quot;Leave the Lights On,&quot; to name just a few -- that make this an original-sounding album, something with more imagination than the average dance-pop record. Better still, it sounds more authentic (and boasts a better set of songs) than her previous records, which were either too ramshackle or too self-serious and doggedly somber to really reveal much character. Here, even if it's under the veneer of commercial pop, she puts herself out on the line more than she ever has, and she's come up with her best record, with her best set of songs and best music yet. As she notes in her message to fans, &quot;It's the first record I enjoy listening to. It's fun!&quot; She's completely right on that note -- against all, it's the first album of hers that's a sheer pleasure to hear.","torrent":{"xt":"urn:btih:0be36143cae0c17b0158e682e85f253aef394543","amp;dn":"Jewel+-+0304","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0be36143cae0c17b0158e682e85f253aef394543","infoHashBuffer":{"type":"Buffer","data":[11,227,97,67,202,224,193,123,1,88,230,130,232,95,37,58,239,57,69,67]},"announce":[],"urlList":[]}}