{"title":"Democracy Now - 25 jul 2011","uid":6564387,"size":458069014,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0d8822d6de6d39312b29b42b73b74ac66f51dbb5&amp;dn=Democracy+Now+-+25+jul+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1311613798,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jul 25, 2011\n\n- Norway: Right-Wing Extremist Kills 93 People In Duel Attacks\n- Norway Killer's Manifesto Rails Against &quot;Islamization&quot; of Europe\n- News Outlets Initially Blamed Norway Attacks on Muslim Militants\n- New York State Begins Historic Marriage Of Gay &amp; Lesbian Couples\n- Somali Militants Placing Millions in Danger of Starvation: U.N. World Food Program\n- Lawmakers Prepare Federal Debt Backup Plans As Negotiations Fail\n- Accuser Speaks Out in IMF Sex Assault Case\n- News Corp Executive Accused of Lying in British Parliamentary Hearing\n- Libya Rebel Leader: Gaddafi and Family May Be Allowed to Stay in Country\n- Iran Renews Accusations of U.S., Israeli Plot Following Scientist Assassination\n- U.S. Refuses Mexican Flight Due to Activist Passenger\n- British Soul Singer Amy Winehouse Dies at 27\n\n\nSpecial reports\n\n- Hundreds of Same-Sex Couples Marry in New York, From Niagara Falls to Manhattan\n\nHundreds of gay couples got married across New York state Sunday after it became the sixth and most populous state in the United States to recognize same-sex marriages. New York joins Connecticut, Iowa, Massachusetts, New Hampshire, Vermont and the District of Columbia in allowing same-sex unions. But gay marriage is still specifically banned in 39 states. On Sunday, Kitty Lambert, 54, and Cheryle Rudd, 53, were married with Niagara Falls in the backdrop, a traditional honeymoon capital. Both grandmothers, the women celebrated their marriage surrounded by family and friends. Democracy Now!'s Elizabeth Press was there to cover what they described as the first same-sex marriage in New York, as their marriage ceremony began one second after midnight. &quot;We can educate people into understanding that we're your neighbors, we're your coworkers, your friends, we're your family members; and all we're asking for is the right to protect ourselves, the right to have the same protections under law that our neighbors do, that our coworkers do, that our friends and family do. This is about equal access to equal protection under the law,&quot; Lambert said.\n\n\n- Pioneering Comedian Roseanne Barr on Her Life on Screen as a &quot;Working-Class Domestic Goddess&quot;\n\nIn the late 1980s and early 1990s, the Emmy Award-winning actress Roseanne Barr starred in the popular and groundbreaking show on television titled simply &quot;Roseanne,&quot; the first TV series to openly advocate for gay rights. &quot;Roseanne&quot; featured one of the first lesbian kisses on TV, in an episode when Roseanne kisses Mariel Hemingway. &quot;Roseanne&quot; was also the first sitcom to ever feature a gay marriage. The series tackled other controversial topics, as well: poverty, class, abortion and feminism. From her open support of unions in earlier shows to her tribute to Native Americans toward the end of the series, Roseanne never shied away from contentious issues. The writer Barbara Ehrenreich once praised Roseanne Barr for representing &quot;the hopeless underclass of the female sex: polyester-clad, overweight occupants of the slow track; fast-food waitresses, factory workers, housewives, members of the invisible pink-collar army; the despised, the jilted, the underpaid.&quot; We play excerpts from the groundbreaking sitcom and speak with Barr about her childhood in Utah, where she was raised half-Jewish and half-Mormon, and talk about how she &quot;made it OK for women to talk about their actual lives on television.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:0d8822d6de6d39312b29b42b73b74ac66f51dbb5","amp;dn":"Democracy+Now+-+25+jul+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d8822d6de6d39312b29b42b73b74ac66f51dbb5","infoHashBuffer":{"type":"Buffer","data":[13,136,34,214,222,109,57,49,43,41,180,43,115,183,74,198,111,81,219,181]},"announce":[],"urlList":[]}}