{"title":"HISTORY OF POP AND ROCK MUSIC - part 005","uid":6504985,"size":375441492,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0dcd734e2dcdef1b2503413f0ea1c6e47a14507a&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"zlatkopupovac","files":-1,"time":1309395740,"description":"         \n                              PART  05 \n \n                             ( re-upload )\n\n\n                       NEIL YOUNG - HEART OF GOLD (1972)\n                       JOHN LENNON - JEALOUS GAY (1972)\n                       CAT STEVENS - LADY D'ARBANVILLE (1972) \n                       CAT STEVENS &amp; ALUN DAVIES -  LADY D'ARBANVILLE (1972) \n\n\n            &quot;Heart of Gold&quot; from the 1972 album Harvest is Neil Young's only number one hit single in his long musical career.The song is one of a series of soft, acoustic pieces which were written partly as a result of a back injury. Unable to stand for long periods of time, he could not play his electric guitar and so returned to his original folk genre, which he could play sitting down.The song continues to be among the most requested and performed in concert.\n                 &quot;Jealous Guy&quot; is a song written and performed by John Lennon.It is one of the most commonly covered Lennon songs, with at least ninety-two recorded cover versions by musicians like the Black Crowes, Jeff Tweedy, Peter Criss (of KISS), and Cueshe. The most notable of the non-Lennon recordings were by Roxy Music and the Faces. John had jealousy problems with his first wife, Cynthia Powell, and when he left her for Yoko, the jealousy continued. Yoko commented, &quot;(The song) said it all! ... After we got together he made me write out a list of all the men I'd slept with before we met. I started to do it quite casually  then I realised how serious it was to John. He didn't even like me speaking Japanese because that was a part of my mind that shut him out.&quot;\n                 Cat Stevens was one of the most successful singer/songwriters of the first half of the '70s, and several of his soft, romantic, and sometimes mystical singles were Top 10 hits. His most notable songs include &quot;Morning Has Broken&quot;, &quot;Peace Train&quot;, &quot;Moonshadow&quot;, &quot;Wild World&quot;, &quot;Father and Son&quot;, &quot;Matthew and Son&quot;, &quot;The First Cut Is the Deepest&quot;, and &quot;Oh Very Young. After eight gold albums in a row, his star began to fade, and in the late '70s, following a near-drowning, he converted to Islam, changed his name to Yusef Islam, and dropped out of music. ","torrent":{"xt":"urn:btih:0dcd734e2dcdef1b2503413f0ea1c6e47a14507a","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dcd734e2dcdef1b2503413f0ea1c6e47a14507a","infoHashBuffer":{"type":"Buffer","data":[13,205,115,78,45,205,239,27,37,3,65,63,14,161,198,228,122,20,80,122]},"announce":[],"urlList":[]}}