{"title":"Democracy Now - 09 dec 2011","uid":6876680,"size":454010485,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0e8f3bed2187de2b92c8a1b61298f5a014685cfb&amp;dn=Democracy+Now+-+09+dec+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1323496257,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 09, 2011\n\n- Final Day of Climate Summit Brings Talk of 2020 Deal\n- Occupy Boston Remains After Midnight Deadline\n- 1,000 Protest Corporate Influence in D.C.\n- Iran Files Complaint Over U.S. Drone\n- E.U. Treaty Change Falters Over British Opposition\n- Putin Accuses U.S. of Inciting Protests\n- EPA Ties Natural Gas Fracking to Water Pollution\n- Holder: Drug War Gun Sting Operation &quot;Inexcusable&quot;\n- Senate Republicans Block Nominee for Consumer Protection Agency\n- Corzine Apologizes for MF Global Collapse\n- L.A. City Council Backs Constitutional Amendment Against Corporate Personhood\n\n\nSpecial reports\n\n- U.S. Publicly Shifts Climate Stance in Face of Widespread Criticism - Then Quietly Backtracks\n\nTalks at the U.N. Climate Change Conference in Durban have entered their last official day, with focus now on a European Union-sponsored road map calling for a new climate treaty to be negotiated by 2015. The treaty would impose binding cuts on the world's biggest emitters of the heat-trapping gases, but would not likely go into effect until 2020. After being publicly heckled by a U.S. college student on Thursday and facing widespread accusations of obstructing the Durban talks, U.S. climate envoy Todd Stern said the Obama administration supports the E.U. road map. The U.S. State Department later backtracked on Stern's comments by taking the unusual step of issuing a clarification to its position, saying it does not yet support a legally binding deal to cut emissions. When Amy Goodman then tried to question Stern and fellow lead U.S. negotiator Jonathan Pershing about the apparent retraction, they refused to answer.\n\n\n- &quot;Get It Done&quot;: Urging Climate Justice, Youth Delegate Anjali Appadurai Mic Checks U.N. Summit\n\nA number of protests are being held today at the United Nations Climate Change Conference in Durban to protest the failure of world leaders to agree to immediately agree to a deal of binding emissions cuts. Anjali Appadurai, a student at the College of the Atlantic in Maine, addressed the conference on behalf of youth delegates. Just after her speech, she led a mic check from the stage - a move inspired by the Occupy Wall Street protests. &quot;It always seems impossible until it's done,&quot; Appadurai said. &quot;So, distinguished delegates and governments around the world, governments of the developed world: Deep [emissions] cuts now. Get it done.&quot;\n\n\n- Obama Admin Denounced for &quot;Startling Level of Obstructionism and Defeatism&quot; on U.N. Climate Deal\n\nFor analysis on where the U.N. climate change talks stand we are joined by two guests who have been closely tracking the role of the U.S. negotiating team over the past two weeks. Kate Horner is a policy analyst at Friends of the Earth and Michael Dorsey is an assistant professor of environmental studies at Dartmouth College. &quot;In those briefings we've seen a startling lack of vision, a startling level of obstructionism, of defeatism,&quot; Dorsey says. &quot;And I think one way we could summarize these meetings is that State Department diplomacy is about delay... What we've seen the U.S. try to force the world to do here, is to sort of throw out the baby that's called Kyoto - which is an agreement that's legally binding - and get the world to drink the dirty water, the bath water that's left behind.&quot;\n\n\n- Developing Countries Call for Green Climate Fund Independent of Western Control\n\nMartin Khor is the executive director of the South Centre, a research center of 51 developing countries. At the United Nations Climate Change Conference in Durban, we caught up with Khor to discuss the negotiations over a new Green Climate Fund to help the developing world tackle climate change, the U.S. role in the summit, and why the U.S.-led focus on China's emissions obscures the reality that the U.S. emits far more greenhouse gas per capita.\n\n\n- Lauding &quot;Collapse of Global Warming Movement,&quot; Sen. Inhofe Tells U.N. Summit &quot;You Are Being Ignored&quot;\n\nWhile no members of the U.S. Congress attended the United Nations Climate Change Conference in Durban Republican Senator James Inhofe of Oklahoma recorded a video message that was aired at a press conference of climate change deniers here at the summit on Wednesday. &quot;Tossing out any remote possibility of a U.N. global warming treaty is one of the most important things we can do for the economy,&quot; Sen. Inhofe said. &quot;I am making this announcement from Washington D.C., where I am confident the only person left talking about global warming is me. The message from the Washington to the U.N. delegates in South Africa is this, we could not be any clearer: You are being ignored.&quot;\n\n\n- Frustrated By Inaction, Youth Delegates Occupy COP 17 Plenary in Durban\n\nAs the afternoon round of talks were scheduled to begin at the U.N. Climate Change Conference, delegates from some of the world's most vulnerable countries joined Kumi Naidoo, executive director of Greenpeace International, and more than 150 youth climate activists in occupying the main plenary. They continued to march throughout the conference center during our live broadcast. As security officers closed in on the protest, the Maldives Environment Minister, Mohamed Aslam, addressed the crowd.\n\n\n- Exclusive: Ex-Greek PM George Papandreou on Greece's Fiscal Crisis and Why He Backs Occupy Movement\n\nIn an exclusive interview, we speak with former Greek Prime Minister George Papandreou, who is attending the U.N. climate change summit in Durban, South Africa. Papandreou was forced to resign last month when he suggested holding a national referendum to allow the Greek people to have a say in whether they would accept the European Union's bailout plan which would necessitate severe austerity cuts. We speak to Papandreou about the financial crisis, the role of banks and the importance of the growing Occupy Wall Street movement. &quot;The Occupy Wall Street movements ... are saying something very, very specific. That inequality in the end is an inequality of power. And we need to redistribute power, not just money. Power -- and this is I think the Democratic challenge that we have today,&quot; Papandreou says.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:0e8f3bed2187de2b92c8a1b61298f5a014685cfb","amp;dn":"Democracy+Now+-+09+dec+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e8f3bed2187de2b92c8a1b61298f5a014685cfb","infoHashBuffer":{"type":"Buffer","data":[14,143,59,237,33,135,222,43,146,200,161,182,18,152,245,160,20,104,92,251]},"announce":[],"urlList":[]}}