{"title":"ePSXe (Playstation 1 emulator)1.7.0","uid":6571441,"size":16840314,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0ffc59e031e6fd892eeb42d8afbe02e19da0421f&amp;dn=ePSXe+%28Playstation+1+emulator%291.7.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tim2251337x","files":40,"time":1311992992,"description":"ePSXe (enhanced PSX emulator) is a PlayStation emulator for x86-based PC hardware with Microsoft Windows or Linux. It was written by three authors, using the aliases &quot;Calb&quot;, &quot;_Demo_&quot;, and &quot;Galtor&quot;. ePSXe is closed source with the exception of the application programming interface (API) for its plug-ins.\nAs with many modern emulators, ePSXe makes use of plug-ins to emulate GPU, SPU (sound), and CD-ROM drive functions, a model first established in PSEmu Pro. Games can be loaded from the computer's CD drive or from one of many types of CD images directly from the user's hard drive.\n\nA patching feature allows the user to apply game patches. Games that do not necessarily run properly, or even start at all, can be fixed and played via the use of ePSXe patch files in .ppf format. Not all games prone to bugs have ppf patches written for them.\n\nUnlike a few alternative PlayStation emulators that are able to use high level emulation to mimic the effect of the PlayStation's BIOS, ePSXe functions with an image of an official Sony PlayStation BIOS. Since the various PlayStation BIOS images are Sony's intellectual property, it is illegal to distribute them. For this reason, ePSXe does not come bundled with any of the PlayStation BIOS images, requiring the user to provide one for the emulator.\n System requirements\n\nePSXe's stated system requirements are:\n\n    Processor: Pentium 200 MHz, recommended Pentium 3 at 1 GHz\n    RAM: 256 MB RAM, recommended 512 MB RAM\n    Video card: 3D capable video card with support for OpenGL, DirectX, or Glide\n    Operating system: Windows or Linux\n    CD-ROM: 16x or faster (optional)\n\n Plug-ins\n\n    GPU: Most GPU plug-ins run with either Direct3D, OpenGL, or the Glide API, and are available as freeware or open source\n    SPU: The SPU plug-ins can emulate everything from music to sound effects, with varying degrees of success depending on the plug-in settings, and of course the plug-in being used\n    CD-ROM: ePSXe comes with a core CD-ROM plug-in, but many others are available for freeware download and many can emulate up to seven different types of read modes\n    Input: The core plug-in is sufficient, but there are others that allow for more functionality.\n\nCompatibility\n\nThe current version of ePSXe, 1.7.0, is able to run most Playstation games accurately, however, few games run flawlessly without extensive configuration and trial by error testing. In the case that a game does not run successfully, patches written for the game in question can be used, though few games have patches available.\n\nQuite often, users would download ePSXe 1.5.2 to avoid using ePSXe 1.6.0. This was due to version 1.6.0 having numerous complications that led users to use the last properly functional release. 1.7.0 repaired most of the issues present in 1.6.0.","torrent":{"xt":"urn:btih:0ffc59e031e6fd892eeb42d8afbe02e19da0421f","amp;dn":"ePSXe+%28Playstation+1+emulator%291.7.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ffc59e031e6fd892eeb42d8afbe02e19da0421f","infoHashBuffer":{"type":"Buffer","data":[15,252,89,224,49,230,253,137,46,235,66,216,175,190,2,225,157,160,66,31]},"announce":[],"urlList":[]}}