{"title":"Supernatural S04 E01 - E11 DVDrip DutchReleaseTeam (dutch subs n","uid":6572633,"size":5458486573,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:12334ab50d3f75f9bb35c40a77199f52ee0142fd&amp;dn=Supernatural+S04+E01+-+E11+DVDrip+DutchReleaseTeam+%28dutch+subs+n&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MtotheAtiash","files":-1,"time":1312037722,"description":"USA\nGenre: Drama, Mystery, Thriller, Fantasy, Horror, Comedy\nTaal: Engels\nOndertitels: vaste Nederlandse ondertiteling\nVertaling: Bierdopje.com\nIMDb\nAflevering nummer 1 - 11\n\nSeason 4, Episode 1: Lazarus Rising\nSam tries to move on without his brother and becomes hardened and more reckless in the way he hunts. Bobby and his psychic friend Pamela try to contact the other side to find out more about Dean's ultimate fate. \n\nSeason 4, Episode 2: Are You There, God? It's Me... Dean Winchester\nThe Winchesters and Bobby Singer encounter the angry spirits of people they couldn't save. \n\nSeason 4, Episode 3: In the Beginning\nCastiel sends Dean back in time to 1973 where he encounters younger versions of his parents and for the first time meets his grandfather Samuel Campbell who holds a secret that sheds a light on the Winchester Family's connection to the hunter community. \n\nSeason 4, Episode 4: Metamorphosis\nA hunter named Travis points Sam and Dean towards a meat eating creature called a Rugaru. Complicating matters is the fact that Travis's target is a normal suburban dad in the earlier process of changing and he hasn't killed anyone yet. \n\nSeason 4, Episode 5: Monster Movie\nIt's Halloween time and the Winchesters face-off against a shapeshifter with a penchant for impersonating classic movie monsters like Dracula, the Wolfman, and the Mummy. \n\nSeason 4, Episode 6: Yellow Fever\nSam and Dean discover a Colorado small town's darkest secret as a wave of people fall prey to a &quot;ghost sickness&quot; that induces fear, paranoia, and ultimately a fatal heart attack. Sam and Bobby must figure out the cause and cure of the sickness when Dean himself falls prey to it. \n\nSeason 4, Episode 7: It's the Great Pumpkin, Sam Winchester\nInvestigating two mysterious deaths in a small town, Sam and Dean discover a witch is sacrificing people to summon a dangerous demon. \n\nSeason 4, Episode 8: Wishful Thinking\nSam and Dean investigate when a small town's wishing well actually starts to grant the people's wishes. \n\nSeason 4, Episode 9: I Know What You Did Last Summer\nSam, Dean, and Ruby discover the existence of a female prophet named Anna Milton, who can hear the voices of angels and thus figures into the plans of a demon named Alastair who wants to use her as a tool against the angels.\nSeason 4, Episode 10: Heaven and Hell\nDean and Sam figure out why Castiel and his superior/handler, Uriel the Angel of Death, want Anna Milton dead when the three of them are forced to go on the run, not only from heavenly and vengeful angels, but from Alastair and his demon minions who also try to track down Sam, Dean, and Anna. With the assistance from the now-blind soothsayer, Pamela Barnes, they discover that 'Anna' is a fallen (former) angel and needs to seek her grace wings before the forces of both Heaven and Hell find them.\n\nSeason 4, Episode 11: Family Remains\nThe Winchesters try to stop a family from moving into a haunted house.\n\nhardcoded dutch subs\n\ndeze review wordt u aangeboden door het DutchReleaseTeam\nVoor de reviews van de nieuwste films, muziek, series, games etc ga dan eens naar &lt;a href=&quot;\nhttp://www.hetmultimediacafe.be/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hetmultimediacafe.be/&lt;/a&gt;","torrent":{"xt":"urn:btih:12334ab50d3f75f9bb35c40a77199f52ee0142fd","amp;dn":"Supernatural+S04+E01+-+E11+DVDrip+DutchReleaseTeam+%28dutch+subs+n","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12334ab50d3f75f9bb35c40a77199f52ee0142fd","infoHashBuffer":{"type":"Buffer","data":[18,51,74,181,13,63,117,249,187,53,196,10,119,25,159,82,238,1,66,253]},"announce":[],"urlList":[]}}