{"title":"Groupa - Fjalar 2002","uid":6514155,"size":277780155,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1334392a43d19941d50a0460458853503880a9d2&amp;dn=Groupa+-+Fjalar+2002&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"barber9","files":-1,"time":1309762541,"description":"Groupa plays it's own brand of modern Swedish folk music. The original band was founded in 1980, and along with other groups like the now defunct Filarfolket has been a vanguard of the progressive folk music scene in Sweden since the 80's.\n\nThe music is based on a great and tender caring for Swedish Folk music, coupled with refined musical skills. With Terje Isungset from Norway as their new percussion player, Groupa continues towards new goals.\n\nIn the music of Groupa, you will find a composed picture of the Traditions of Yesterday, the whims of today, and the possibilities of tomorrow.\n\nGiving the music freer reins and new colours, they are exerting themselves in the joy of drawing new musical dimensions with instruments such as mouth harp, overtone flutes, viola d'amore, bells, stones, wood, and melodeon.\n\nEver since the start, Groupa has been a very popular live band. The band tours Sweden, Scandinavia and Europe relentlessly, and have appeared at the following festivals: Roskilde Festival - Denmark, Folk Festival in Dranouter - Belgium, Nordic Roots Festival, Minneapolis - USA, Folk Alliance, Vancouver - Canada, Pontardawe and Wadebridge - UK, Leipzig Tanzhausfest, Rudolstadt Folk Festival and folkBaltica - Germany, Violin and Village Festival in Maramures - Romania, Festival Porta in Riga - Latvia, Haapavesi Folk Festival - Finland, Falun Folk Music Festival, Stockholm Water festival, Urkult vid NÃƒÂ¤mforsen, Hultsfredstestivalen, KorrÃƒÂ¶ - Sweden and many others.\n\nGroupa has also been touring India.\n\nIn 1987 Groupa received the Volkkunstpreis F V S zu Hamburg, and in 1991 they were awarded a Grammy for their album MÃƒÂ¥nskratt. The motivation of the jury read: For pulling the old woolly feeling off folk music with a curious smile!\n\nIn 1992, the founder of the band, Mats Eden, was appointed the Composer of the Year at the Musik vid Siljan festival. He was also one of the participant of the Fiddles on Fire tours in -92 and Ã‚Â­94 in the UK, organized by Folkworks.\n\nGroupa's second Grammy was collected in 1996 for their latest CD Imeland. This time in competition with large-selling artists as Rikard Wolff and Stefan SundstrÃƒÂ¶m. (groupa.se)\n\n- - -\n\nTwo-time Swedish Grammy winner Groupa releases their seventh album, now with singer Sofia Karlsson as a permanent member joining Mats Eden, Jonas Simonsson, Rickard AstrÃƒÂ¶m and Terje Isungset to create yet another edition of what many have referred to as Sweden's 'super group of folk music. Fjalar is freer and imbued with great curiosity, exploring the most primitive Swedish sounds with an exciting, forward-looking energy that once again redefines the spirit of Nordic music. (cdroots.com)\n\n- - - \n\nGroupa are today already nearly dinosaurs of the Swedish experimental folk scene, having started back in the early 80s. Yet they have not lost any of their experimental creativity on this their seventh album. On Fjalar they offer an impressive cross over between Swedish traditional music, jazz, free style experimental and world music. The Groupa line-up has not changed since their last album Lavalek. While Mats Eden on fiddles and melodeon and Jonas Simonson on flutes and HÃƒÂ¤rjedalspipa provide the melodic instrumental element, the a bit more chaotic element is provided in particular by the innovative and crazy Norwegian percussionist Terje Isungset with his most unusual set of all sorts of percussion instruments, and Rickard AstrÃƒÂ¶m adds his piano and synthesizer. The latest addition to the Groupa line-up is the young singer Sofia Karlsson, with a singing style that crosses traditional Swedish singing and Free Jazz.\nThe album offers a rather broad range of music, ranging from beautiful quiet music and wild nergetic yet melodic songs and tunes to jazzy trad songs and simply rhythmic noise. There are several genius moments on this CD, such as parts of the first track Det brinner en eld with impressive vocal combinations. As a whole, the album is nothing for people looking for musical harmony, as it sometimes tends to go quite a lot towards noice. This is very free folk music of talented and highly improvising musicians. A special CD in its very own right. (Michael Moll)\n\n- - -\n\nDet bÃƒÂ¶rjade 1980 och sedan dess har det blivit sju skivor. DÃƒÂ¥ var Groupa en del i den nya svenska folkmusiken - banden, grupperna som fÃƒÂ¶rÃƒÂ¤ndrade och utvecklade samspelsformerna. Nu ÃƒÂ¤r det nya gammalt - det finns massor med grupper och stilar som utvecklats ur 1980-talets experimenterande. Men Groupa har under ÃƒÂ¥ren stÃƒÂ¤ndigt ÃƒÂ¶verraskat och tagit nya frÃƒÂ¤scha grepp pÃƒÂ¥ musiken. Fjalar ÃƒÂ¤r inget undantag. Skivan innehÃƒÂ¥ller flera ovÃƒÂ¤ntade och bra lÃƒÂ¥tar. En sÃƒÂ¥dan ÃƒÂ¤r klaviaturspelaren Rickard AstrÃƒÂ¶ms 1a augusti som verkar vara inspirerad av Bela Bartoks bearbetningar av musik frÃƒÂ¥n Transylvanien. En del i Groupas utveckling ÃƒÂ¤r att allt mer av materialet ÃƒÂ¤r komponerat av gruppens medlemmar och utgÃƒÂ¥ngspunkterna och inspirationen tillÃƒÂ¥ts flÃƒÂ¶da in frÃƒÂ¥n olika hÃƒÂ¥ll. Jonas Simonsons FÃƒÂ¶rspel lÃƒÂ¥ter som en arabisk- irlÃƒÂ¤ndsk shakuhachi-improvisation. Terje Isungsets Norwegian Mood blir ett slags nordisk square dance fÃƒÂ¶r mungiga. Groupa fortsÃƒÂ¤tter att tillreda nya rÃƒÂ¤tter med ingredienser frÃƒÂ¥n folkmusikens allt stÃƒÂ¶rre skafferi - det ÃƒÂ¤r bra det!\n(Dan Lundberg i SvD)\n\n- - -\n\nGroupa - Fjalar 2002\n(Vaxholm Xource)\n\n 1. Det brinner en eld. \n 2. Polska frÃƒÂ¥n BohuslÃƒÂ¤n. \n 3. Tre heliga mÃƒÂ¶. \n 4. Kom helige ande (original title: Kom helge and). \n 5. 1a augusti. \n 6. Fjalar. \n 7. Klyftileken. \n 8. Thinner. \n 9. Norwegian mood. \n10. FÃƒÂ¶rspel. \n11. Fyra flickor, Etterspel. \n12. Solen\n","torrent":{"xt":"urn:btih:1334392a43d19941d50a0460458853503880a9d2","amp;dn":"Groupa+-+Fjalar+2002","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1334392a43d19941d50a0460458853503880a9d2","infoHashBuffer":{"type":"Buffer","data":[19,52,57,42,67,209,153,65,213,10,4,96,69,136,83,80,56,128,169,210]},"announce":[],"urlList":[]}}