{"title":"BBC Imagine 2011 Iraq in Venice HDTV x264 AAC MVGroup","uid":6574549,"size":1456010458,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:14b488fefd1986530a48566b3435f623c0af7515&amp;dn=BBC+Imagine+2011+Iraq+in+Venice+HDTV+x264+AAC+MVGroup&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"BasilBrush","files":1,"time":1312134858,"description":"BBC Imagine 2011 Iraq in Venice HDTV x264 AAC MVGroup\n\nIraq and art are not words that usually go together. Yet this year, for the first time since Saddam Hussein's rise to power some 35 years ago, Iraq has a presence at the Venice Biennale - the show that is the Cannes Film Festival or the Olympics of the international art world calendar.\n\nThousands of years ago, Iraq was the cradle of civilisation - Mesopotamia, the 'land between two rivers' - the Garden of Eden. Decades of despotism, destruction and despair have stifled its art, but now, despite all the dangers and difficulties, art is re-emerging.\n\nJill Nicholls' film tells the moving stories of six Iraqi artists, all scattered around the world, and follows them as they prepare their work for Venice. The artists include Halim Al Karim, who survived for three years in a hole in the desert, escaping conscription into the Iran Iraq war; as well as Walid Siti, dreaming of the mountains of Kurdistan in his East London studio and going back to Iraq to gather images for his work. Also Ali Assaf, poetically evoking his home town of Basra back in the days when it was called the Venice of the East; and Ahmed Al Soudani, whose visceral paintings of violence and chaos sell for six-figure sums.\n\nThe theme of this Iraqi show is not war but water - 'wounded water'. There is a water shortage crisis looming - already a litre of drinking water costs as much in Iraq as a litre of oil. The artists explore this issue through contaminated dates (once the pride of Basra, until Saddam deliberately destroyed 20 million date palms), dried-up waterfalls in Kurdistan (the fountainhead on which all of Iraq depends), and outsize taps looming over piles of plastic bottles. But the work is always imaginative, never just didactic.\n\nThis is an epoch-making event in the history of a war-torn country. The film opens a new window on that world, seeing it through the eyes of artists who have been torn away from it.\n\nBBC Site: &lt;a href=&quot;\nhttp://www.bbc.co.uk/programmes/b012xt77&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/programmes/b012xt77&lt;/a&gt;\n\nTechnical Spec\nVideo Codec: x264 CABAC\nVideo Bitrate: 3400 Kbps\nVideo Aspect Ratio: 1.777:1\nVideo Resolution: 1280x720\nAudio Codec: HE-AAC\nAudio Bitrate: 128 Kbps ABR 48KHz\nAudio Channels: 2\nRun-Time: 55 mins\nFramerate: 25FPS\nNumber of Parts: 1\nPart Size: 1.35 GB\nSubtitles: merged\nSource: HDTV\n\nSRT and Xvid also available from MVGroup","torrent":{"xt":"urn:btih:14b488fefd1986530a48566b3435f623c0af7515","amp;dn":"BBC+Imagine+2011+Iraq+in+Venice+HDTV+x264+AAC+MVGroup","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14b488fefd1986530a48566b3435f623c0af7515","infoHashBuffer":{"type":"Buffer","data":[20,180,136,254,253,25,134,83,10,72,86,107,52,53,246,35,192,175,117,21]},"announce":[],"urlList":[]}}