{"title":"Extremely Loud &amp; Incredibly Close XVID screener GLOBE","uid":7015749,"size":1263086577,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:167ff6866449ed77543979830b138ada6ddf73f5&amp;dn=Extremely+Loud+%26amp%3B+Incredibly+Close+XVID+screener+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1328650577,"description":"* XVID SCREENER     * 02H04M02S    * ~ 1200 Bitrate    * Worked with the Dub plugins\n\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n* Intro :\n\nExtremely Loud and Incredibly Close is a 2011 American drama film adaptation of the novel of the same name by Jonathan Safran Foer, directed by Stephen Daldry and written by Eric Roth. It stars Tom Hanks, Sandra Bullock, Thomas Horn, Max von Sydow, Viola Davis, John Goodman, Jeffrey Wright, and Zoe Caldwell.\n\nProduction took place in New York City. The film had a limited release in the United States on December 25, 2011 and a wide release on January 20, 2012. Despite mixed reviews from critics, the film has been nominated for two Academy Awards, Best Picture and Best Supporting Actor for Max von Sydow .\n\n\n\n* Plot :\n\nThe film begins with a body that seems to be falling from the sky, referencing that it is one jumper out of many who jumped from the World Trade Center on September 11. Oskar Schell (Thomas Horn) is introduced as the son of Thomas Schell (Tom Hanks), and during Thomas' funeral, Oskar recalls his memories leading to this moment.\n\nThomas and Oskar play a scavenger hunt that gives Oskar the task of finding ordinary objects throughout New York City. The scavenger hunt begins at a swing set in Central Park, where Thomas recalls swinging when he was a child. Oskar, however, is scared of swings due to his fear of jumping from them and falling to the ground. Thomas intends the game to be a learning experience for his son so that he can learn that &quot;if things were easy to find, they wouldn't be worth finding&quot;. On September 11, Oskar is let out of school early while his mother Linda (Sandra Bullock) is at work. When Oskar gets home, he finds 6 messages on the phone from his father, saying that he is in the World Trade Center on the 105th floor of the North Tower. Oskar soon learns of the Twin Towers attack by seeing footage on the TV news. As the Twin Towers collapse, Oskar falls to the floor, knowing that his father has been killed.\n\nA few weeks after September 11, Oskar confides in his grandmother and they become close throughout their time of depression following Thomas's death. Oskar's relationship worsens with his mother since she can't explain why the World Trade Center was attacked and his father died. Oskar tells his mother he wishes it had been her in the building rather than his father, and she responds, &quot;I wish the same thing.&quot;\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:167ff6866449ed77543979830b138ada6ddf73f5","amp;dn":"Extremely+Loud+%26amp%3B+Incredibly+Close+XVID+screener+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"167ff6866449ed77543979830b138ada6ddf73f5","infoHashBuffer":{"type":"Buffer","data":[22,127,246,134,100,73,237,119,84,57,121,131,11,19,138,218,109,223,115,245]},"announce":[],"urlList":[]}}