{"title":"The Girl with the Red Scarf (1978)[Selvi boylum, al yazmalim]","uid":6527633,"size":731033143,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:16dfc025f42c90c8e302efa9fb3f5a5442ba4eb3&amp;dn=The+Girl+with+the+Red+Scarf+%281978%29%5BSelvi+boylum%2C+al+yazmalim%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DdxXxZ","files":2,"time":1310208175,"description":"Spoken language: Turkish\nDuration: 90 min\n\nA classic and endlessly watchable love story that never dates Inspired by the novel of acclaimed writer Cengiz Aytmatov, Atif Yilmaz adapts one of history's greatest love stories to the screen with the greatest finesse. It is said, in fact, that the French poet Aragon described The Girl With The Red Scarf as &quot;the world's greatest love story&quot;.\n\nWe begin by being lured into the captivating world of Ilyas, a truck driver who delivers sand to a dam construction, his newly acquired wife Asya and their young son Samet. But the legendary love affair between Asya and Ilyas is soon shaken by jealousy, an alcohol habit and extra-marital affair. Ilyas, who genuinely loves his wife but is hampered by an ever weakening character, ends up walking out when job-related problems come to a head. The helpless Asya is left with their son to cope alone. She waits patiently for her husband to return Until she runs into Cemsit, a sympathetic figure who Samet soon begins to identify as his father. When she finally surrenders to his affections, life takes on an entirely new hue.\n\nBut then, years later, Ilyas suddenly appears from nowhere, demanding his wife and child back. His arrival rekindles the questions that have preoccupied hearts and minds since time immemorial. What is love? What makes a lover? What makes a spouse? What makes a father?... And which is harder: to go back or not to go back?\n\nThe Girl With The Red Scarf stands out for its brilliant casting, the polished performances of its three leads, TÃƒÂ¼rkan Soray, Kadir Inanir and Ahmet Mekin, the refined direction of Atif Yilmaz and highly effective score of Cahit Berkay. Be warned: this is a film that plays mercilessly on the heartstrings.","torrent":{"xt":"urn:btih:16dfc025f42c90c8e302efa9fb3f5a5442ba4eb3","amp;dn":"The+Girl+with+the+Red+Scarf+%281978%29%5BSelvi+boylum%2C+al+yazmalim%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16dfc025f42c90c8e302efa9fb3f5a5442ba4eb3","infoHashBuffer":{"type":"Buffer","data":[22,223,192,37,244,44,144,200,227,2,239,169,251,63,90,84,66,186,78,179]},"announce":[],"urlList":[]}}