{"title":"Apollo 18 2011 TS PROPER COMPLETE READNFO XViD AC3-DD (Kingdom-R","uid":6650870,"size":1094148950,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1a16ee240a1094375599f0178ba9e164347df334&amp;dn=Apollo+18+2011+TS+PROPER+COMPLETE+READNFO+XViD+AC3-DD+%28Kingdom-R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"megagunuk","files":4,"time":1315142905,"description":"Genre : Sc-Fi / Horror / Thriller\n\nPlot : Decades-old found footage from NASA\\\\\\\\\\\\\\'s abandoned Apollo 18 mission, where two American astronauts were sent on a secret expedition, reveals the reason the U.S. has never returned to the moon.\n\nGenre Horror | Sci-fi | Thriller\nLanguage English\nSubtitles none\nTotal Size 1 gb\nDuration 1:14:12\nSource Video: rukino and unknown cam source Audio: CHOiCE\nEncoder Digideath\n\nVideo Specs\nContainer and Codec: AVI | XviD\nFrontend And Writing Library: Megui | XviD 1.2.1 (UTC 2008-12-04)\nBitrate: 1803 kbps\nEncoding: 2 Pass\nResolution: 720 x 392\nDisplay Aspect Ratio: 1.83:1\nQuality Factor (QF): 0.255\nFrame Rate: 25 Fps\n\nAudio Specs\nAudio Codec And Type: Aften AC3 | Audio Coding 3\nBitrate Mode: Constant\nBitrate: 128 Kbps\nSample Rate: 48 KHz\nChannel Count: 2 channels (stereo)\n\nNOTES:\nREADNFO and PROPER for several reasons, just to get a few important points across. I highly advise you read this first.\n\nReason for the PROPER tag:\nAs of the point of posting this, none have properly corrected perspective\\\\\\\\\\\\\\'s. CHOiCE have attempted to fix perspective but there still off. The left margine is still skewed to the right. There pic is narrower at top. Meaning aspect is effectivley off or the pic is contorted outa shape. Mine is corrected properly.\n\nBiggest issues and reason for readnfo:\nThere is a couple of mins missing from the start.\nThe first 1 mn 45 sec of vid, is not from rukino\\\\\\\\\\\\\\'s cam. Its from an undisclosed, lower quality cam. I trimmed this off CHOiCE\\\\\\\\\\\\\\'s vid and appended it onto the start of mine, after working it seperatly.\nThe movie is supposed to judder and be of fluctuating quality. This depicts several different 1970\\\\\\\\\\\\\\'s cameras and is all part of the intended atmosphere. In other words its supposed to look rough.\nResolutions strange yet aspect apears correct. Round is round and square is square. Thats cams for you but. Unless every piece of vid is 100% there and there is no cropping, then cams always follow strange resolutions to compensate for the missing vid, lest ye risk knocking aspect off lol.\n\nWork done:\nVideo: Corrected perspective PROPERLY. Corrected a small amount of \\\\\\\\\\\\\\&quot;the shakes\\\\\\\\\\\\\\&quot;. Couldnt go to far, with this bar i risked removing intended effects in the movie. Corrected contrast and brightness. Balanced colours as best as i could.\nAudio: Great line. Filtered alot of hissing out. Lowered the volume and balanced eq better. Had to add 100 milisecs of background noise at 1mn 45 secs, due to appending the start clip, to maintain sync with the rest of the vid.\n\nIve tried to get this up to my normal standard but please note. I\\\\\\\\\\\\\\'m always a big believer in things \\\\\\\\\\\\\\&quot;being the way there supposed to be\\\\\\\\\\\\\\&quot; so i was extremely wary and limited due to risking knocking off the directors intended effects. Still, this is sweet looking and it sounds amazing. Its not perfect, then it is only a cam and the movies not supposed to be perfect anyway\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1772240/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1772240/&lt;/a&gt;\n\n\nEnJoY\n\nMegaGun :@)","torrent":{"xt":"urn:btih:1a16ee240a1094375599f0178ba9e164347df334","amp;dn":"Apollo+18+2011+TS+PROPER+COMPLETE+READNFO+XViD+AC3-DD+%28Kingdom-R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a16ee240a1094375599f0178ba9e164347df334","infoHashBuffer":{"type":"Buffer","data":[26,22,238,36,10,16,148,55,85,153,240,23,139,169,225,100,52,125,243,52]},"announce":[],"urlList":[]}}