{"title":"Fred Vogel - Murder Collection - High Quality (new done by sdm)","uid":6579124,"size":733604547,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1b1e4326447631246a749fc8572495f1d67397d1&amp;dn=Fred+Vogel+-+Murder+Collection+-+High+Quality+%28new+done+by+sdm%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sdmreleases","files":3,"time":1312336204,"description":"The probably most disgusting and sick film ever made. \nSnuff film\n\n\nIMDB:\n\nWhat a joke.... if the guys from Toetag Pictures make a movie about \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;the accessibility of violence on the internet\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; you know not to expect any serious message or depth. This is some cheap pseudo-snuff with production values of a 5 dozen beers and 10 Pizzas to cash in on some perverts who wet their pants when hearing the word \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;snuff\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;.\n\nThese are the people who brought us the 3 August Underground \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Movies\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; ... you got to give it to them. Making movies without a concept or a script, quite an idea! Now \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Murder Collection V.1\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; is a waste of resources even by their low standards. Pseudo-Reality shots of murders watched through security- and webcams or like in August Underground with a DV Cam in Documentation Mode. Most of the time nothing is happening... Paranormal Activity is a high action shocker compared to this. I am really ashamed of myself for having watched these 80 minutes of nothingness in fast-forward mode. You barely get any splatter FX in this one... why waste work and money if you show it with bad quality like through a security cam anyway. Just have some friends parade around swinging some hammers, knives and pretending to punch someone. I especially liked the ridiculous scenes after the murders with bad \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;actors\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; pretending to be shocked by their own actions in nearly every of those clips ... just like that would give any meaning to this turd of a movie.\n\nIts BAD... but worst of all are the interludes with pitch-shifted voice and collages of eyes telling us some lame stories about violence and how death affects us. Not just is it written like by a school dropout, they didn\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'t even spell check which is the best proof of what a rip off this is. If you see the name \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Toetag Pictures\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; stay away as far as you can... I know I will from now on. So don\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'t fall for the fake 10 point reviews which are obviously written by teammembers themselves.\n\nAtrocious!\n\n\n___________________________________________________________________________________\n\n\n\nHelp me with making my torrents public. if you want me to upload anything else please contact me. this is my first torrent. read info!\n\nThanks\n\nkeep sharing, keep caring\n\nPunks not dead, and there are still antifascist-metal bands!!\n\nNazis fuck off!! ;)","torrent":{"xt":"urn:btih:1b1e4326447631246a749fc8572495f1d67397d1","amp;dn":"Fred+Vogel+-+Murder+Collection+-+High+Quality+%28new+done+by+sdm%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b1e4326447631246a749fc8572495f1d67397d1","infoHashBuffer":{"type":"Buffer","data":[27,30,67,38,68,118,49,36,106,116,159,200,87,36,149,241,214,115,151,209]},"announce":[],"urlList":[]}}