{"title":"La.Cosa.2011.BDrip.m720.PPK.mkv","uid":7012591,"size":2929095097,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:1cfbb0cc532a65053ad5356816086bc8c029deea&amp;dn=La.Cosa.2011.BDrip.m720.PPK.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"OLMID","files":1,"time":1328526058,"description":"La cosa (The Thing)\n\nPais: USA\nDirector: Matthijs Van Heijningen\nGuion: Ronald D. Moore &amp; Eric Heisserer\n\nReparto: Mary Elizabeth Winstead, Joel Edgerton, Dennis StorhÃƒÂ¸i, Trond Espen Seim, JÃƒÂ¸rgen Langhelle, Eric Christian Olsen, Stig Henrik Hoff, Jan Gunnar RÃƒÂ¸ise, Kristofer Hivju, Jo Adrian Haavind, Jonathan Walker, Adewale Akinnuoye-Agbaje\n\n\nSinopsis\nLa belleza aterradora de un continente extraordinario, la AntÃƒÂ¡rtida, sirve de telÃƒÂ³n de fondo para una misiÃƒÂ³n cientÃƒÂ­fica. Un descubrimiento que abre posibilidades inimaginables se convierte en una lucha por la supervivencia cuando un grupo de investigadores internacionales descubre a un alienÃƒÂ­gena. La criatura tiene la habilidad de cambiar de forma a voluntad y convertirse en la copia perfecta de cualquier ser humano.\nLa paleontÃƒÂ³loga Kate Lloyd (Mary Elizabeth Winstead) ha viajado a la desolada regiÃƒÂ³n para hacer realidad su sueÃƒÂ±o. Se une a un equipo noruego que ha encontrado accidentalmente una nave extraterrestre enterrada en el hielo, y descubre un organismo que parece haber muerto en la colisiÃƒÂ³n hace miles de aÃƒÂ±os. Pero estÃƒÂ¡ a punto de despertar...\nUn sencillo experimento libera al alienÃƒÂ­gena de su cÃƒÂ¡rcel de hielo. Kate y Carter (Joel Edgerton), el piloto de la expediciÃƒÂ³n, unirÃƒÂ¡n sus fuerzas para impedir que la criatura mate a los miembros del equipo uno a uno. En la inmensidad blanca, un parÃƒÂ¡sito capaz de imitar a la perfecciÃƒÂ³n a cualquier ser vivo que toca, conseguirÃƒÂ¡ que florezca la desconfianza y el terror mientras intenta sobrevivir y florecer. \n\n\n\nDatos del archivo:\n","torrent":{"xt":"urn:btih:1cfbb0cc532a65053ad5356816086bc8c029deea","amp;dn":"La.Cosa.2011.BDrip.m720.PPK.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cfbb0cc532a65053ad5356816086bc8c029deea","infoHashBuffer":{"type":"Buffer","data":[28,251,176,204,83,42,101,5,58,213,53,104,22,8,107,200,192,41,222,234]},"announce":[],"urlList":[]}}