{"title":"Deus.Ex.Human.Revolution.XBOX360-COMPLEX","uid":6612130,"size":7838709469,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:1f3dc949c7548c545f16bde2be9769fab6bd3635&amp;dn=Deus.Ex.Human.Revolution.XBOX360-COMPLEX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"w0kal1tle","files":-1,"time":1313641668,"description":"Region      : Region Free           Languages: English         \nSize        : 01 x DISC             Genre    : RPG \nPlatform    : XBOX 360              Date     : August 2011 \n\n \n  Release Info:                                                             \n  ~~~~~~~~~~~~~\n\n  You play Adam Jensen, an ex-SWAT specialist who's been handpicked to \n  oversee the defensive needs of one of America's most experimental \n  biotechnology firms. Your job is to safeguard company secrets, but when a \n  black ops team breaks in and kills the very scientists you were hired to \n  protect, everything you thought you knew about your job changes\n  \n  Badly wounded during the attack, you have no choice but to become \n  mechanically augmented and you soon find yourself chasing down leads all \n  over the world, never knowing who you can trust. At a time when scientific \n  advancements are turning athletes, soldiers and spies into super enhanced \n  beings, someone is working very hard to ensure mankind's evolution follows \n  a particular path.\n  \n  You need to discover where that path lies. Because when all is said and \n  done, the decisions you take, and the choices you make, will be the only \n  things that can change it.\n  \n  \n  \n     \n       A divided near-future: discover a time of great technological \n  advancement, but also a time of chaos and conspiracy. Mechanical \n  augmentations of the human body have divided society between those who can \n  afford them, and those who can't. Opposing forces conspire from the shadow \n  to control the destiny of mankind: a human revolution is coming.\n  \n     \n       A perfect mix of action and role-play: the game uniquely combines \n  action-packed close-quarter takedowns with intense shooting, offering a \n  vast array of character augmentations and upgrades for the many weapons at \n  your disposal. Unlock new abilities and increase your stealth, social, \n  hacking or combat skills: the game rewards all styles of play and \n  approaches. Determine how you want your character to evolve, based on how \n  you want to play the game.\n  \n     \n       Choices and consequences: shoot your way through your enemies, sneak \n  up behind them without being traced, hack systems to retrieve crucial \n  information, or use your social skills to extract information from key \n  characters - there are always choices, multiple approaches, multiple paths \n  and multiple tools at your disposal. Choose your playing style and face the \n  consequences of your actions: you decide how the story unfolds.","torrent":{"xt":"urn:btih:1f3dc949c7548c545f16bde2be9769fab6bd3635","amp;dn":"Deus.Ex.Human.Revolution.XBOX360-COMPLEX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f3dc949c7548c545f16bde2be9769fab6bd3635","infoHashBuffer":{"type":"Buffer","data":[31,61,201,73,199,84,140,84,95,22,189,226,190,151,105,250,182,189,54,53]},"announce":[],"urlList":[]}}