{"title":"Bopup.Messenger.v5.6.1.Corporate.Instant.Messaging.Software.Mult","uid":6569989,"size":10036981,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:207e9cc9d2777860127c8642a2c507a84c4e3ad7&amp;dn=Bopup.Messenger.v5.6.1.Corporate.Instant.Messaging.Software.Mult&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"boffon","files":-1,"time":1311899883,"description":"Bopup Messenger version 5.6.1.9133\nSecure instant messenger for effective business communications\n\nThis torrent includes English, German, Spanish, French, Dutch and Russian \nsetup packages of the product.\n========================================================================\n\n[OVERVIEW]\n\nBopup Messenger is a secure instant messenger designed to communicate \nover LAN and enterprise-size networks. This clear, easy to use and \nlight-weight IM client offers a set of corporate features and answers \nmost of the business needs you may have. \n\nWith this messenger, you can easily connect users from all other offices \nand locations to one IM workspace and exchange files, urgent and \nextended messages with links, font and color formatting and emoticons, \nand can receive assigned files and directories from the IM server. \nOrganize your personal contact list that is accessible to you from any \nworkplace and see who is online and available to communicate among your \ncontacts. \n\nMessaging and File Transfer are encrypted with strong algorithms so that \npersonal and group conversations are safe and secure even if you send \nmessages and files via the Internet. You will never lose any information \nyou exchange because offline data are stored and automatically delivered \nby the server when the recipient goes online. \n\nNo user experience and skills are needed to use the program. The smart \nand comfortable user interface with advanced usability options and popup \nnotifications allows you to join the IM network in a few mouse clicks. \nThe messenger completely supports the Terminal Server/Citrix environment \nand can be used simultaneously by multiple users on one computer. Bopup \nMessenger can automatically download and install updates from the IM \nserver. \n\nThe centralized client/server architecture offers complete and flexible \nmanagement for controlling your IM infrastructure. The central server \nlogs all user activity and archives all messages and transfers with the \nreporting, search and printing options. It allows you to manage \nmessaging groups, users\\' contact information and permissions to send and \nview other users, assign and distribute important files and documents to \nusers. It is easy to import user accounts from your Active Directory \n(LDAP) and start an efficient Instant Messaging system right now. \n\n\nKey features:\n\nSECURE COMMUNICATION\nAll messages and file transfers are encoded with strong encryption \nalgorithms. That is the first and primary way to make corporate IM safe \nand secure. \n\nMESSAGING GROUPS\nThe centralized management of user groups allows organizing a flexible \nIM structure with a list of assigned groups and send/receive-only \npermissions available to each user. \n\nUSER PRESENCE STATUS\nSee the current status of each user in your Contact List, i.e. Online, \nAway, Offline (Not available). Manage your own status. \n\nCONTACT LIST ACCESS\nOrganize your personal Contact List and access it from any workplace and \nlocation. \n\nEASE OF USE\nThe smart and handy user interface is intuitive and easy. It really is. \n\nOFFLINE MESSAGING AND FILE TRANSFER\nDeliver important information to users even if they are currently \nunavailable and receive such messages and files. Offline messages and \ntransfers are stored on the IM server and automatically delivered to the \nrecipient when he goes online. \n\nFILE DISTRIBUTION\nReceive files and documents that are assigned to you on the IM server. \nThis feature offers an easy and secure distributing files and \ndirectories with a set of advanced flags. \n\nFAVORITE MESSAGES\nSelect your favorite messages with important information and they will \nbe always in your message list until you delete them. \n\nTERMINAL SERVER SUPPORT\nThe complete support for the Terminal Server, Citrix environments and \nWindows XP Fast User Switching feature. The messenger can be used by \nmultiple users connected to the same server via Terminal Client sessions \nor by several users who have logon sessions on the same computer. \n\nCENTRALIZED NOTIFICATION\nReceive notifications and urgent messages from the IM server and stay \nupdated on any events and information. These messages are automatically \nsent by the server on the scheduled time and at the specified intervals. \n\nMESSAGE AND TRANSFER LOGGING &amp; ARCHIVING\nBrowse, search and view the entire message and transfer archives on the \nIM server. Print information for any period, for any person. \n\nINSTANT UPDATES FROM THE IM SERVER\nThe messenger can be instantly updated from the central IM server. This \nfeature allows you to keep client versions up-to-date and deploy new \nsoftware updates and patches in a completely automated way without \nhaving to manually install it on all user computers. \n\n\n[SYSTEM REQUIREMENTS]\n\nThe following minimum system configuration is required: \n\n* 533 MHz processor (or higher recommended) \n* 64 MB RAM \n* 3 MB free disk space \n* Microsoft Windows 98/ME/NT 4.0/2000/XP/2003/Vista/7\n* Network configured for TCP/IP protocol \n* Internet connection (*Optional)\n\n\n\n[LIMITATIONS]\n\nThis is 30-day trial version! For advanced details and purchasing \ninformation please refer B Labs website and product page at   &lt;a href=&quot;\nhttp://www.bopup.com/products/messenger/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bopup.com/products/messenger/&lt;/a&gt;\n\n\n========================================================================\nCopyright (C) 2000-2011 B Labs. All rights reserved. &lt;a href=&quot;\nhttp://www.bopup.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bopup.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:207e9cc9d2777860127c8642a2c507a84c4e3ad7","amp;dn":"Bopup.Messenger.v5.6.1.Corporate.Instant.Messaging.Software.Mult","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"207e9cc9d2777860127c8642a2c507a84c4e3ad7","infoHashBuffer":{"type":"Buffer","data":[32,126,156,201,210,119,120,96,18,124,134,66,162,197,7,168,76,78,58,215]},"announce":[],"urlList":[]}}