{"title":"ScreenFlow 2.1.9 [k'ed] - Phixtit","uid":6505203,"size":11474386,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:20acbca31c0361f689a48e3b8d2b079b2b056502&amp;dn=ScreenFlow+2.1.9+%5Bk%5C%27ed%5D+-+Phixtit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Phixtit","files":2,"time":1309407270,"description":"[b]Professional Screencasting Studio[/b]\n\n[img]http://t0.gstatic.com/images?q=tbn:ANd9GcSzAyBq1ktXJJgdXQEkcDyMjzU0iLgCHGNQCmqyTQYhj_582mA1Sg&amp;t=1[/img]\n \n[img]http://www.telestream.net/images/icon-mac-universal.gif[/img]\n\nRecord. Edit. Share.\nWith Telestream ScreenFlow screencasting software, you can capture the contents of your entire monitor at the same time as you capture your video camera, microphone and computer's audio. Simple but powerful editing tools enable you to create incredible screencasts in no time.The finished result is a QuickTime or Windows Media movie, ready for publishing to your Web site or blog.\n \nFeature Highlights\n\n    * Publish directly to YouTube\n    * Full range of elegant 2D &amp; 3D transitions\n    * Clip Speed, Freeze Frame &amp; Pause Recording\n    * Audio Ducking and Audio Detach\n    * Record from desktop, a video camera, microphone\n      and computer's audio all at the same time\n    * Highlight using 'Callouts'\n    * Elegant titling effects\n    * Powerful editing tools\n    * Keyboard shortcuts to make editing faster\n    * Insert freeze frames\n    * Highest quality exporting\n    * Customize your cursor\n    * Picture-in-Picture\n    * Position video in 3D\n    * And much more...\n\n\n[b]New Features in ScreenFlow 2.1 screencasting software[/b]\n\nNew Flash Publish feature\nScreenFlow can now create an all-in-one Flash video presentation, ready for easy upload straight to your website. The HTML, video and Flash player component are automatically created by ScreenFlow in a single step.\n\n64-bit support for audio capture\nThe audio driver used by ScreenFlow to capture system audio will now run on 64-bit Snow Leopard kernels.\n\nAutomatic saving of documents\nScreenFlow will continuously save changes to your documents in the background, ready to recover any unsaved edits in the unlikely event a fatal error occurs.\n\n \n[b]Features[/b]\n\nThe Best Capture\nScreenFlow has the best screen capture available. Using a custom multithreaded SSE &amp; Altivec accelerated, 64-bit enabled compression system, ScreenFlow can handle everything from capturing DVD video &amp; audio to fast moving Keynote presentations.\n\nRecord Everything\nYou don't need to pick an area of the screen for capture, ScreenFlow has advanced algorithms that only encode areas of change on your screen. The application is powerful enough to simultaneously record from your iSight or DV camera at the same time as your screen (and your microphone and computer's audio!).\n\nHighlight\nDuring your screen capture, ScreenFlow tracks where your mouse cursor is, when you click and when you press a key. This allows you to add mouse click effects (both visual and audible), an overlay showing your keystrokes and even lets you zoom the mouse pointer up &amp; down.\n\nEdit\nOnce your screen capture is complete, you're transported to the ScreenFlow editor. Using a familiar timeline interface, ScreenFlow lets you easily add zoom &amp; pan effects, trim clips, add drop shadow &amp; reflection, adjust audio levels etc. You can even combine existing media into your screencast.\n\nCallout\nCallouts let you highlight &amp; focus in on the mouse or front most window. Want to circle the area around the mouse? What took an experienced user minutes or hours in Final Cut Pro or After Effects is now a couple of clicks away.\n\nCustomizable Cursors\nCustomize your cursor's shape, size, opacity and use your own PNG file to personalize and brand your demo presentation.\n\nMotion\nScreenFlow introduces actions to the editing interface. These make it very quick &amp; easy to modify parameters of your screencast over time. For example, adding a video action lets you put zoom &amp; pan effects on your clips, while the audio action lets you adjust volume at different points in your screencast.\n\nFormat Support\nScreenFlow lets you share your screencast with the broadest audience to be viewed in any media player. ScreenFlow supports export to any QuickTime format, including H.264 MOV for playback in the Flash media player. It also supports direct export to Windows Media video with the Flip4Mac Windows Media component. The variety of export formats allows you to produce content for any user, regardless what media player they prefer.\n\nPowerful titling\nScreenFlow supports titling and text objects, including multiple fonts and styles that enables you to add striking titles to your screencasts.\n\nPicture-in-Picture\nWith the simultaneous recording of computer desktop and camera, and with the support for various layers, you can easily include a picture-in-picture effect in your ScreenFlow video recording. While demoing a software, or presenting slides you can have a smaller picture of the demo artist or the presenter on top of the actual dem","torrent":{"xt":"urn:btih:20acbca31c0361f689a48e3b8d2b079b2b056502","amp;dn":"ScreenFlow+2.1.9+%5Bk%5C%27ed%5D+-+Phixtit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20acbca31c0361f689a48e3b8d2b079b2b056502","infoHashBuffer":{"type":"Buffer","data":[32,172,188,163,28,3,97,246,137,164,142,59,141,43,7,155,43,5,101,2]},"announce":[],"urlList":[]}}