{"title":"Earth Alerts 2011.2.10 Portable","uid":6864830,"size":7864425,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:20e67ae9467f84f804b904166e53318ccf39668c&amp;dn=Earth+Alerts+2011.2.10+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1323053718,"description":"Earth Alerts 2011.2.10 Portable\n\nEarth Alerts is a Windows-based application that allows you to monitor in near real-time a variety of natural hazard events that are occurring anywhere around the world. Alert notifications, reports, and imagery provide the user with a convenient way to view natural phenomenon as they occur, whether close to home or some far-flung corner of the globe!\n\nEarth Alerts uses a variety of online resources provided by organizations such as the National Weather Service, U.S. Geological Survey and Smithsonian Institution (just to name a few), to identify what sort of activities &quot;Mother Earth&quot; is currently dishing out on the planet.\n\nTo use Earth Alerts, you simply select the specific natural hazards -- earthquakes, tsunamis, volcanoes, tropical cyclones, wildland fires, landslides, severe weather, local weather, etc. -- and the locations that interest you. The application will then automatically retrieve the latest information from various live data feeds available on the Internet and present it to you in a convenient arrangement of reports, maps and images.\n\nEarth Alerts has been available to the general public since 2005. In that time it has undergone a number of significant enhancements. As a hobby, a one man production and a labor of love, conceiving the ideas and creating Earth Alerts has been a (time consuming) pet project over the past few years!\n\nFeatures:\n# Global activity overview: earthquakes, tsunamis, volcanoes, and tropical cyclones (typhoons, hurricanes, tropical storms, tropical depressions and other disturbances)\n# Activity for user-selected Global locations (anywhere outside the U.S.): local earthquakes, local weather including current conditions, forecasts and satellite imagery\n# United States activity overview: severe weather including special tornado and severe thunderstorm watches, volcanoes, wildland fires (wildfires), and landslide related hazards\n# Activity for user-selected United States locations: local earthquakes; local wildland fires; local weather including NWS weather/hazard alerts, current conditions, forecasts and radar/satellite imagery\n# Google Earth? integration provides visualizations of recent earthquake events, volcanoes, tropical cyclones, wildland fires and severe weather warnings. Google Earth? integration also provides high resolution views of any user-selected U.S. or Global location\n# Visual and sound notifications on your Windows desktop identifying active alerts\n# Email: information on any type of natural hazard tracked by Earth Alerts can be automatically sent as soon as an alert is raised; email messages contain the same alert reports and images as shown in the Earth Alerts application screens\n# Mobile Phone: SMS/MMS messages containing summary alert information with related images (MMS enabled phones only) can be automatically sent to your mobile device; these notifications cover the most severe natural hazard events, including major earthquakes, tsunami watches/warnings, volcanic eruptions and tornado warnings\n\nLimitations: .NET Framework 3.5. During installation of Earth Alerts you should automatically be prompted to download/install the .NET Framework 3.5 if it doesn't currently exist on your Windows system.\n\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\n\n\n*** When using TPB please read these important notes: \n-----------------------------------------------------\n\n01. AV software may warn about keygens, patches, cracks etc because of their \n    capabilities and signatures (generating codes, etc). Sometimes also they\\'re \n    added to the virus/spyware database and will be detected as malware. If not \n    trusting keygens, patches, cracks etc don\\'t use them.\n\n02. To avoid AV software removing/blocking clean cracks etc: exclude the crack \n    or folder from being auto-protected &amp; auto-scanned by the AV software.\n\n03. If AV software removed a clean crack usually it can be restored \n    (if it\\'s not in Quarantine then look at History or something similar).\n\n04. To avoid risks when using cracks also Sandboxie can be used to test them:\n   &lt;a href=&quot; http://www.sandboxie.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.sandboxie.com/&lt;/a&gt;\n   &lt;a href=&quot; http://thepiratebay.se/torrent/6487418&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/6487418&lt;/a&gt;\n\n05. Before running .exe-files, keygens, patches, cracks etc always check first \n    if they can be unpacked. Often some thirth party added a virus to the \n    original file, repacked it, and uploaded it again.\n\n06. Letting AV software software sending scan results to their companies \n    can cause keygens, patches, cracks etc being added to their virus-database.\n\n07. Firewalls which are set to automatically decide for connections will allow \n    connections for lots of apps &amp; MALWARE!. To avoid so firewalls should be set \n    to decide yourself which connection to allow or not.\n\n08. Clicking on unknown links can coz malware being silently installed on a pc!\n\n09. Usually (new) torrents with extreme many downloads &amp; seeders in a short time \n    are very suspicious! Torrents with a SKULL-logo are trusted.\n\n10. Some (frustrated) people use multiple accounts and post lots of FAKE comments \n    and/or files trying to spread confusion. Usually they NEVER seriously reply \n    on comments and don\\'t have any torrent, or to look reliable just a few.\n\n11. In general often there are more fake &amp; negative comments than reliable &amp; \n    positive comments.\n\n12. In some countries uploading/downloading copyright-protected material is \n    forbidden, but showing some appreciation to reliable uploaders is not.\n\n13. Posting FAKE comments &amp; uploads on TPB can result in getting banned from TPB!\n\n14. Comments are welcome, unlike ranting, trolling, whining, etc.\n\n15. No Promises ... No Debts!\n\n\nFor reporting bad or suspicious torrents                                                             &lt;a href=&quot;\nhttps://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nFor my 1300+ torrents                                                             &lt;a href=&quot;\nhttp://thepiratebay.se/user/Anacondaz/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Anacondaz/&lt;/a&gt;\n\n\n-----------------------------------------------------------------------------------\n\n\nTo the \\&quot;United Reliable The Pirate Bay Users\\&quot;,\n\nNowadays a lot of TPB members abuse their TPB membership by intentionally \nposting fake comments &amp; files. Their meaning is just trying to spread \nconfusion and to frustrate TPB and it\\'s users. \nLess downloaders = less seeders = less download speed etc = not good! \n\nIt\\'s in the benefit of TPB and all reliable users to warn each other about people \nwho intentionally keep posting fake comments &amp; files. It\\'s an easy answer against \nthose who intentionally keep posting fake comments &amp; files, which is a never \nending issue. \n\nWhen reporting errors or false positives just keep in mind that what goes up for \none does not always goes up for another. That\\'s for both the working of an app \nand about false positives! Remember: whatever is said, say it constructive! \nLet\\'s just try to help each other and TPB by thinking about what\\'s said &amp; posted. \nThings are all up to you, the \\&quot;United Reliable The Pirate Bay Users\\&quot;!\n\n\nEnjoy The Pirate Bay\t","torrent":{"xt":"urn:btih:20e67ae9467f84f804b904166e53318ccf39668c","amp;dn":"Earth+Alerts+2011.2.10+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20e67ae9467f84f804b904166e53318ccf39668c","infoHashBuffer":{"type":"Buffer","data":[32,230,122,233,70,127,132,248,4,185,4,22,110,83,49,140,207,57,102,140]},"announce":[],"urlList":[]}}