{"title":"National Security(2003)DVDRip.AC3(ENG)-DROCK","uid":6583194,"size":725950464,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:21e27ff7f7b65e61503246d244124676ca6b99c2&amp;dn=National+Security%282003%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"drock232","files":-1,"time":1312503682,"description":"Adversaries become wary allies in this free-wheeling action comedy. Hank Rafferty (Steve Zahn) is a Los Angeles Police Department officer who finds himself out of a job after he becomes involved in a violent altercation with police academy flunk-out Earl Montgomery (Martin Lawrence), escalating into a media event which brings the LAPD a wealth of bad publicity. Unable to find work, Hank finally takes a job as a &quot;rent-a-cop&quot; with a private security firm -- and discovers to his annoyance that his new partner is Earl. While neither of them are thrilled to be working together on the lowest strata of the law enforcement community, the two find themselves dealing with bigger crime than they expected when they stumble across evidence of a elite smuggling network operated by criminal mastermind Nash (Eric Roberts). Hank and Earl want to put Nash out of business, and they try without success to persuade the police of the importance of the case. But before long they discover it's not just Nash's men who are after them, but two high-ranking LAPD officials, Lt. Washington (Bill Duke) and Detective McDuff (Colm Feore). National Security was directed by Dennis Dugan, who'd previously helmed antic comedies starring Adam Sandler and Chris Farley; this film also marked Martin Lawrence's entry into the elite of Hollywood's comedy stars, with Lawrence taking home a 20-million-dollar paycheck for his work on the picture. \n\nRipped with Autogk.\n\nLength: 1 Hour 28 Minutes\n\nFile Type: AVI\n\nFrame Width: 592\n\nFrame Height: 336\n\nFrame Rate: 59fps\n\nAudio\n\nBit Rate: 112kbps","torrent":{"xt":"urn:btih:21e27ff7f7b65e61503246d244124676ca6b99c2","amp;dn":"National+Security%282003%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21e27ff7f7b65e61503246d244124676ca6b99c2","infoHashBuffer":{"type":"Buffer","data":[33,226,127,247,247,182,94,97,80,50,70,210,68,18,70,118,202,107,153,194]},"announce":[],"urlList":[]}}