{"title":"Whatever Happened to the Likely Lads  (BBC Drama)","uid":6635527,"size":334653018,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:238e0265ee122a7262557348098bf40110c2f45a&amp;dn=Whatever+Happened+to+the+Likely+Lads++%28BBC+Drama%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rosie1966","files":13,"time":1314543902,"description":"Whatever Happened to the Likely Lads? - Series 01 - Audio Comedy - BBC 7 via DVB-T\n13 x 30 Minute Episodes - 128Kbps - Mp3 - Slimoo \n\n\n\nWhatever Happened to the Likely Lads? was a hit British sitcom. \n\nIt was created and written, as was its predecessor, by Dick Clement and Ian La Frenais. \n\nThe show followed the resumed friendship, after five years apart, of two young working-class men, Bob Ferris and Terry Collier.\n\nSet in North East England, assumed to be on Tyneside but never really confirmed, the humour was based on the tension between fresh-from-the-army Terry's laziness and Bob's progression to the middle class via his new white-collar job, suburban home and impending marriage to his childhood sweetheart Thelma Chambers \n\nSince the end of the original The Likely Lads, in 1966, Bob has left factory life behind for an office job with his future father-in-law's building firm. \n\nTerry sees his extended army experience as lending him moral superiority over Bob. \nNonetheless, he finds it hard to adjust to all the changes that have occurred in the five years he has been away. \n\nAs implied by the show's title, the series plays on a feeling of nostalgia for the days of the lads' innocent and reckless youth.\n\n\nMany of these episodes were lost by the BBC due to re-using the tapes.\nThey were recovered from listeners home recordings.\n\nAs on most home recordings from radio to cassette days, the intro's are not 100% complete.\n\n\nRodney Bewes\nJames Bolam\nBrigit Forsyth\n\n\nWhatever Happened To The Likely Lads - S01 - E01 - Strangers On A Train\nWhatever Happened To The Likely Lads - S01 - E02 - Home Is The Hero\nWhatever Happened To The Likely Lads - S01 - E03 - Cold Feet\nWhatever Happened To The Likely Lads - S01 - E04 - Moving On\nWhatever Happened To The Likely Lads - S01 - E05 - I'll Never Forget Whatshername\nWhatever Happened To The Likely Lads - S01 - E06 - Birthday Boy \nWhatever Happened To The Likely Lads - S01 - E07 - No Hiding Place\nWhatever Happened To The Likely Lads - S01 - E08 - Guess Who's Coming To Dinner\nWhatever Happened To The Likely Lads - S01 - E09 - Storm In A Tea Chest\nWhatever Happened To The Likely Lads - S01 - E10 - The Old Magic\nWhatever Happened To The Likely Lads - S01 - E11 - Countdown\nWhatever Happened To The Likely Lads - S01 - E12 - Boys' Night In\nWhatever Happened To The Likely Lads - S01 - E13 - End Of An Era\n.\n\nAudio Format    : MP3\nDuration        : 28mn 1s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:238e0265ee122a7262557348098bf40110c2f45a","amp;dn":"Whatever+Happened+to+the+Likely+Lads++%28BBC+Drama%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"238e0265ee122a7262557348098bf40110c2f45a","infoHashBuffer":{"type":"Buffer","data":[35,142,2,101,238,18,42,114,98,85,115,72,9,139,244,1,16,194,244,90]},"announce":[],"urlList":[]}}