{"title":"Men In Black 2(2002)DVDRip.AC3(ENG)-DROCK","uid":6566094,"size":736690176,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:23993344e02e2d0726833c45597151a15cd716a4&amp;dn=Men+In+Black+2%282002%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1311688560,"description":"Otherworldly villains are on the loose again, and it\\\\\\'s up to Earth\\\\\\'s interstellar police force to bring them to justice in this sequel to the sci-fi comedy blockbuster Men in Black. Agent Jay (Will Smith) has become a high-ranking member of the Men in Black, the secret government task force designed to deal with unruly visitors from other worlds, while his former cohort, Agent Kay (Tommy Lee Jones), had his memory wiped clean and now lives a simple but contented life as a mailman. However, an especially nasty alien threat has reared its not-so-ugly head; Serleena (Lara Flynn Boyle) is a shape-shifting Kylothian alien who is in pursuit of another escaped visitor who holds the key to powers that would allow her to destroy the world. Making Serleena all the more dangerous is the fact she\\\\\\'s taken on the appearance of a lingerie model, making her irresistible to most men. When the rampaging Serleena takes control of the MIB offices, Jay is forced to turn to the only man who can help him save the world -- the former Agent Kay. After restoring Kay\\\\\\'s memory, the two remaining Men in Black set out to conquer Serleena with a motley band of friendly aliens, including a handful of worm creatures and a talking dog named Frank (voice of Tim Blaney). Jay, meanwhile, has his head turned by Laura (Rosario Dawson), an attractive waitress who was an unwitting witness to an alien attack. Men in Black 2 also features Rip Torn, Tony Shalhoub, David Cross, Patrick Warburton, and Johnny Knoxville.\n\nRipped with Autogk.\n\nLength: 1 Hour 28 Minutes\n\nFile Type: AVI\n\nFrame Width: 640\n\nFrame Height: 352\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 115kbps","torrent":{"xt":"urn:btih:23993344e02e2d0726833c45597151a15cd716a4","amp;dn":"Men+In+Black+2%282002%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23993344e02e2d0726833c45597151a15cd716a4","infoHashBuffer":{"type":"Buffer","data":[35,153,51,68,224,46,45,7,38,131,60,69,89,113,81,161,92,215,22,164]},"announce":[],"urlList":[]}}