{"title":"MobyDick - Moby Dick (1973 italian hard rock, 2009 remastered  d","uid":6513547,"size":370406026,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:249533cb19d48c0762ffe1f3b2b31b48c1a58b1e&amp;dn=MobyDick+-+Moby+Dick+%281973+italian+hard+rock%2C+2009+remastered++d&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":18,"time":1309730025,"description":"Moby Dick - Moby Dick (1973 italian hard rock, 2009 deluxe gatefold mini LP sleeve edition - FLAC)\n\n\nMoby Dick were formed in 1968, with bassist Enzo Petrone coming from I Volti di Pietra, a legendary group from Naples that never recorded anything and also gave birth to Osanna. Guitarist Toni Di Mauro and drummer Adriano Assanti had played with that group's singer, Lino Vairetti, as I Collegiali.\n\nThey had a good live activity throughout their five-year career, having briefly in their line-up singer Marco Cecioni from Balletto di Bronzo and percussionist Toni Esposito who played on Alan Sorrenti's first albums and later had a good solo career.\n\nAlways strongly influenced by British hard rock, and particularly devoted to Led Zeppelin, they managed to record an album at Olympic studios in London in 1973, but with no contracts it was never released until the Akarma issue in 2001.\n\nThey had also recorded an earlier demo at RCA studios and three tracks from the rare acetate are included on a bonus EP coming with the Akarma album.\n\nThough very good musicians they could never reach an original style, sounding like a sort of Zeppelin clone in the English sung seven tracks LP.\n\nThe three 1970 tracks, sung in Italian, sound a bit more original and closer to the early 70's Italian rock style, but it was their choice to sing in English that made the group refuse to record a demo for EMI, who wanted them to sing in Italian.\n\nThe band disbanded not long after the London recordings, with bassist Petrone rejoining old cohort Lino Vairetti in the Suddance-era Osanna (and still playing with them in their 2002 CD) and Toni Di Mauro living in Sweden as some former Balletto Di Bronzo members.\n\nSandro Coppola is still active in Naples as guitarist, Adriano Assanti moved to Switzerland and dedicated to New Age music.\n\n\n\nTrack list:\n\n\n01. Two Timing Girl (4'28&quot;)\n02. Free Wheelin Cat (4'30&quot;)\n03. My Friend (4'17&quot;)\n04. What Time Is It (6'00)\n05. Provisional Baby Hip (6'09&quot;)\n06. Groove Me (6'44&quot;)\n07. Sex 'N' Roll Express (7'56&quot;)\n\nBonus tracks recorded in 1970:\n08. Il Giorno Buono (2'36&quot;) [Bonus Track]\n09. Ad Ogni Costo (2'42&quot;) [Bonus Track]\n10. Parlo Nel Vento (2'46&quot;) [Bonus Track]\n\n\n\nMoby Dick:\n\n\n*Sandro Coppola (vocals, guitar)\n*Toni Di Mauro (guitar, vocals)\n*Enzo Petrone (bass)\n*Adriano Assanti (drums)\n\n\nBand: Moby Dick\nAlbum: Moby Dick\nYear: 1970/73/2009\nCountry: Italy\nGenre: Hard Rock\nSize: 353 Mb\nSource: My CD collection\nFormat: EAC&gt;Flac+.cue+log+scans (600 dpi)","torrent":{"xt":"urn:btih:249533cb19d48c0762ffe1f3b2b31b48c1a58b1e","amp;dn":"MobyDick+-+Moby+Dick+%281973+italian+hard+rock%2C+2009+remastered++d","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"249533cb19d48c0762ffe1f3b2b31b48c1a58b1e","infoHashBuffer":{"type":"Buffer","data":[36,149,51,203,25,212,140,7,98,255,225,243,178,179,27,72,193,165,139,30]},"announce":[],"urlList":[]}}