{"title":"tinycore_3.8.2.iso","uid":6609820,"size":10795008,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:24b13109e8e8fd20a1ee25431da17d47bd1949f1&amp;dn=tinycore_3.8.2.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cestpasgagne2","files":1,"time":1313551573,"description":"Tiny Core Linux is a very small (10 MB) minimal Linux GUI Desktop. It is based on Linux 2.6 kernel, Busybox, Tiny X, and Fltk. The core runs entirely in ram and boots very quickly. Also offered are Micro Core, a 6 MB image that is the console based engine of Tiny Core, and Multi Core, which includes Tiny Core, Micro Core, networking tools and an installer. Micro Core contains CLI versions of Tiny Core's programs allowing the same functionality of Tiny Core's extensions, only starting with a console based system.\nIt is not a complete desktop nor is all hardware completely supported. It represents only the core needed to boot into a very minimal X desktop typically with wired internet access.\nThe user has complete control over which applications and/or additional hardware to have supported, be it for a desktop, a netbook, an appliance, or server, selectable by the user by installing additional applications from online repositories, or easily compiling most anything you desire using tools provided.\n\nWelcome Page : http://distro.ibiblio.org/pub/linux/distributions/tinycorelinux/welcome.html\n\nThe latest version: 3.8.2\n\nTiny Core v3.8.2 minor release is now posted at http://distro.ibiblio.org/pub/linux/distributions/tinycorelinux/3.x/release/\n\nChange log:\nUpdated busybox 1.19.0: df now correct with an embed boot. ash supports reverse searches.\nUpdated init to make embed the default. Use new boot code noembed to not.\nUpdated F4 boot message screen to reflect change to noembed boot code.\nUpdated multicore:\n   New tcr boot option for ezremaster and tools.\n   New tca boot option to enable all extensions on multicore CD.\nNew zsync files posted for iso images.\n\nIf you have an older version of the same file, you can use zsync to only download changed parts, e.g.:\nzsync -i /path/to/tinycore_3.8.1.iso http://distro.ibiblio.org/tinycorelinux/3.x/release/tinycore_3.8.2.iso.zsync\nWith new default boot to base is ~ 30% faster. See bootchart. \n\nForum announcement :\n\nmd5sum : c1e51360b120a2e4d5a605903847f108  tinycore_3.8.2.iso","torrent":{"xt":"urn:btih:24b13109e8e8fd20a1ee25431da17d47bd1949f1","amp;dn":"tinycore_3.8.2.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24b13109e8e8fd20a1ee25431da17d47bd1949f1","infoHashBuffer":{"type":"Buffer","data":[36,177,49,9,232,232,253,32,161,238,37,67,29,161,125,71,189,25,73,241]},"announce":[],"urlList":[]}}