{"title":"&quot;Eyes&quot; Custom Xbox360 Theme","uid":6571347,"size":7896939,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:25a9343fbe675214ffd8b96d2bde17dcf5300fd4&amp;dn=%5C%22Eyes%5C%22+Custom+Xbox360+Theme&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shikibane","files":-1,"time":1311984563,"description":"I made this using Horizon and i thought it was cool looking so i decided to upload it. \n\nHow To Use A Guide For Noobs: \n\nFirst download USBXTAF In order to put this theme on your flash drive you need to format it to xbox360 format to do that you go to system settings on the 360 then memory then click on usb storage device if your usb is in then click configure now once thats done put your flash drive into your computer open up USBXTAF go to file then open device selector select your flash drive open it click on data partition right click make a new folder and call it Content inside Content make another folder called 0000000000000000 inside 0000000000000000 make another folder called FFFE07D1 inside that make a folder called 00030000 now right click inside 00030000 click inject select my theme then just plug the flash drive back up `to your 360 go to system settings then memory then usb device then themes and just copy the theme to your harddrive sign into your profile click on your profile go to change themes select &quot;eyes&quot; and apply it then your all set.\n\n\n\nAlternative way: You could download modio open it up drag my theme into it then click save to device this might be easier but iv'e had some problems doing it this way so i put the more complicated way to do it as that seems to work better.\n\n\n\n\n\n\nAlso if you want any of the eyes theme wallpapers there in the folder called eyes wallpapers i dont really think i needed to say that but whatever\n\nHere's a screenshot of the pictures i used in the theme http://bayimg.com/kaJklAadF","torrent":{"xt":"urn:btih:25a9343fbe675214ffd8b96d2bde17dcf5300fd4","amp;dn":"%5C%22Eyes%5C%22+Custom+Xbox360+Theme","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25a9343fbe675214ffd8b96d2bde17dcf5300fd4","infoHashBuffer":{"type":"Buffer","data":[37,169,52,63,190,103,82,20,255,216,185,109,43,222,23,220,245,48,15,212]},"announce":[],"urlList":[]}}