{"title":"Cyber Update Aug.2011-------FM-15204  Ariel X  Serena Blair","uid":6618569,"size":585980867,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:25cc6c3b582580df22fe25fbf1a4c66fe5395f03&amp;dn=Cyber+Update+Aug.2011-------FM-15204++Ariel+X++Serena+Blair&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":219,"time":1313895683,"description":"From Kink.com      (Fuckingmachines)  + Pics\n\n\n\nAriel X is THE fittest porn star with an exercise regiment that would make Navy Seals shake in there ninja boots. She's ripped, dominant and pervy as hell which makes her the absolute perfect trainer for this special feature FuckingMachines.com shoot - &quot;Fitness Sex&quot;. \n\nThe trainee, Serena Blair, is surprisingly tough. Her own training involves commanding horses with her quads as an equestrian rider, yoga, dance and cardio. Serena knows what it takes to push her mind and body, loves a challenge and has a kinky bend for pain mixed with pleasure making her a perfect match for someone as grueling as Ariel X. \n\nAriel starts Serena off with stretching and wind sprints on the hot roof top of the Armory before exploiting Serena's strength in a stress position while fucking her with The Fucksall. This is a truly epic demonstration of endurance from Serena who holds the plank pose for over FOUR minutes. Go ahead - try it - now try it with someone fucking you! It's hard but Ariel knows to break Serena is not going to take more than a tough yoga pose and a modified drill. \n\nThe final scene has sweat dripping down Serena's back and over her round ass while she struggles to fuck Ariel, squinting sweat and pain out of her eyes, battling her mind to hold on for just a little longer while Ariel climaxes. Quitting during a wind sprint is one thing, but failing during your trainer's orgasm is punishable by total domination. Will Serena fail?\n\n\n\nScreens &lt;a href=&quot; http://www.fuckingmachines.com/site/shoot.jsp?shootId=15204&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.fuckingmachines.com/site/shoot.jsp?shootId=15204&lt;/a&gt;\n\n\nCheerz  :-)","torrent":{"xt":"urn:btih:25cc6c3b582580df22fe25fbf1a4c66fe5395f03","amp;dn":"Cyber+Update+Aug.2011-------FM-15204++Ariel+X++Serena+Blair","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25cc6c3b582580df22fe25fbf1a4c66fe5395f03","infoHashBuffer":{"type":"Buffer","data":[37,204,108,59,88,37,128,223,34,254,37,251,241,164,198,111,229,57,95,3]},"announce":[],"urlList":[]}}