{"title":"Andhrawala 2004 telugu movie eng subs","uid":6870966,"size":748896368,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:26175f731c8b69b0b08bc9b2cc3b5215f9be0753&amp;dn=Andhrawala+2004+telugu+movie+eng+subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kostas1972","files":3,"time":1323273833,"description":"Shankar Pehalvan (Jr. NTR), is the leader of labor from Andhra in Mumbai. Shankar fights with the mafia don Bade Mia (Sayaji Shinde) and in the process Andhrawala also becomes a don. In the ensuing mafia feud, Bade Mia kills Shankar and his wife (Sanghavi). Basha (Benarjee) - a trusted lieutenant of Sankar - takes away the kid to rescue him from Bade Mia. When mafia goons follow him, Basha leaves the kid on a footpath besides a beggar and leaves. The boy, Munna (Jr. NTR), is raised in a slum area. While Basha is in search of Munna to safeguard him, Bade Mia is in search of him to avenge the death of his son in the hands of Shankar. Thanks to the similarities in appearance of father and son, Basha and Bade Mia recognize that Munna is son of Sankar. Munna gets to know his identity and the story of his father and his death from Basha. In the meanwhile, Bade Mia men descend to Hyderabad to kill Munna. Munna decides to take the battle to Bade Mia and goes to Mumbai to confront with Bade Mia face to face. The rest of the story is all about how Munna succeeds in killing his family\\\\\\'s murderers.","torrent":{"xt":"urn:btih:26175f731c8b69b0b08bc9b2cc3b5215f9be0753","amp;dn":"Andhrawala+2004+telugu+movie+eng+subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26175f731c8b69b0b08bc9b2cc3b5215f9be0753","infoHashBuffer":{"type":"Buffer","data":[38,23,95,115,28,139,105,176,176,139,201,178,204,59,82,21,249,190,7,83]},"announce":[],"urlList":[]}}