{"title":"Tamas Wells...A Mark on the Pane(2004)[FLAC]","uid":6511486,"size":281121067,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:27a16cdba9653ab09ab01551f1a15e2687437cc7&amp;dn=Tamas+Wells...A+Mark+on+the+Pane%282004%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"dickspic","files":21,"time":1309641511,"description":"\n\n A Mark on the Pane [2004]Popboomerang Records / PB 009\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1. When We Do Fail Abigail (2:53)\n 2. Broken by the Rise (3:57)\n 3. Chandeliers (3:38)\n 4. Reduced to Clear (3:35)\n 5. Petit mal at a Grand Occasion (1:43)\n 6. Even in the Crowds (3:08)\n 7. Annalee Argyle (3:21)\n 8. Segue in Gm (1:16)\n 9. If You Bring Me Aubergines (3:12)\n 10. A Dark Horse Will Either Run First or Last (6:12)\n 11. Reduced to Clear (ep version) (4:23)\n 12. 41 Union Drive, Caroline Springs (2:07)\n 13. Even Through (2:05)\n 14. Beauty Cream (2:46)\n 15. Stitch in Time (2:23)\n 16. (instrumental) (3:12)\n\nYou won't necessarily want to rush out and tell all your friends about A Mark on the Pane, at least not right away. Upon encountering its simplicity and intimacy, you'll want to keep it to yourself for a little while and get to know its songs inside and out, basking in their gorgeous, temperate glow. For a first album, Melbourne-based Wells and his band are already masterful at establishing an identifiable, welcoming tone and sustaining it. They don't work within a widescreen scope --hushed, delicately mournful acoustic pop is what they do -- but it's an immediate, concentrated one that occasionally beams like Technicolor.\n\n\n Somber and plain-spoken, Wells summons unavoidable Elliott Smith comparisons, but I kept thinking more of a young Paul Simon at his most restrained and choirboy-like. Either way, the man has a terrific voice. He works skillfully in tandem with the album's muted instrumental palette of acoustic guitars and pianos, low-humming organs and harmonium, and occasional glockenspiel. He excels at sounding sad and sweet without seeming morose, and that makes the difference between an album weighted down by self-pity and one that resonates sympathetically.\n\n\n In lesser hands, Wells's subject matter could make for ineffably depressing songs. &quot;Chandeliers&quot; and &quot;Reduced to Clear&quot; both reference once-owned belongings given away and left to collect dust in garage sales and pawn shops. &quot;Even In the Crowds&quot; argues in favor of examining and understanding a failed relationship rather than ignoring its implications. However, on &quot;When We Do Fail Abigail&quot;, Wells acknowledges to his loved one how fragile such a relationship can be over time, while advising her not to wallow in despair about it. What this music ultimately stresses is a balance of optimism and realism. Little touches, like a chiming guitar or piano hook or lush, comforting harmonies, give songs like &quot;Broken By the Rise&quot; and the eloquent, wistful &quot;Even In the Crowds&quot; a gentle uplift that's crucial to their charm. And when Wells attempts a genuinely optimistic love song with &quot;If You Bring Me Aubergines&quot;, you really feel its impact.\n\n\n Three instrumentals flesh out the album to varying degrees of success. &quot;Petit Mal at a Grand Occasion&quot; holds on to the previous song's last note and lets it reverberate like waves lapping towards a shore. The brief &quot;Segue in GM&quot; shimmers along nicely, but the six-minute &quot;A Dark Horse Will Either Run First or Last&quot; might have been more effective with some editing; concluding a 32-minute album, it leaves you wanting a few more songs with vocals. However, A Mark on the Pane still emanates enough awe, beauty and substance to leave a lasting imprint.\n\nthank you inasafeplace\n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2011/06/09/tamas-wells/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2011/06/09/tamas-wells/&lt;/a&gt;","torrent":{"xt":"urn:btih:27a16cdba9653ab09ab01551f1a15e2687437cc7","amp;dn":"Tamas+Wells...A+Mark+on+the+Pane%282004%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27a16cdba9653ab09ab01551f1a15e2687437cc7","infoHashBuffer":{"type":"Buffer","data":[39,161,108,219,169,101,58,176,154,176,21,81,241,161,94,38,135,67,124,199]},"announce":[],"urlList":[]}}