{"title":"Real Madrid Vs Fc Barcelona. 2nd Half","uid":6605077,"size":3807410204,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:27c30a26e24998ad001e5eab15d8504982a76fc6&amp;dn=Real+Madrid+Vs+Fc+Barcelona.+2nd+Half&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Shepard76","files":-1,"time":1313366572,"description":"FC Barcelona make their official debut this season in the Santiago Bernabeu in a classic to get the Spanish Super Cup underway (22.00, TVE and R @ dio BarÃƒÂ§a). The whole squad has travelled to Madrid.\n\nIt\\\\\\'s been 103 days since the last classic, the one where FC Barcelona qualified for the Champions League final at Wembley. The result then was a 1-1 draw at the Camp Nou, that put an end to the 4 game marathon between Madrid and Barcelona, games that were almost consecutive. Tonight will be another story. Both teams open the season with a match which will show the sort of form they are both in half way through August. It's the Super Cup, and a Supermatch.\n\nMore unknowns with BarÃƒÂ§a\n\nThe game comes at a moment quite different from the series earlier this year. Then, it was the end of the season, and now it's just the beginning. The two managers have approached the match in different ways. Mourinho can count on players who've had a longer preseason, and played many more minutes.\n\nGuardiola, on the other hand, opted to extend the holiday periods of his players. Those who took part in the Copa America came back a week later than the Madrid players, so there are more unknowns in the BarÃƒÂ§a camp ahead of the match at the Bernabeu. Mascherano, Messi, Alves, and Alexis, for example, haven't played a game so far this preseason. Guardiola has taken the whole squad to Madrid, including the injured players.\n\nAlmost certain Madrid starting 11\n\nEverything points to the fact that the Madrid starting line-up is already decided. Only Coentrao, Madrid's most expensive summer signing, might sneak into the starting 11 at Di Maria's expense. The most likely outcome is that Mourinho will line up with 11 players who were already in the squad last season. What won't change is Madrid's approach to the game, who'll seek a more physical match than technical, to try to beat BarÃƒÂ§a.\n\nAll time record in play\n\nThis edition of the Super Cup includes an interesting battle in Super Cup history. BarÃƒÂ§a are currently the kings of the competition, with 9 titles. They are followed by Real Madrid, who have 1 trophy less, and who will try to equal BarÃƒÂ§as titles. For Guardiola, the challenge is to break the statistic that tells us that BarÃƒÂ§a has lost the 4 Super Cups played against Real Madrid. Two Supermatches will decide all. The first one, tonight.\n\nInformation extracted from F.C Barcelona official web page. Author of this text : Roger Bogunya\t\t","torrent":{"xt":"urn:btih:27c30a26e24998ad001e5eab15d8504982a76fc6","amp;dn":"Real+Madrid+Vs+Fc+Barcelona.+2nd+Half","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27c30a26e24998ad001e5eab15d8504982a76fc6","infoHashBuffer":{"type":"Buffer","data":[39,195,10,38,226,73,152,173,0,30,94,171,21,216,80,73,130,167,111,198]},"announce":[],"urlList":[]}}