{"title":"Democracy Now - 01 aug 2011","uid":6576455,"size":459364378,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:29028240f63e62749d133995d9ac689801e818cc&amp;dn=Democracy+Now+-+01+aug+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1312216616,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Aug 01, 2011\n\n- Obama, Lawmakers Reach Debt Deal\n- Debt Agreement Excludes Taxes, Revenue Boost\n- Pelosi: House Dems May Not Support Debt Deal\n- Black Caucus, Progressives Reject Debt Agreement\n- Relief Operations Continue in Famine-Stricken Horn of Africa\n- NATO Accused of Killing 3 in Bombing of Libyan TV Network\n- 142 Killed in Syria Crackdown\n- Verdict Reportedly Near for Jailed U.S. Hikers in Iran\n- James Murdoch Expected to Face New Hearing\n- Thousands Rally for Public Education in DC\n\n\nSpecial reports\n\n- Billy Bragg: Legendary British Rocker On Norway Attacks, Activism &amp; His Latest, &quot;Don't Buy The Sun&quot;\n\nWe spend the hour with legendary British rocker and activist, Billy Bragg. His music career began in the late 1970s in London when he formed the punk rock band, Riff Raff. His 1984 album, &quot;Brewing Up With Billy Bragg,&quot; included the song, &quot;It Says Here,&quot; a critique of politics and tabloid newspapers that still rings true today in the wake of the News of the World phone-hacking scandal. In 1998 and 2000, he participated in two well-known albums - Mermaid Avenue, Volumes 1 and 2 - that gave voice to another folk troubadour who sang about the poor and working class: Woody Guthrie. Bragg composed music for lyrics written by Guthrie, and performed many of the songs, alongside the album's other main contributor, Wilco. But to speak of Bragg simply as a singer-songwriter misses his passion for speaking out against injustice, and fighting for many causes. In the 1980s, he called for support for the 1984 strike by the National Union of Mineworkers, one of the most significant chapters in Britain's trade union history. It was ultimately defeated under the watch of then Prime Minister Margaret Thatcher and Bragg went on to organize for the defeat of Thatcher and her Conservative government. He is on tour now in the United States, and joins us for an extended interview and performance. He reflects on his long history of activism and the attacks in Norway, and sings several songs, including his latest, &quot;Don't Buy the Sun,&quot; about the phone hacking scandal engulfing the Rupert Murdoch media empire.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:29028240f63e62749d133995d9ac689801e818cc","amp;dn":"Democracy+Now+-+01+aug+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29028240f63e62749d133995d9ac689801e818cc","infoHashBuffer":{"type":"Buffer","data":[41,2,130,64,246,62,98,116,157,19,57,149,217,172,104,152,1,232,24,204]},"announce":[],"urlList":[]}}