{"title":"Bridge to Iran: We Are Half of Iran's Population-LinkTV","uid":6614085,"size":378205334,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2b5365db67042af1da08c9bb3e7ab0e152c4e69c&amp;dn=Bridge+to+Iran%3A+We+Are+Half+of+Iran%5C%27s+Population-LinkTV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"padme99","files":1,"time":1313712096,"description":"Bridge to Iran: We Are Half of Iran's Population\n\nsdtv xvid 700kbps 4x3\n\n\n\nCategory: Documentaries\n\nRegions: Middle East, Asia\n\nTopics: Political Institutions / Systems, Human Rights, Women / Gender / Sexuality\n\nThree months before Iran's presidential elections Iranian women's rights activists, consisting of a vast spectrum of different points of view from religious to secular and ordinary women, are filmed posing their questions to the ten  candidates and three of them discuss their opinions after watching the film. Mahmoud Ahmadinejad, however, is not willing to take part in the film or to respond. By the time the film is finished, three individuals who have taken part in the film are thrown in prison, falling victim to the massive post-election detentions. This film sheds light on the reality of the situation of Iran.\n\n \n\nSupport for Link TV's presentation of this film is generously provided by:\n\n\n\n\nParsa Community Foundation\n\n \n\nAbout Bridge to Iran\n\n\n\n\nBridge to Iran is a unique new series on Link TV that showcases documentary films by contemporary independent Iranian filmmakers who live and work in Iran. This nationally-broadcast series will provide a fresh view of what ordinary Iranians are concerned about and the issues they grapple with. The series covers a wide-ranging scope of subjects: first-hand accounts by young girls facing womanhood within an Islamic society; religious pilgrims who risk their lives to visit a holy site in war-torn Iraq; rural life and political awareness; and an energetic and surprising exploration of Tehran as a mega metropolis.\n\n\n\nThis is the first time an American television channel has presented a series of documentary films about Iran by Iranian filmmakers.  The result is a shattering of our preconceived ideas about a nation and culture that most Americans have little or no real knowledge or experience of. Each documentary in the series will be introduced by Salome Azizi, the Bridge to Iran series host, with comments from each filmmaker, who will provide additional context and background.\n\n\t","torrent":{"xt":"urn:btih:2b5365db67042af1da08c9bb3e7ab0e152c4e69c","amp;dn":"Bridge+to+Iran%3A+We+Are+Half+of+Iran%5C%27s+Population-LinkTV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b5365db67042af1da08c9bb3e7ab0e152c4e69c","infoHashBuffer":{"type":"Buffer","data":[43,83,101,219,103,4,42,241,218,8,201,187,62,122,176,225,82,196,230,156]},"announce":[],"urlList":[]}}