{"title":"Gone With The Wind (4 Disc Collector's Edition Box Set) [1939]","uid":6569537,"size":26010845184,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2ce79828fbfe981213edd93d0496b481dee42ae6&amp;dn=Gone+With+The+Wind+%284+Disc+Collector%5C%27s+Edition+Box+Set%29+%5B1939%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hoofdkussen","files":-1,"time":1311879578,"description":"www. Norskbits .com - Last ned Filmer, TV-serier, Spill, Program og Musikk http://www.norskbits.com\n\nCheck :: http://www.norskbits.com :: for more of my torrents!\n\n\nActors: Clark Gable, Vivien Leigh, Olivia de Havilland, Leslie Howard, Hattie McDaniel\nDirectors: Victor Fleming\nFormat: Box set, PAL, Special Edition, Subtitled\nLanguage English, Dutch\nRegion: Region 2 (This DVD may not be viewable outside Europe. Read more about DVD formats.)\nNumber of discs: 4\nClassification: PG\nStudio: Whv\nDVD Release Date: 7 Feb 2005\nAverage Customer Review: 4.6 out of 5 stars  See all reviews (69 customer reviews)\nASIN: B0006GVK20\nAmazon Bestsellers Rank: 23,153 in Film &amp; TV (See Top 100 in Film &amp; TV)\n Would you like to update product info, give feedback on images, or tell us about a lower price?\n\nAmazon.co.uk Review\nFirst off, if you're a GwtW fanatic, you must buy this four-disc collection. But then again, you probably don't need to read this to make that decision. For the rest of us, know that the kitchen-sink approach has been established here with two full discs of extras. The film's restoration under Warner's brilliant Ultra-Resolution process is the major contribution to the set. However, the bare-bones version released years ago isn't bad and the film still doesn't pop off the screen as do films from the headier days of Technicolor (like the earlier Ultra-Resolution DVD release of Meet Me in St. Louis). That said, the set is worthy of the most popular movie ever made. Rudy Behlmer's feature-length commentary is dry but an exhaustive reference guide to the entire history of the film. Need more? There's the excellent full-length documentary The Making of a Legend (1989) narrated by Christopher Plummer, plus two hour-long older biographies on the two main stars. There are many new vignettes on the rest of the cast, all narrated by Plummer (a nice touch to tie everything together). The new 30-minute interview/reminisce with Oliva de Havilland will be interesting to older fans, but tiresome for the younger set. The usual sort of trailers and premiere footage is here along with a curious short (&quot;The Old South&quot;, directed by Fred Zinnemann) that was produced to help introduce the world to the history of the South. --Doug Thomas\n\n\n\nwww. Norskbits .com - Last ned Filmer, TV-serier, Spill, Program og Musikk http://www.norskbits.com\n\nCheck :: http://www.norskbits.com :: for more of my torrents!","torrent":{"xt":"urn:btih:2ce79828fbfe981213edd93d0496b481dee42ae6","amp;dn":"Gone+With+The+Wind+%284+Disc+Collector%5C%27s+Edition+Box+Set%29+%5B1939%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ce79828fbfe981213edd93d0496b481dee42ae6","infoHashBuffer":{"type":"Buffer","data":[44,231,152,40,251,254,152,18,19,237,217,61,4,150,180,129,222,228,42,230]},"announce":[],"urlList":[]}}