{"title":"Suzi Quatro - In the Spotlight","uid":6632671,"size":80112549,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2e4eb46546d8a47708511a6a5ecb7e399e845f00&amp;dn=Suzi+Quatro+-+In+the+Spotlight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"speedthunder","files":13,"time":1314431247,"description":"[img]http://www3.hmv.co.uk/hmv/Large_Images/HMV/CDBRED511.JPG[/img]\n\nWith Joan Jett witnessing something of a revival thanks to the recent Runaways biopic, the original leather-jumpsuit-wearing rock icon Suzi Quatro returns to prove that nearly 40 years on from her self-titled debut, she can still pack a few punches herself. Co-written with previous collaborator Mike Chapman (Blondie, Mud), In the Spotlight, her first album since 2006's Back to the Drive, shows that unlike many of her counterparts, the contemporary pop scene hasn't completely passed her by. There's a raucous cover version of Rihanna's Good-Girl-Gone-Bad album track &quot;Breakin' Dishes,&quot; which turns the R&amp;B anthem into an equally feisty slice of barroom rock; a guitar-chugging mash-up of Goldfrapp's electro-pop reinvention in &quot;Strict Machine&quot;; her own 1973 U.K. chart-topper &quot;Can the Can,&quot; cleverly referencing the subtle similarities between the two; the Hole-esque grunge of &quot;Whatever Love Is,&quot; a a sly nod to her riot grrrl pioneer reputation, and the yelping, dirty, garage blues-rock of &quot;Hot Kiss,&quot; which could have been lifted from the first few White Stripes records. As convincing as these attempts to show she's not stuck in some '70s time-warp are, it's the tracks which hark back to her heyday which are likely to leave her former glam rock army swooning. Acknowledging the influence Elvis had on her career, &quot;Hard Headed Woman&quot; is an old-fashioned rockabilly rendition of his 1958 standard, while &quot;Singing with Angels&quot; is a heartfelt tribute to the King featuring his guitarist James Burton and backing vocalists, the Jordanaires, but elsewhere, opener &quot;A Girl Like Me&quot; sets the tone with its ballsy attitude and anthemic Knack-inspired guitar hooks, &quot;Turn Into&quot; features shades of classic girl group doowop with its Spector-ish Wall of Sound production, and the title track is a spacy, T. Rex-esque acoustic-driven ballad which reveals Quatro has lost none of her whiskey-soaked lung power. A misguided attempt at cod-reggae aside (&quot;Hurt with You&quot;), In the Spotlight is an impressive comeback, which admirably doesn't rely solely on nostalgia to make itself heard. Ã‚Â¯ Jon O'Brie\n\n[img]http://i896.photobucket.com/albums/ac169/pbf99/tr.gif[/img]\n\n    *   1. A Girl Like Me\n    * 2. Whatever Love Is\n    * 3. In The Spotlight\n    * 4. Strict Machine\n    * 5. Breaking Dishes\n    * 6. Rosie Rose\n    * 7. Hurt With You\n    * 8. Hot Kiss\n    * 9. Turn Into\n    * 10. Hard Headed Woman\n    * 11. Singing With Angels [Bonus Track]\n\n[img]http://i896.photobucket.com/albums/ac169/pbf99/ENJOY.gif[/img]\n","torrent":{"xt":"urn:btih:2e4eb46546d8a47708511a6a5ecb7e399e845f00","amp;dn":"Suzi+Quatro+-+In+the+Spotlight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e4eb46546d8a47708511a6a5ecb7e399e845f00","infoHashBuffer":{"type":"Buffer","data":[46,78,180,101,70,216,164,119,8,81,26,106,94,203,126,57,158,132,95,0]},"announce":[],"urlList":[]}}