{"title":"SPY KIDS 4 RMVB cam GLOBE","uid":6630780,"size":225882487,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2e9c7a3925366649eb2b229a8ae059935dd3226d&amp;dn=SPY+KIDS+4+RMVB+cam+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1314359912,"description":"* RMVB CAM * 01H 21M 51S * Cam quality improved and converted to RMVB\n\n\n\n* Plot : \n\nThe film revolves around twins named Rebecca and Cecil (Rowan Blanchard and Mason Cook). Rebecca has no respect for her stepmom, Marissa (Jessica Alba), the wife of spy-hunting reporter Wilbur Wilson (Joel McHale). Unbeknownst to the twins, Marissa is a retired agent for the OSS (Organization of Super Spies) which has since become the world\\'s top spy agency and former HQ of the now-defunct Spy Kids division.\n \nWhen Earth is threatened by an organization led by a hyperion mastermind known as \\&quot;the Timekeeper\\&quot; (Jeremy Piven), Marissa is contacted and called back into action by the OSS, leaving a red-sapphire necklace (the key to the Timekeeper\\'s plan) with Rebecca.\n \nHowever, with the end of the world pending and the necklace stolen by the Timekeeper, both Rebecca and Cecil find that they have no choice but take part in the battle, help Marissa, and Rebecca having to put her anger against Marissa aside to rescue people\\'s lives that are at stake while enlisting the help of the previous Spy Kids Carmen and Juni Cortez (Alexa Vega and Daryl Sabara).They stop the Timekeeper who turned out to be the director of the OSS, Danger D\\'amo. Rebecca tells Marissa that she and Cecil are her kids and Wilbur Handcuffs Tick Tock.\n\n\n\n* enjoy ...\n\n\n\n\n\n\n* GLOBE FILES 2011 \n\n","torrent":{"xt":"urn:btih:2e9c7a3925366649eb2b229a8ae059935dd3226d","amp;dn":"SPY+KIDS+4+RMVB+cam+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e9c7a3925366649eb2b229a8ae059935dd3226d","infoHashBuffer":{"type":"Buffer","data":[46,156,122,57,37,54,102,73,235,43,34,154,138,224,89,147,93,211,34,109]},"announce":[],"urlList":[]}}