{"title":"Halloween H20 Television Cut","uid":6525077,"size":4473475388,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2ea98fdd20f16260941b793beed8b37cfe3ca5ee&amp;dn=Halloween+H20+Television+Cut&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"preserv.co.cc","files":20,"time":1310131725,"description":"[img]http://i129.photobucket.com/albums/p203/ThrowgnCpr/covers/HalloweenTVcut_3D.jpg[/img]\n\n---------------------------------------------------------------------------------\nDisc Specifications: -----------------------------------------------------\n---------------------------------------------------------------------------------\n\nFormat.............: NTSC DVD5\nAspect.............: 4:3 fullscreen\nAudio...............: Dolby 2.0 Stereo\nLanguage..........: English only\nSubtitles...........: none\nVideo Bitrate......: 6100 kbps\nAudio Bitrate......: 256 kbps\nCapper..............: ThrowgnCpr\nDVD Authoring....: ThrowgnCpr\n\n\n---------------------------------------------------------------------------------\nFeature Details: ----------------------------------------------------------\n---------------------------------------------------------------------------------\n\nOn the FX Network Television cut, there are several additional scenes added for running time, and a lot has been edited.  Most edits are for censorship purposes, to make it appropriate for cable television in the USA.  The inclusion of some deleted scenes are unique to this cut and have not been seen elsewhere.  For a full list of changes, visit:\n\n  &lt;a href=&quot; http://www.imdb.com/title/tt0120694/alternateversions&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0120694/alternateversions&lt;/a&gt;\n\nThe only other preservation of this cut has been a transfer of a VHS recording.  Like many VHS transfers, the colors were affected and the picture had a &quot;milky&quot; appearance.  The newly added footage was even worse because it was not mastered the same as the DVD of film.  While this edition still has its faults, it can probably be seen as an upgrade from previous &quot;bootleg&quot; copies.  \n\nLineage for this transfer is: SD analog cable -&gt; ATI capture card to lossless AVI -&gt; DVD.  \nVideo capture, editing and DVD authoring by ThrowgnCpr.\n\nBecause this was an analog capture, there are some artifacts present in the recording.  There are a couple instances where the cable signal gets weak, and a couple where the signal completely gets lost for a few frames.  Though, until either a true HD capture, or an official release becomes available, this may represent the best source to date.\n\nWhile much of the quality results from the analog SD capture, there are other video quality issues that are almost certainly present in the source material.  First, there is obvious edge-enhancement that is very noticeable at times.  Also, the newly reintegrated deleted scenes stick out from the theatrical film material.  The color and overal quality is quite different, and it appears that they were not mastered the same way.  No attempt was made to enhance the footage or color correct, because it would likely introduce more noise into the picture.  The only modifications I made to the capture are as follows:\n\nvery slight modification to levels\ndeinterlace\nremoval of commercials\nmatted out warnings and tv logos over Dimension Films logo intro\nfix end credits (see notes below)\n\nDuring the end credits, the credits get squished to half the screen, and an advertisement fills the other half.  The audio is overtaken by the advertisement.  As you know this is common for most movies and shows on American TV.  I have replaced the audio with the original score.  I did my best to remix it the \nsame as it is in the TV cut (it is a bit different than the theatrical).  Its not perfect, but its better than the TV advertisement.  I also removed the video portion of the advertisement and stretched the credits back to fill the rest of the screen.  During the stretch back, you can see a slight jutter for half a second, and the credits look a bit more blurred because I had to double the vertical resolution.  Still I wanted to keep them preserved (as opposed to replacing with the DVD edition credits) because it plays differently than the DVD.\n\nSo, before you bitch about the quality of this DVD (I am speaking to all of you who only claim to watch things in HD and 5.1 surround sound), remember that this is basically the only way you are going to get this cut.  I would love to see a better copy to, but until that time, this is what we have...\n\n\n\n\nscreenshots of the capture have been posted earlier, so I wont post them again, but here are some screens from the menus.  Main menu and chapter menus are animated.\n\n[img]http://i129.photobucket.com/albums/p203/ThrowgnCpr/HallH20TVcutmenus.png[/img]","torrent":{"xt":"urn:btih:2ea98fdd20f16260941b793beed8b37cfe3ca5ee","amp;dn":"Halloween+H20+Television+Cut","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ea98fdd20f16260941b793beed8b37cfe3ca5ee","infoHashBuffer":{"type":"Buffer","data":[46,169,143,221,32,241,98,96,148,27,121,59,238,216,179,124,254,60,165,238]},"announce":[],"urlList":[]}}