{"title":"Hardcore TV Complete HBO Series","uid":7010688,"size":17725789398,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2ecb6d070bf234d0607a7a591819ee7f35fbdb92&amp;dn=Hardcore+TV+Complete+HBO+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"x30001wtm","files":-1,"time":1328443176,"description":".\n.\n................................................................\n\nIf you get up off your butt and rotate your antenna...\n\nIf your cable is screwed up...\n\nAnd if the air is full of electricity...\n\nThen somewhere, between channels 36 and 37, you'll come upon a\nTV universe turned inside out.  The tour's leaving now, so\ngrease yourself up, strap yourself in, hide all pets, take\nsmall bites, use a number 2 pencil, ignore the squishy sounds,\nbreathe through your mouth, and have your tickets ready...\n\nYou've entered the world of HARDCORE TV!\n\n................................................................\n.\n\nRemember Fairytales From The Darkside?  Cindy's Sex Talk? \nRastapiece Theater?  How about Fly Fishing Jam, This Old Whore\nHouse, or The Sports Lady?  Well here they are again after\ntwenty years!  These eleven episodes are all that ever aired as\nfar as I can tell from everyone I've ever talked to about it and\nfrom reading all the threads at the IMDB.  HBO ran them one\nsingle time and never aired them or even mentioned them again.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0364813/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0364813/&lt;/a&gt;\n\nWhy four whole DVDs for a mere 11 half hour episodes?  I talked\nto a guy that knows the guy that made this set and he said it's\nbecause the quality wasn't strong from the beginning so he\nrecorded them at 1 hour mode and only got 3 episodes per disk\nrather than overcompress them.  The quality is quite watchable\nas far as I'm concerned but it's not perfect.  There's a sample\nin the torrent so you can check for yourself.  Maybe better\ntapes will surface someday but meantime, this set should tide\nyou over nicely, especially if you're craving a dose of Raging\nBullwinkle after all these years.\n\nEach disk has a nicely authored menu system including a scene\nselection submenu for each episode.  This torrent even includes\na detailed episode guide in a text file.  Cheers to everyone\nthat contributed to making this set possible!  And now...\n\nYou'll laugh... You'll cry... You'll grab your balls and spit!\n\n\nx30001 out.\n.\n.","torrent":{"xt":"urn:btih:2ecb6d070bf234d0607a7a591819ee7f35fbdb92","amp;dn":"Hardcore+TV+Complete+HBO+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ecb6d070bf234d0607a7a591819ee7f35fbdb92","infoHashBuffer":{"type":"Buffer","data":[46,203,109,7,11,242,52,208,96,122,122,89,24,25,238,127,53,251,219,146]},"announce":[],"urlList":[]}}