{"title":"iOS 5 Beta 6 Jailbroken Firmwares + Tutorial (No UDID Requiremen","uid":6620554,"size":8011248903,"categoryP":"applications","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:2f070e5b6104a71e96e8dd9389635dbb2f5e663e&amp;dn=iOS+5+Beta+6+Jailbroken+Firmwares+%2B+Tutorial+%28No+UDID+Requiremen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SoulUploader","files":106,"time":1313972664,"description":"Make sure to read through this all so you're sure what you need:\n\nTo clear it up first before you read anything else: You don't need a registered UDID to install these firmwares, the string which signals that the firmware is in beta has been removed.\n\nAlright, now we got that out of the way; this is the latest iOS 5 beta which came out yesterday and each of these firmwares are jailbroken (tethered) via the limera1n exploit. No iPad2 for that reason. \n\nThe iPhone 3GS Old Bootrom is untethered, meaning that you don't have to follow the redsn0w section of the video, you just restore to the firmware. Old Bootrom 3GS = the 4th and 5th digits of the serial number are less than or equal to 40. For example, a serial number MB5381024 would be older bootrom, due the 4th and 5th digits being the number 38. However, we've completed a cycle now so you may get a number like 03 if your device was purchased recently, meaning you have a new bootrom. If in doubt, contact me about it. \n\nHacktivation is supported on each device that uses it, and baseband preservation is included in ALL firmwares. Hacktivation is for people who need an unlock or don't have a SIM card to activate their device. \n\nUse iBooty to boot tethered. Watch the video link if you need any further help.\n\nRemember to seed please","torrent":{"xt":"urn:btih:2f070e5b6104a71e96e8dd9389635dbb2f5e663e","amp;dn":"iOS+5+Beta+6+Jailbroken+Firmwares+%2B+Tutorial+%28No+UDID+Requiremen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f070e5b6104a71e96e8dd9389635dbb2f5e663e","infoHashBuffer":{"type":"Buffer","data":[47,7,14,91,97,4,167,30,150,232,221,147,137,99,93,187,47,94,102,62]},"announce":[],"urlList":[]}}