{"title":"tango2.iso","uid":6607066,"size":1076586496,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:30814b6412971f50fd72af5a437b1f2ec342b975&amp;dn=tango2.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cestpasgagne2","files":1,"time":1313442161,"description":"Esta vez ha sido basada en Debian squeeze, asi, el objetivo de la distribucion es contar con la compatibilidad y estabilidad de Debian, pero con una utilizacion e instalacion mas simple y amigable para todo tipo de usuarios. Esta nueva version de Tango incluye muchas correcciones de errores que habia en la primera version, actualizacion a versiones mas recientes de los programas y paquetes, por ejemplo, ahora incorpora HAL, que permite una mayor probabilidad de autodeteccion de dispositivos conectados a la PC (claro que ciertos componentes, como las placas de video, precisan de la instalacion y configuracion de su correspondiente driver).\nAdemas:\n incorporÃƒÂ© ciertos drivers que facilitan la conexion a redes WiFi para gran parte de las placas de red\nFirestarter, firewall muy util y facil de configurar\nnueva version de la suite OpenOffice\nnueva version de emesene, tambiÃƒÂ©n se incluye Pidgin y empathy, en cuanto a VoIP esta Ekiga, que ya venia por defecto con Gnome\nFirefox 3.6, aunque si para la fecha en que bajan la distro ya salio uno nuevo, pueden actualizarlo perfectamente desde el menu Ayuda/Buscar actualizaciones\nun cliente de Bittorrent (Deluge)\nMplayer con Gnome mplayer (es una interfaz que facilita el uso de mplayer para iniciaticos), tambiÃƒÂ©n estan Totem y Rhythmbox\nGIMP\n Cups, para poder configurar impresoras (se incluyen muchos PPD para detectar automaticamente la impresora conectada, aunque algunas necesitan configuraciones particulares)\nCompiz, desactivado por defecto, si deseas habilitarlo previamente debes instalar y configurar el driver correspondiente a tu placa grafica\nWine, para correr e instalar algunos programas de Windows en linux\ny muchos paquetes mas que ayudan al buen funcionamiento interno del sistema operativo, sobre todo en puntos que veia deficientes en la primera version\nproblemas pueden surgir como con cualquier sistema operativo, pueden comentarlos en el foro. Recuerden que al estar basada en Debian, y al haber gran soporte en la red para Debian, pueden aplicar las soluciones que aparecen para esa distro en problemas en Tango, o si las dudas son con un programa en particular, buscar en la web del autor.\nAsimismo pueden instalar paquetes .deb, y cabe mencionar que, como en la primera version, se puede utilizar la distribucion en el modo Live, esto es, utilizarla desde el DVD o pendrive sin necesidad de afectar al disco duro de la PC ni provocar cambio alguno. Es una buena opcion para probar la distro, instalar y desinstalar programas y paquetes, etc sin correr riesgos.\nLa instalacion ahora se hace desde el modo live, ejecutando en una consola de root el comando 'tangoinstalar' y corre un asistente basado principalmente en un script de Remastersys (utilidad para Ubuntu) que modifiquÃƒÂ© para adaptarlo a esta distro.\n\nNOTA: La distro incluye el plugin de Flash, que no es libre, unrar (para abrir archivos .rar), y parte de los drivers para soportar placas de red wifi, que tampoco lo son; estas cosas se incluyeron por una mejor comodidad y facilidad de uso de la distro sin tener que realizar tantas instalaciones de paquetes en un primer momento. En lo personal yo creo que el software de codigo abierto y el software de codigo cerrado pueden complementarse, ninguno debe morir a manos del otro (como dije, es una opinion personal), pero siempre es el usuario es el que debe decidirse por una u otra alternativa, por eso aclaro lo de estos drivers, el plugin y unrar, y si desean 'liberar' Tango lo pueden hacer ejecutando el siguiente comando: '  liberartango  '\n (se desinstalaran estos componentes nolibres y se perdera la funcionalidad que proveian, para subsanar esto pueden instalar una alternativa libre de su agrado).\n\nAcerca de TANGO GNU/LINUX\nAviso: Antes que nada, aclaro que la distribucion no es 100% libre ya que incluye ciertos archivos privativos (como el plugin de Flash), esto lo hice para facilitar el uso de novatos principalmente (sobre todo en el modo live), que suelen no estar familiarizados con las formas de instalacion de plugins y demas en linux. Sin embargo, si desean 'liberar' la distribucion de este software privativo e instalar su alternativa libre (opcion recomendada) ejecuten el comando que veran en este post del foro. \n...\nAbout page : http://tangolinux.com.ar/index.php?ver=about\n\nForum announcement : http://tangolinux.com.ar/foro/index.php?PHPSESSID=a7659caf6e6f73d564e12b441b668497&amp;topic=18.0\nHome Page : http://tangolinux.com.ar/","torrent":{"xt":"urn:btih:30814b6412971f50fd72af5a437b1f2ec342b975","amp;dn":"tango2.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30814b6412971f50fd72af5a437b1f2ec342b975","infoHashBuffer":{"type":"Buffer","data":[48,129,75,100,18,151,31,80,253,114,175,90,67,123,31,46,195,66,185,117]},"announce":[],"urlList":[]}}