{"title":"Confucianism: An Introduction","uid":6656574,"size":3607221,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:30c112d3304bd070973fdd1c46af59cdf7829738&amp;dn=Confucianism%3A+An+Introduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bookzilla","files":1,"time":1315341233,"description":"It is arguably Confucianism, not Communism, which lies at the core of China's deepest sense of self. Although reviled by Chinese intellectuals of the 1950s-1990s, who spoke of it as &quot;yellow silt clotting the arteries of the country,&quot; Confucianism has defied eradication, remaining a fundamental part of the nation's soul for 2500 years. And now, as China assumes greater ascendancy on the world economic stage, it is making a strong comeback as a pragmatic philosophy of personal as well as corporate transformation, popular in both home and boardroom. What is this complex system of ideology that stems from the teachings of a remarkable man called Confucius (Kongzi), who lived in the distant sixth century BCE? Though he left no writings of his own, the oral teachings recorded by the founder's disciples in the Analects left a profound mark on later Chinese politics and governance. They outline a system of social cohesiveness dependent upon personal virtue and self-control. For Confucius, society's harmony relied upon the appropriate behaviour of each individual within the social hierarchy; and its emphasis on practical ethics has led many to think of Confucianism as a secular philosophy rather than a religion. In this new, comprehensive introduction, Ronnie Littlejohn argues rather that Confucianism is profoundly spiritual, and must be treated as such. He offers full coverage of the tradition's sometimes neglected metaphysics, as well as its varied manifestations in education, art, literature and culture.\n \nIB Taurus\n2011","torrent":{"xt":"urn:btih:30c112d3304bd070973fdd1c46af59cdf7829738","amp;dn":"Confucianism%3A+An+Introduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30c112d3304bd070973fdd1c46af59cdf7829738","infoHashBuffer":{"type":"Buffer","data":[48,193,18,211,48,75,208,112,151,63,221,28,70,175,89,205,247,130,151,56]},"announce":[],"urlList":[]}}