{"title":"Kumbaya-the end of the road project. Surfing","uid":6866223,"size":595816628,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:31dc3db54f67b2094f5f914a4b7efd468f71e2fa&amp;dn=Kumbaya-the+end+of+the+road+project.+Surfing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mr.festus","files":1,"time":1323112449,"description":"At the end of the road lie rainbows, warm smiles, open arms and\nPolynesian dreams.  Just offshore, clear waters alive with far-flung\nswells meet perfect reef passes.  Tahiti is truly a surfer's paradise. \n \n&quot;The meanest day ridden at the meanest wave on the planet.&quot;  SURFER  Magazine\n \n&quot;It made Laird Hamilton's wave in 2000 look downright small.&quot;  Billabong Pro contest director Bushy Mitchell\n \n &quot;I think of this day and I think surfing's gone a bit crazy.  It's not\nsurfing as we know it anymore.&quot;  Joel Fitzgerald\n \nA miracle, plain and simple.  The Spring 2003 Tahiti sessions saw\nforty-four of the world's best touring surfers, a handful of hellmen and a local crew whose knowledge and talent is unmatched in these waters meet The Swell From Hell head-on.  The heaviest waves on the planet exploded on Teahupoo's reef as Malik Joyeux, Strider Wasilewski and Cory Lopez towed into bombs that flat-out dwarfed Laird Hamilton's historic ride from 2000 and (barely) lived, to the amazement of the gallery in the channel.  Tahitians Raimana Van Bastolear, Vetea 'Poto&quot; David and Manoa Drollet showed their familiarity in the cavernous barrels.  And Bruce Irons and Jamie Sterling scored giant tow-ins, with Sterling blowing out his eardrum in the process.\n \nMeanwhile, at The Right, death-defying barrels are forgotten for an\nafternoon as Chris Ward, Kalani Robb, Joel Parkinson, Shea Lopez and Taylor Knox blow the tops off of some of the best high-performance waves the world has to offer.\n \nAnd the (other) reason everyone's here in the first place:  The\nBillabong Tahiti Pro goes off in epic conditions.  Andy Irons, Shane\nDorian, Cory Lopez and crew score perfect barrels with Kelly Slater\nweaving through mind-blowing sections in an epic final against Taj\nBurrow to claim his second Teahupo'o win.\n \nCommentary by Shea Lopez and Pat O'Connell.\n \nAt the end of the road lie your greatest dreams, your worst fears.and\nthe swell of a lifetime.\n","torrent":{"xt":"urn:btih:31dc3db54f67b2094f5f914a4b7efd468f71e2fa","amp;dn":"Kumbaya-the+end+of+the+road+project.+Surfing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31dc3db54f67b2094f5f914a4b7efd468f71e2fa","infoHashBuffer":{"type":"Buffer","data":[49,220,61,181,79,103,178,9,79,95,145,74,75,126,253,70,143,113,226,250]},"announce":[],"urlList":[]}}