{"title":"Rainlendar 2.9 Build 108 Beta","uid":6512074,"size":9735309,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:326c3bb014ded7d3f894d03b4da8871cf732ca30&amp;dn=Rainlendar+2.9+Build+108+Beta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kadavul","files":1,"time":1309667562,"description":"Rainlendar 2.9 Build 108 Beta\n\n[img]http://i25.fastpic.ru/big/2011/0702/14/68e86a1332757e3eda1492ec1b671c14.jpg[/img]\n\n\nRainlendar is a full of features calendar tool which is quite simple to use and doesn't take much space on your desktop. The application is platform independent so you can run it both on Windows and on Linux. The appearance can be customized with skins and you can even mix different skins together. \n It is possible to use Rainlendar with other calendar applications too. Rainlendar uses the standard iCalendar format to store its events and tasks so you can easily transfer them between applications.\n\n You can also subscribe to online calendars and see your Outlook appointments directly in Rainlendar.\n\n Rainlendar is an unicode application that supports localization so you can use it on your own language.\n\nHere are some key features of &quot;Rainlendar Pro&quot;:\n\nÃ‚Â· Platform independent\n\n Ã‚Â· To do list\n\n Ã‚Â· Localized\n\n Ã‚Â· Standards Compatible\n\n Ã‚Â· Alarms\n\n Ã‚Â· Recurrence\n\n Ã‚Â· Scripting\n\n Ã‚Â· Backups\n\n Ã‚Â· Printing\n\n Ã‚Â· Search\n\n Ã‚Â· Shared calendars\n\n Ã‚Â· Outlook support\n\n Ã‚Â· Look'n'feel\n\n Ã‚Â· Highly Customizable\n\n Ã‚Â· Multiple Calendars\n\n Ã‚Â· Import &amp; Export\n\nRainlendar PRO 2.9 Build 108 Beta:\n\nÃ‚Â· Hidden windows are not drawn anymore to improve the performance.\n\n Ã‚Â· Offline file didn't work with Google calendar unless the task list was read from the server too.\n\n Ã‚Â· If the tray icon isn't selected for the skin the default icon is used instead. The icon can be disabled from the advanced options.\n\n Ã‚Â· The mouse cursor changes correctly to hand when it is over a clikable link.\n\n Ã‚Â· The skin.xml file is tried to read from the first subfolder inside the zip archive.\n\n Ã‚Â· Google events which are marked as non-modifiable are set as read-only in Rainlendar.\n\n Ã‚Â· The network calendars are not read immediately anymore if the poll duration has passed while the computer was suspended.\n\n Ã‚Â· The due time was not stored properly to Remember The Milk's task list.\n\n Ã‚Â· The next alarm for tasks which recurred last week day of the month was calculated incorrectly.\n\n Ã‚Â· Changing the due date or time will reset the completed time for the task.\n\n Ã‚Â· The tooltips are not shown anymore for items which are set hidden.\n\n Ã‚Â· Added an option to select the settings file from backups if the startup has failed.\n\n Ã‚Â· Added advanced option to remove the due time from the alarm window. This will also disable the alarm window from updating.\n\n Ã‚Â· Added support for sub tasks. The tasks can be moved under other task when the list has custom sort order.\n\n Ã‚Â· The position of the task in custom ordering is now written to the task itself.","torrent":{"xt":"urn:btih:326c3bb014ded7d3f894d03b4da8871cf732ca30","amp;dn":"Rainlendar+2.9+Build+108+Beta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"326c3bb014ded7d3f894d03b4da8871cf732ca30","infoHashBuffer":{"type":"Buffer","data":[50,108,59,176,20,222,215,211,248,148,208,59,77,168,135,28,247,50,202,48]},"announce":[],"urlList":[]}}