{"title":"Innocent Love [JDrama]","uid":6519984,"size":5207109027,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:327b8e2b18bec92f12ea5eb2e1a2cfa95bdb2110&amp;dn=Innocent+Love+%5BJDrama%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"DdxXxZ","files":11,"time":1309957748,"description":"IMDb\nOrphaned by her parents' death, left on her own by her brother's murder and arson conviction, and shunned by the people of her hometown, Kanon Akiyama moves to the city to find anonymity. However, what awaits her is the truth and a kindred soul. \n\n\nUser Review:\n\nThis 10-episode series is wonderfully unpredictable. Just when you think you know what's coming, there are more twists and turns in the plot. I loved every minute of it. Although, I could have done without episode 10. The last episode just seemed to be the writer's indulgence for more drama. Everything else was brilliant and worth watching.\n\nWhen her family's house burnt down in 2001, Kanon Akiyama became an orphan at age 13. Her brother, Yoji Akiyama, who was 18 at the time, was convicted of arson and parricide.\n\nSix years later, Kanon is on her own doing the best she can living in her hometown and faithfully visiting her brother in prison. However, every time her employer finds out about her past and her bother's conviction, she gets fired. With so much gossip and prejudice around her, she decides to move to the city to find anonymity. She is hard working with a great work ethic and cheerfulness; yet her anonymity is once again shattered when a journalist arrives at her work place and her true identity is exposed. The journalist, Jiro Ikeda, is investigating the truth about the fire. Her brother has maintained that he is innocent, so he believes he can find out the truth.\n\nThis story is full of people with secrets and their stubbornness to keep their secrets hidden at all costs. That is where the tragedy lies.\n\nYet, not all is lost for Kanon. She is open and honest, with the desire to know the truth. Thanks to fate, she meets Junya Nagasaki, a young man with the same desire, but is surrounded by lies as well. Destiny awaits them both. All that needs to be done is for the truth to painfully reveal itself.\n\nIt is said that the truth sets people free. However, it also takes its revenge on those who lie and dishonor it.\n\nI highly recommend this show. It is tender, charged and honors those that are true to their hearts.\n","torrent":{"xt":"urn:btih:327b8e2b18bec92f12ea5eb2e1a2cfa95bdb2110","amp;dn":"Innocent+Love+%5BJDrama%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"327b8e2b18bec92f12ea5eb2e1a2cfa95bdb2110","infoHashBuffer":{"type":"Buffer","data":[50,123,142,43,24,190,201,47,18,234,94,178,225,162,207,169,91,219,33,16]},"announce":[],"urlList":[]}}