{"title":"Teen Wolf Season 1(2011) 720p BRip - ZiXicoR","uid":7028693,"size":11680244734,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:334a5e22b6c9df4c5ca0a909f2aa1881b5bb2247&amp;dn=Teen+Wolf+Season+1%282011%29+720p+BRip+-+ZiXicoR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ZiXicoR","files":37,"time":1329156274,"description":"Teen Wolf Season 1(2011) 720p BRip with English Subtitles.\nPlease Seed.\nThank You.\n\n\nThe series revolves around social outcast Scott McCall, a young lacrosse-playing student at Beacon Hills High School. His life drastically changes when he is bitten by a werewolf one night. Upon discovery that he is a werewolf, with the help of his best friend, Stiles, and the mysterious werewolf, Derek, he is forced to learn to balance his newfound identity among the many dangers that it presents with his teenage life. He must keep his loved ones safe and balance the relationships he shares with each person around him. Scott is also having trouble with keeping his secret from the girl he loves, and later finds out she is part of a family that hunts werewolves.The theme of \\\\\\&quot;finding your place\\\\\\&quot; is a prevalent undertone in the series that is mirrored by the pack mentality of werewolves.\n\nIn season one, Scott is faced with the reality of choosing between love and his newly found responsibilities as a werewolf. He must figure out ways to keep his loved ones safe, balance the relationships he already shares with new relationships he makes, and deal with himself as a werewolf under the full moon. The characters around him must also deal with problems of their own, which somehow ties down to Scott, as they all make discoveries along the way.","torrent":{"xt":"urn:btih:334a5e22b6c9df4c5ca0a909f2aa1881b5bb2247","amp;dn":"Teen+Wolf+Season+1%282011%29+720p+BRip+-+ZiXicoR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"334a5e22b6c9df4c5ca0a909f2aa1881b5bb2247","infoHashBuffer":{"type":"Buffer","data":[51,74,94,34,182,201,223,76,92,160,169,9,242,170,24,129,181,187,34,71]},"announce":[],"urlList":[]}}