{"title":"Living on Velvet (Frank.Borzage,1935) NTSC WAC.Spa.subs","uid":7016718,"size":4164870144,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3399551482346c76866c6f0b050410f1a186261f&amp;dn=Living+on+Velvet+%28Frank.Borzage%2C1935%29+NTSC+WAC.Spa.subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"Justine09","files":-1,"time":1328692095,"description":"SYNOPSIS: After pilot Terry Parker survives a plane crash that kills his sister, father and mother, he believes he is living on borrowed time. Unable to take anything seriously, he continually gets into trouble. His friend, Walter Pritcham, known as Gibraltar for his steady nature, rescues him from one debacle and brings him to a party. Terry catches the eye of Amy Prentiss and they fall in love at first sight. When Terry realizes that she is Gibraltar's girl, he tries to step aside, but Gibraltar, caring only for Amy's happiness, reunites them. Despite the misgivings of Amy's aunt Martha, she and Terry marry and Gibraltar gives them a house in the country on Long Island, arranging to buy some worthless stock for a high price in order to loan them money without hurting Terry's pride. Terry is unable to get a job until he hits on the idea of flying commuters into New York. Amy, however, believes that Terry will never act responsibly and leaves him. Although Gibralter advises her to return to Terry, Amy feels that he is better off without her. Then Terry crashes his car and Amy and Gibraltar rush to his side. Terry and Amy realize how much they love each other and vow never to part.\n\nSpanish subs added.","torrent":{"xt":"urn:btih:3399551482346c76866c6f0b050410f1a186261f","amp;dn":"Living+on+Velvet+%28Frank.Borzage%2C1935%29+NTSC+WAC.Spa.subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3399551482346c76866c6f0b050410f1a186261f","infoHashBuffer":{"type":"Buffer","data":[51,153,85,20,130,52,108,118,134,108,111,11,5,4,16,241,161,134,38,31]},"announce":[],"urlList":[]}}