{"title":"The Mummy: Tomb of The Dragon(2008)DVDRip.AC3(ENG)-DROCK","uid":6577057,"size":730585088,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:34c370347b5c8959e915b4029b19fc4c1b8f3ba0&amp;dn=The+Mummy%3A+Tomb+of+The+Dragon%282008%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1312246567,"description":"The Fast and the Furious director Rob Cohen continues the tale set into motion by director Stephen Sommers with this globe-trotting adventure that finds explorer Rick O'Connell and son attempting to thwart a resurrected emperor's (Jet Li) plan to enslave the entire human race. It's been 2,000 years since China's merciless Emperor Han and his formidable army were entombed in terra cotta clay by a double-dealing sorceress (Michelle Yeoh), but now, after centuries in suspended animation, an ancient curse is about to be broken. Thanks to his childhood adventures alongside father Rick (Brendan Fraser) and mother Evelyn (Maria Bello), dashing young archeologist Alex O'Connell (Luke Ford) is more than familiar with the power of the supernatural. After he is tricked into awakening the dreaded emperor from his eternal slumber, however, the frightened young adventurer is forced to seek out the wisdom of his parents -- both of whom have had their fair share of experience battling the legions of the undead. Should the fierce monarch prove capable of awakening his powerful terra cotta army, his diabolical plan for world domination will finally be set into motion. Of course, the one factor that this emperor mummy failed to consider while solidifying his power-mad plans was the O'Connells, and before this battle is over, the monstrous monarch will be forced to contend with the one family that isn't frightened by a few rickety reanimated corpses.\n\nRipped with Autogk.\n\nLength: 1 Hour 52 Minutes\n\nFile Type: AVI\n\nFrame Width: 608\n\nFrame Height: 256\n\nFrame Rate: 30fps\n\nAudio\n\nBit Rate: 116kbps","torrent":{"xt":"urn:btih:34c370347b5c8959e915b4029b19fc4c1b8f3ba0","amp;dn":"The+Mummy%3A+Tomb+of+The+Dragon%282008%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34c370347b5c8959e915b4029b19fc4c1b8f3ba0","infoHashBuffer":{"type":"Buffer","data":[52,195,112,52,123,92,137,89,233,21,180,2,155,25,252,76,27,143,59,160]},"announce":[],"urlList":[]}}