{"title":"The Apple of his eye","uid":6569956,"size":1442643968,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:35b02b7fc22f47043a23d928c135ceb7659d6a3d&amp;dn=The+Apple+of+his+eye&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eternity-promo","files":1,"time":1311898099,"description":"The apple of his eye gaat over Israel, Gods (YHWH) verbondsvolk.\nInteressante DVD over Israel, gemaakt door Jan Willem van der Hoeven die een hart heeft voor dit land.\n\n\nThe apple of his eye is about Israel, Gods(YHWH) Covenanted People.\n\nNice DVD about Israel made by Jan Willem van der Hoeven who has a heart for this nation.\n\n23min.\n\n\nHis People\n\nThe Jews, &quot;the children of the promise&quot; (Romans 9:7-9) are the physical descendants of Abraham through Isaac and Jacob, and are the people God calls His chosen: Deuteronomy 14:2; 2 Samuel 7:24; Psalm 33:12; Psalm 135:4\n\nThe Jews are not God's chosen people through any merit of their own, but because He loves them as a nation: Deuteronomy 7:7-8\n\nLike us gentiles, the Jews are sinners in need of redemption. Unlike us gentiles, however, they have been chosen and set apart as a nation, and God went out to redeem them as a nation: 2 Samuel 7:23\n\nJust as their calling is great, so too the cost of failing in that calling has been great, as Moses warned the children of Israel it would be. Deuteronomy 28:15-68\n\nYet, despite their rebellion and wickedness, God did not make a complete end of them: Ezekiel 11:16-17\n\nFor God's commitment to Israel stands eternal: Jeremiah 31:35-36\n\nAlthough He promised to scatter the Jews, and cause them to &quot;pay double for all their sins,&quot; God also swore that He would one day gather those who were left and return them to their land. Isaiah 11:11-12\n\nGod said that this restoration to their land would follow an unprecedented time of suffering at the hands of gentiles, but that He would save them out from under it: Jeremiah 30:7-10\n\nAnd He promised that this physical ingathering and replanting as a people in their ancient homeland would be both a positive event, and a permanent one: Jeremiah 24:6-7; Amos 9:14-15\n\nGod said that He would restore the Jews to their land in their blind and sinful state. But He has also promised that after they are back in their land, He will cause them to call out to Him for forgiveness. And when they do, He will cleanse them and thoroughly restore them in their relationship to Him: Zechariah 12:10; Zechariah 13:1\n\nThis cleansing will complete Israel's restoration as a nation once and for all: Jeremiah 31:33-34\n\nWe know that the name &quot;Israel&quot; means &quot;Prince with God.&quot; It was the name given to Jacob after he had wrestled with the LORD and refused to let Him go until He blessed him. And it was the name passed on, through Jacob's twelve sons, to their children and their children's children.\n\nOver 185 times in the Bible, God refers to the physical descendants of Abraham, through Isaac and Jacob, (not through Ishmael or Esau) as &quot;My people&quot;. He also describes them as the people who are &quot;called by My name&quot;.\n\nWho exactly are the People of Israel? Who were they originally, and who they today? Are they the Israelites, the Jews or the Israelis? Are they all three? How do these groups differ?\n\nAnd what about their genesis? Where did they come from originally? Where did they return from over this past century-and-a-half?\n\nWhat are they? Just another nation? A hodgepodge of nations? Are they truly chosen? If so, what for?\n\nWhat makes them a people? How do they live? Where do they live? Where did they live before, and what was life like for them then?\n\nAnd what lies ahead for them? Assimilation or exclusion? Victory or defeat? Peace or war? Blessing or cursing? Heaven, or another Holocaust?\n\nIn the pages of this channel we will endeavor to answer these questions - and more - about this remarkable nation of people known as Israel.\n","torrent":{"xt":"urn:btih:35b02b7fc22f47043a23d928c135ceb7659d6a3d","amp;dn":"The+Apple+of+his+eye","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35b02b7fc22f47043a23d928c135ceb7659d6a3d","infoHashBuffer":{"type":"Buffer","data":[53,176,43,127,194,47,71,4,58,35,217,40,193,53,206,183,101,157,106,61]},"announce":[],"urlList":[]}}