{"title":"Fort Team Charlie Episode 1.9","uid":6585687,"size":392243938,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:38dd6acf4ae60345fa2bbdaca0288b1863bcead0&amp;dn=Fort+Team+Charlie+Episode+1.9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FortBen","files":1,"time":1312599696,"description":"It is the summer of 1965, and in a few months two very special organizations will be celebrating their golden jubilee.\n \n50 years ago, an international cabal known as Nice corp. concluded a strategic restructuring of their vast corporate empire in preparation for WW1. The result of this reorg was the formation of two new autonomous firms, RED and BLU, each with its own independent board of directors, staff and facilities. From then on as fierce but friendly competitors, the cabal survived The Great war, and continued to thrive through the decades that followed.\n \nBy 1962, the twin successor companies of Nice corp. had become exceedingly wealthy and powerful; however, their skyrocketing success was a cause for concern for many senior officials in the United States government. That same year, after decades of mutual partnership, the US military secretly declared both RED and BLU the two greatest threats to their global military hegemony. With the utmost secrecy, the military proceeded to draw up plans to topple their newly chosen adversaries.\n \nIn the autumn of 1964, a clever plan was finally approved by the military leadership and put into action. The &quot;Pillar plan&quot; as it was called (named after its creator, Colonel William Pillar), was actually an elaborate hoax, designed to sabotage the friendly relations between RED and BLU. It involved convincing both firms that an army of hostile space aliens were about to invade earth, while providing false evidence that the other was conspiring with the intruders against humanity.\n \nFort Team Charlie follows the daily drama of several employees of Reliable, as they deal with increasingly aggressive tactics by BLU and face the possible demise of their organization on the eve of its 50th anniversary.\n \nCreated by Benny Fortman.\n","torrent":{"xt":"urn:btih:38dd6acf4ae60345fa2bbdaca0288b1863bcead0","amp;dn":"Fort+Team+Charlie+Episode+1.9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38dd6acf4ae60345fa2bbdaca0288b1863bcead0","infoHashBuffer":{"type":"Buffer","data":[56,221,106,207,74,230,3,69,250,43,189,172,160,40,139,24,99,188,234,208]},"announce":[],"urlList":[]}}