{"title":"The Eagle (2011) [DVDRip][DUAL][Eng-Spa]","uid":6577828,"size":1208962269,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3af469de22ca7f791bf757118b83c9306aa4df72&amp;dn=The+Eagle+%282011%29+%5BDVDRip%5D%5BDUAL%5D%5BEng-Spa%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"webchella","files":4,"time":1312282383,"description":"La legiÃƒÂ³n del ÃƒÂ¡guila (2011) [DVDRip][DUAL][Eng-Spa]\n &lt;a href=&quot;\nhttp://www.lalegiondelaguila.es/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.lalegiondelaguila.es/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1034389/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1034389/&lt;/a&gt;\n\n--------\nEnglish:\n--------\nEnglish and Spanish DVDRip \nSpanish forced the sub carepta \nFull English and Spanish sub \nXvid-AC3 5.1 \n\n\nTitle: The Eagle\nCountry: USA \nUSA release: 11/02/2011 \nReleased in Spain: 08/04/2011 \nReleased on DVD (rental): 03/08/2011 \nStudio: Focus Features \nDirector: Kevin MacDonald \nScreenplay: Jeremy Brock \nStarring: Jamie Bell, Channing Tatum, Donald Sutherland, Mark Strong \nRating: Not recommended for children under 12 years \n\n\nSynopsis: \nBritain, second century after Christ. Two men, master and slave, is venturing beyond the frontier of the known world in a search as obsessive as it is dangerous to take them to the limits of loyalty and betrayal, friendship and hate, disappointment and heroism ... \n\nIn 140 AD, the Roman Empire extends to Britain, although its dominance is not complete since the rebel tribes of Caledonia (now Scotland) have become stronger in the north. Marco Aquila (Channing Tatum) arrives in Britain, determined to restore the tarnished reputation of his father, Flavius ??Aquila. Twenty years ago the 5,000 men of the Ninth Legion, led by Flavio and the famous golden emblem, the Eagle of the Ninth Legion marched north to Caledonia. Never again. The Legion and the emblem disappeared into the misty mountains. Furious, the Emperor Hadrian ordered a wall to seal up the territory. Hadrian's Wall became the northernmost frontier of the Roman Empire on the edge of the known world. \n\nEducated to become a brilliant soldier and the command of a small fort located in the southwest of the island, Marco makes proof of immeasurable value during a siege. Rome praises him, but he separated from service due to serious injuries. Marco, demoralized, convalescing in the village of his uncle Aquila (Donald Sutherland), a retired officer. During a fight of gladiators, Marco impulsively asks to spare the life of a young gladiator, and the Briton purchase Aquila Esca (Jamie Bell) to give away. Marco Esca treated with contempt, and the slave hates everything that is Roman. But Esca swears to serve the man who saved his life. \n\nOn hearing that has been the golden eagle in a temple in the far north, Marco decides to act and, accompanied by Esca, cross Hadrian's Wall. Discover the mountains of Caledonia occupy a vast and wild region. He has no choice but to rely on the slave if you want to reach your destination. They find Guern (Mark Strong), a former Roman legionary, and Marco realizes that the mystery of the disappearance of his father probably has to do with identity and loyalty of his slave. Discover the secret becomes more pressing when both face the fearsome warrior prince of Foca (Tahar Rahim). \n\nProduction notes: \n- A Roman epic adventure based on the classic novel 'The Eagle of the Ninth Legion', set in the dangerous world of second-century Britain.\n\n\n--------\nEspaÃƒÂ±ol:\n--------\nDVDRip espaÃƒÂ±ol e inglÃƒÂ©s\nsub forzados espaÃƒÂ±ol en la carepta\nsub espaÃƒÂ±ol e inglÃƒÂ©s completos\nXvid-AC3 5.1\n\n\nTÃƒÂ­tulo: La legiÃƒÂ³n del ÃƒÂ¡guila\nTÃƒÂ­tulo original: The Eagle\nPaÃƒÂ­s: USA \nEstreno en USA: 11/02/2011 \nEstreno en EspaÃƒÂ±a: 08/04/2011 \nLanzamiento en DVD (alquiler): 03/08/2011 \nProductora: Focus Features \nDirector: Kevin MacDonald \nGuiÃƒÂ³n: Jeremy Brock \nReparto: Jamie Bell, Channing Tatum, Donald Sutherland, Mark Strong\nCalificaciÃƒÂ³n: No recomendada para menores de 12 aÃƒÂ±os\n\n\nSinopsis:\nBritania, siglo II despuÃƒÂ©s de Jesucristo. Dos hombres, el amo y el esclavo, se aventuran mÃƒÂ¡s allÃƒÂ¡ de la frontera del mundo conocido en una bÃƒÂºsqueda tan obsesiva como peligrosa que les llevarÃƒÂ¡ hasta los lÃƒÂ­mites de la lealtad y la traiciÃƒÂ³n, de la amistad y el odio, del desengaÃƒÂ±o y el heroÃƒÂ­smo... \n\nEn el aÃƒÂ±o 140 dC, el Imperio Romano se extiende hasta Britania, aunque su dominio no es completo dado que las tribus rebeldes de Caledonia (la actual Escocia) se han hecho fuertes en el norte. Marco Aquila (Channing Tatum) llega a Britania, decidido a restaurar la empaÃƒÂ±ada reputaciÃƒÂ³n de su padre, Flavio Aquila. Hace veinte aÃƒÂ±os que los 5.000 hombres de la Novena LegiÃƒÂ³n, encabezados por Flavio y el famoso emblema de oro, el ÃƒÂ¡guila de la Novena LegiÃƒÂ³n, marcharon hacia el norte, a Caledonia. JamÃƒÂ¡s volvieron. La legiÃƒÂ³n y el emblema desaparecieron entre las brumosas montaÃƒÂ±as. Furioso, el emperador Adriano mandÃƒÂ³ levantar un muro para sellar el territorio. El Muro de Adriano se convirtiÃƒÂ³ en la frontera mÃƒÂ¡s septentrional del Imperio Romano, en el lÃƒÂ­mite del mundo conocido. \n\nEducado para convertirse en un brillante soldado y al mando de un pequeÃƒÂ±o fortÃƒÂ­n situado en el suroeste de la isla, Marco hace prueba de un valor inconmensurable durante un asedio. Roma le elogia, pero le separa del servicio debido a sus graves heridas. Marco, desmoralizado, convalece en la villa de su tÃƒÂ­o Aquila (Donald Sutherland), un oficial retirado. Durante una pelea de gladiadores, Marco pide impulsivamente que se perdone la vida a un joven gladiador, y Aquila compra al britano Esca (Jamie Bell) para regalÃƒÂ¡rselo. Marco trata a Esca con desprecio, y el esclavo odia todo lo que es romano. Pero Esca jura servir al hombre que le ha salvado la vida. \n\nAl oÃƒÂ­r que se ha visto el ÃƒÂ¡guila de oro en un templo del lejano norte, Marco decide actuar y, acompaÃƒÂ±ado por Esca, cruza el Muro de Adriano. Descubre que los montes de Caledonia ocupan una vasta y salvaje regiÃƒÂ³n. No le queda mÃƒÂ¡s remedio que fiarse del esclavo si quiere llegar a su destino. Se encuentran con Guern (Mark Strong), un ex legionario romano, y Marco comprende que el misterio de la desapariciÃƒÂ³n de su padre seguramente tenga que ver con la identidad y lealtad de su esclavo. Descubrir el secreto se hace mÃƒÂ¡s apremiante cuando ambos se enfrentan a los guerreros del temible prÃƒÂ­ncipe de los Foca (Tahar Rahim). \n\nNotas de producciÃƒÂ³n:\n- Una aventura ÃƒÂ©pica de ÃƒÂ©poca romana, basada en la clÃƒÂ¡sica novela 'El ÃƒÂ¡guila de la Novena LegiÃƒÂ³n', que transcurre en el peligroso mundo del siglo II en Britania.\n","torrent":{"xt":"urn:btih:3af469de22ca7f791bf757118b83c9306aa4df72","amp;dn":"The+Eagle+%282011%29+%5BDVDRip%5D%5BDUAL%5D%5BEng-Spa%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3af469de22ca7f791bf757118b83c9306aa4df72","infoHashBuffer":{"type":"Buffer","data":[58,244,105,222,34,202,127,121,27,247,87,17,139,131,201,48,106,164,223,114]},"announce":[],"urlList":[]}}