{"title":"Personalysis Corporation now playing at data mofification","uid":6578867,"size":739328,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3cfde1548dcd6d1e7f0d92433cf0e9cae17c9169&amp;dn=Personalysis+Corporation+now+playing+at+data+mofification&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mrizzo2","files":-1,"time":1312324148,"description":"The Previously most powerful trait theory ever known to man to explain\nhuman behaviour and motivations and inner core existentialism has\nin recent years been completely re-written and misrepresented to advocate\na level of political correctness that borders on fraud, on the part\nof the Personalysis Corporation (previously the now disappeared Manatec Institute\npublished the more reliable version and did the original research).\n\nFor example, in a bid to obfuscate what trait groupings are &quot;rationally supreme&quot; (blue in the original findings) are now assigned to &quot;red&quot; (aggressive in the original findings).\n\nAs such we can only consider their stuff now not useful - unless they\nhave the wisdom to put the real goods back on the shelf and stop flogging some\ntrash they may be trying to foist onto you instead to support a drive towards\naggressive tendency based compliance models of the stupid insane as is the \ncurrently political correct nightmare before us potentially.\n\nHere is a critical review of the new obfuscated version (described as lacking\nvalidity) by an Australian researcher along with our summary of the original work\nby Dr Noland. he makes reference to the original version too - in noting\nan alternate review published by others too earlier on.\n\n\nMichael Rizzo Chessman - August 2nd, 2011\nemail me if you have the original booklet - Id be happy to pay for the seminar\nmanuals especially (circa 1984) thanks \n\n\n\n","torrent":{"xt":"urn:btih:3cfde1548dcd6d1e7f0d92433cf0e9cae17c9169","amp;dn":"Personalysis+Corporation+now+playing+at+data+mofification","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cfde1548dcd6d1e7f0d92433cf0e9cae17c9169","infoHashBuffer":{"type":"Buffer","data":[60,253,225,84,141,205,109,30,127,13,146,67,60,240,233,202,225,124,145,105]},"announce":[],"urlList":[]}}