{"title":"Blondes Love Blondes 3 XXX DVDRiP XviD","uid":6876815,"size":63461,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:3d64a49cc2bc515152d7ee177c240964e6873767&amp;dn=Blondes+Love+Blondes+3+XXX+DVDRiP+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"commandoarmy30","files":-1,"time":1323499991,"description":"Autograph - Blondes In Black Cars [promo].VOB\n\nHQ unusual promo music video. &quot;Blondes In Black Cars&quot; is really a single from This is the Stuff, the 2nd album through the American melodic hard rock-band Autograph.\n\nAnother version from the album appeared later in 1986, having a blue cover with slightly different artwork. This version from the album found the track &quot;We are a united states Band&quot; changing &quot;Acoustic Guitar Fever&quot; as track 6. The singles launched from the album were This Is The Stuff and Blondes In Black Cars.\n\nA remastered version from the original album (red-colored cover) was launched by Spitfire Records in 2002, which maintained exactly the same track listing because the original, aside from the substitution of &quot;Acoustic Guitar Fever&quot; having a cover of Grand Funk Railroad's &quot;We are a united states Band&quot; as track #6.\n\nAutograph was a united states hard rock-band from La, California. Participating in RCA from 1984 to 1989, they offered 1.5 million records and were granted gold using their &quot;Register Please&quot; album. A brand new version from the band (v2.02) was created\n\nby their founder Steve Plunkett in 2002 for any single album. They've been inactive since 2005.\n\nThey've together with with Motley Crue, Heart, Aerosmith, Ronnie James Dio, Van Halen, Bryan Adams, and Whitesnake.\n\n(video includes a red-colored/whitened &quot;vh1 classic&quot; logo design at the end right)File qualities info using Media Player Classic:\n\n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 5999kbps\n\n   Audio: MPEG Audio Layer 2 48000Hz stereo system 224kbps\n\n   Duration: 00:04:15\n\n*Install the &quot;Media Player Classic&quot; player if you cannot play this file,\n\nor better visual and audio quality playback of your videos.\n\nIt's 100% liberated to download and employ. Just up-to-date September 7, 2010!","torrent":{"xt":"urn:btih:3d64a49cc2bc515152d7ee177c240964e6873767","amp;dn":"Blondes+Love+Blondes+3+XXX+DVDRiP+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d64a49cc2bc515152d7ee177c240964e6873767","infoHashBuffer":{"type":"Buffer","data":[61,100,164,156,194,188,81,81,82,215,238,23,124,36,9,100,230,135,55,103]},"announce":[],"urlList":[]}}