{"title":"Encryption for Digital Content {BBS}","uid":6638038,"size":5422192,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:40438300c76fa943cce62ab852a5e1056a26d958&amp;dn=Encryption+for+Digital+Content+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1314635971,"description":"Cryptography is an area that traditionally focused on secure communication, authentication and integrity. In recent times though, there is a wealth of novel  fine-tuned cryptographic techniques that sprung up as cryptographers focused on the specialised problems that arise in digital content distribution. These include fingerprinting codes, traitor tracing, broadcast encryption and others. This book is an introduction to this new generation of cryptographic mechanisms as well as an attempt to provide a cohesive presentation of these techniques.\n\nEncryption for Digital Content details the subset cover framework (currently used in the AACS encryption of Blu-Ray disks), fingerprinting codes, traitor tracing schemes as well as related security models and attacks.   It provides an extensive treatment of the complexity of the revocation problem for multi-receiver (subscriber) encryption mechanisms, as well as the complexity of the traceability problem. Pirate evolution type of attacks are covered in depth. This volume also illustrates the manner that attacks affect parameter selection, and how this impacts implementations. The authors gratefully acknowledge the support of the National Science Foundation under Grant No. 0447808.\n\nF\n\n    * Hardcover: 222 pages\n    * Publisher: Springer; 1st Edition. edition (November 2, 2010)\n    * Language: English\n    * ISBN-10: 1441900438\n    * ISBN-13: 978-1441900432","torrent":{"xt":"urn:btih:40438300c76fa943cce62ab852a5e1056a26d958","amp;dn":"Encryption+for+Digital+Content+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40438300c76fa943cce62ab852a5e1056a26d958","infoHashBuffer":{"type":"Buffer","data":[64,67,131,0,199,111,169,67,204,230,42,184,82,165,225,5,106,38,217,88]},"announce":[],"urlList":[]}}