{"title":"Picture Yourself Creating Digital Scrapbooks{BBS}","uid":6658571,"size":24358487,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:40d9c7d0d897801fa545a576df175945641b9e28&amp;dn=Picture+Yourself+Creating+Digital+Scrapbooks%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"bigbluesea","files":-1,"time":1315420593,"description":"Are you a traditional paper scrapbooking aficionado who wants to learn how to incorporate digital photography and printing techniques into your hobby? Do you already dabble in digital scrapbooking but want to create professional-looking graphics and printable scrapbook pages at home? &quot;Picture Yourself Creating Digital Scrapbooks: Step-by-Step Instruction for Preserving Memories Using Your Computer&quot; shows you how to incorporate traditional and contemporary graphic design principles to create print and digital scrapbook projects using your digital camera, computer, and popular graphics software. Starting with the basics of scrapbooking, you'll learn about the history and traditions of the craft, scrapbook terminology, the tools and software you'll need, and how to create simple but eye-catching page layouts. You'll then take a look at the digital cameras, scanners, and printers you'll use to create your masterpieces, and learn basic photo editing techniques to enhance and perfect your photos. Step-by-step directions enhanced with full-color images provide both instruction and inspiration as you discover how to quickly assemble professional quality printable and digital layouts and complete scrapbooks at home. &quot;Picture Yourself Creating Digital Scrapbooks&quot; offers unique page layout and craft ideas, tips from designers, special fonts, tutorials, and everything else you need to create beautiful digital scrapbooks at home.\nProduct Details\n\n    * Paperback: 280 pages\n    * Publisher: Course Technology PTR; 1 edition (December 27, 2007)\n    * Language: English\n    * ISBN-10: 1598634887\n    * ISBN-13: 978-1598634884","torrent":{"xt":"urn:btih:40d9c7d0d897801fa545a576df175945641b9e28","amp;dn":"Picture+Yourself+Creating+Digital+Scrapbooks%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40d9c7d0d897801fa545a576df175945641b9e28","infoHashBuffer":{"type":"Buffer","data":[64,217,199,208,216,151,128,31,165,69,165,118,223,23,89,69,100,27,158,40]},"announce":[],"urlList":[]}}