{"title":"Christopher Hibbert - Redcoats and Rebels [unab Audiobook 64 kbp","uid":7016481,"size":405240746,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:427cdcf87a7d4a5d26e523a38fe7b4d466bfb0f2&amp;dn=Christopher+Hibbert+-+Redcoats+and+Rebels+%5Bunab+Audiobook+64+kbp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"rambam1776","files":-1,"time":1328678941,"description":"General Information\n===================\n Title:                  Redcoats and Rebels\n Author:                 Christopher Hibbert\n Read By:                David Case\n Copyright:              1990\n Audiobook Copyright:    2000\n Genre:                  History\n Publisher:              Books on Tape\n\nFile Information\n================\n Number of MP3s:         20\n Total Duration:         13:58:05\n Total MP3 Size:         386.04\n Parity Archive:         No\n Encoded At:             CBR 64 kbit/s 44100 Hz Mono\n Normalize:              None\n Noise Reduction:        None\n ID3 Tags:               Set, v1.1, v2.3\n\nBook Description\n================\nRedcoats and Rebels provides a thorough introduction to the Revolutionary\nWar. Told with great authority and clarity it describes and details\nthe effects of each notable event from 1770 to 1781, examining each\nof the major battles and skirmishes but not getting bogged down in deep\nanalysis of battle formations and strategies.\n\nInstead concentrating on the war as a whole and its political and economic\nimpacts on Britain and America and consequently how each commander's\nstrategy was affected, the book is filled with anecdotes to give the\nreader a clearer understanding of how the war affected the lives of\nthose involved.\n &lt;a href=&quot;\nhttp://www.amazon.com/Redcoats-Rebels-America-1770-1781/dp/0736656340/ref=tmm_abk_title_0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Redcoats-Rebels-America-1770-1781/dp/0736656340/ref=tmm_abk_title_0&lt;/a&gt;\n\n\nFrom Publishers Weekly\n\nBritish historian Hibbert's narrative of the War of Independence from the British and Loyalist viewpoint is lively, beautifully written and freshly informative. Tracing events from the colonists' unexpected outrage over the 1765 Stamp Act to the Treaty of Paris in 1783, he describes the bitter foreign policy debates in London and the escalating logistic difficulties of supporting a war in North America while conducting far-flung campaigns against the French and Spanish as well. In his evenhanded account of operations from Canada to the Carolinas, Hibbert analyzes British attempts to achieve a unified strategy against the rebels, and brings into focus the ideological confusion and political disunity that hampered the American cause throughout the eight-year struggle. The author lays more stress on French intervention in accounting for the ultimate American triumph than our historians are wont to do. He also points out that the 1781 battle of Coppens was one of the few times the Redcoats were tactically outwitted. Photos. \nCopyright 1990 Reed Business Information, Inc.\n\nFrom School Library Journal\n\nThe story of our struggle for independence from the Boston Tea Party to Cornwallis's surrender at Yorktown is among the most familiar in American history. The key events and personalities have been described in popular fiction, history, and movies. Hibbert's unusual and interesting book takes readers through the familiar chronology from the English point of view. The result deepens one's appreciation of the obstacles that faced the British in their attempts to maintain control of North America. Their strategy and tactics are especially understandable when presented in this context. The blunders of English decision-makers in both the government and the army are given the prominence they deserve. Sam Adams and George Washington appear briefly as their enemies saw them. British leaders appear as complete figures with both flaws and strengths. By providing the often overlooked side of an important and commonly told story, this book offers new insights and pleasurable reading.","torrent":{"xt":"urn:btih:427cdcf87a7d4a5d26e523a38fe7b4d466bfb0f2","amp;dn":"Christopher+Hibbert+-+Redcoats+and+Rebels+%5Bunab+Audiobook+64+kbp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"427cdcf87a7d4a5d26e523a38fe7b4d466bfb0f2","infoHashBuffer":{"type":"Buffer","data":[66,124,220,248,122,125,74,93,38,229,35,163,143,231,180,212,102,191,176,242]},"announce":[],"urlList":[]}}