{"title":"Constructing Australia   (Complete Series)","uid":6602605,"size":1549674810,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4407eec3cfef3aab6792a90ce41938ede2ad26d4&amp;dn=Constructing+Australia+++%28Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rosie1966","files":4,"time":1313270892,"description":"Politics, tragedy and conquest combine in stories behind the building of Australia. The Bridge, Pipe Dreams and A Wire Through the Heart combine rare archival images with dramatic storytelling in showcasing three landmark events that would allow Australia to mark its place in the world. The Sydney Harbour Bridge, the Kalgoorlie Pipeline and the Overland Telegraph line were engineering triumphs, but the human drama in constructing Australia is even more fascinating.\n\n\nEpisode Listing\n\n\nEp 1 - The Bridge - Spanning the harbour had been the dream of Sydneysiders since the earliest European settlement, but it took the vision and determination of two very different men to make it happen. James Bradfield and Jack Lang. Their personal stories and the story of the bridge interweave in ways that forged modern Australia. The bridge provoked and amplified political crises that saw Britain and Australia lock horns, and tensions on the Depression-hit streets of Sydney erupt in the threat of an uprising. In these tumultuous times, exactly 75 years ago, a battle for the soul of Australia was waged, out of which a new, more self-conscious nation emerged, with an internationally recognised icon to reflect its new confidence.\n\n\nEp 2- A Wire Through the Heart - An epic survival adventure, a love story, and the forbidding red heart of Australia - these elemental images are powerfully drawn together in the story of how John Stuart crossed the continent and in his wake Charles Todd, who built the telegraph line that finally ended Australia's isolation. Stuart was one of the few survivors of the unbelievable hardships of the interior, partly because unlike others, he trusted the knowledge offered by indigenous Australians. Stuart's success was built on by Todd who finally connected Australia up to the 'Victorian internet'. Along the way he founded a town to honour the wife he loved so much - Alice.\n\n\nEp 3 - Pipe Dreams - In Australia water is like gold, and in this episode, gold and water combine in the epic story of how they helped give birth to modern Australia. It tells the story of Cy O'Connor and the building of his monumental 570-kilometre pipeline from Perth to Kalgoorlie. It made Western Australia rich and attracted new settlers from the east who pushed WA's entrenched interests into support for a commonwealth they had resisted for years. The future of WA and the nation rested on this massively ambitious technological achievement, which cost O'Connor his life.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:4407eec3cfef3aab6792a90ce41938ede2ad26d4","amp;dn":"Constructing+Australia+++%28Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4407eec3cfef3aab6792a90ce41938ede2ad26d4","infoHashBuffer":{"type":"Buffer","data":[68,7,238,195,207,239,58,171,103,146,169,12,228,25,56,237,226,173,38,212]},"announce":[],"urlList":[]}}