{"title":"Democracy Now - 23 aug 2011","uid":6624802,"size":449761919,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:451eee353c02465c67b9d53b4a62b9e3d1411002&amp;dn=Democracy+Now+-+23+aug+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1314118683,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\n\nHeadlines for Aug 23, 2011\n\n- Defying Reports of Capture, Gaddafi's Son Makes Appearance In Tripoli\n- Libya: U.S., NATO Forces Play Key Role in Rebel Push\n- U.N.: Death Toll in Syrian Crackdown Surpasses 2,200\n- South Sudan Cattle Raid Leaves Hundreds Dead\n- Suspected U.S. Drone Crashes in Somalia\n- Obama Admin Pressures NY Attorney General on Bank Settlement Over Questionable Foreclosure Tactics\n- Goldman Sachs Share Prices Drop After CEO Hires High-Profile Defense Attorney\n- Credit Rating Agency Whistleblower Speaks Out\n- Presidential Hopeful Rick Perry Shuns His Own Book, &quot;Fed Up&quot;\n- Texas Unemployment Rate Highest in Over Two Decades\n- Amnesty Condemns Iran's Harsh Sentence of U.S. Hikers\n- Turkish Offensive Leaves 100 Dead in Iraq\n- Mongolians Opposed to U.S. Nuclear Waste Dump Protest Biden Visit\n- Canadian Opposition Leader Jack Layton Dies\n\n\nSpecial reports\n\n- As Fighting Continues in Tripoli, A Look at Role of the U.S., NATO and Oil Firms in Libya Uprising\n\nFighting continues in parts of Tripoli, the capital of Libya, where rebels are reportedly battling with Muammar Gaddafi's forces outside his heavily fortified compound. Reports by the Libyan Rebel Council that Gaddafi's son, Saif Al-Islam, had been captured were contradicted late Monday when he emerged amongst supporters in front of foreign journalists in Tripoli. The International Criminal Court had claimed he had been in the custody of anti-Gaddafi fighters for the past 24 hours. The rebels have also claimed that two of Gaddafi's other sons were detained but have provided no evidence. Meanwhile, details have emerged that U.S. and NATO forces played a key role in the Libyan rebel push into Tripoli, carrying out 17 predator drone strikes and 38 air strikes since August 10. Overall the U.S. have carried out 1,210 air strikes and 101 predator drone strikes in Libya since April 1. NATO says it will keep up pressure on Gaddafi, and that its &quot;mission is not over yet.&quot; We are joined by Phyllis Bennis who is a fellow at the Institute for Policy Studies.\n\n\n- Over 160 Arrested in Ongoing Civil Disobedience Against Keystone XL Tar Sands Oil Pipeline\n\nFifty-two environmental activists were arrested Monday in front of the White House as part of an ongoing protest calling on the Obama administration to reject a permit for the 1,700-mile Keystone XL pipeline project, which would deliver Canada tar sands oil to refineries in Texas, and rather focus on developing clean energy. An estimated 2,000 people have signed up to hold sit-ins and commit other acts of civil disobedience outside the White House everyday for the next two weeks - 162 have already been arrested since Saturday. Also joining the protest are indigenous First Nations communities in Canada and landowners along the Keystone XL pipeline's planned route. An editorial in Sunday's New York Times joined in calling on the State Department to reject the pipeline, noting that the extraction of petroleum from the tar sands creates far more greenhouse emissions than conventional production. Meanwhile, oil-industry backers of the project emphasize what they say are the economic benefits of the $7 billion proposal. As the Obama administration remains undecided whether to approve the Keystone XL pipeline, we speak with Bill McKibben who joins us from Washington, D.C., where he was released Monday after spending two nights in jail. He is part of Tar Sands Action, a group of environmentalists, indigenous communities, labor unions and scientific experts, calling for action to stop the project. &quot;This is the first real civil disobedience of this scale for the environmental movement in ages,&quot; McKibben says.\n\n\n- Covering Up Wall Street Crimes: Matt Taibbi Exposes How SEC Shredded Thousands of Investigations\n\nAn explosive new report in Rolling Stone magazine exposes how the U.S. Securities and Exchange Commission destroyed records of thousands of investigations, whitewashing the files of some of the nation's largest banks and hedge funds, including AIG, Wells Fargo, Lehman Brothers, Goldman Sachs, Bank of America and top Wall Street broker Bernard Madoff. Last week, Republican Sen. Chuck Grassley of Iowa said an agency whistleblower had sent him a letter detailing the unlawful destruction of records detailing more than 9,000 information investigations. We speak with Matt Taibbi, the political reporter for Rolling Stone magazine who broke this story in his latest article, &quot;Is the SEC Covering Up Wall Street Crimes?&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:451eee353c02465c67b9d53b4a62b9e3d1411002","amp;dn":"Democracy+Now+-+23+aug+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"451eee353c02465c67b9d53b4a62b9e3d1411002","infoHashBuffer":{"type":"Buffer","data":[69,30,238,53,60,2,70,92,103,185,213,59,74,98,185,227,209,65,16,2]},"announce":[],"urlList":[]}}