{"title":"20120210-Freedom Watch.Fox Business Network.CF.avi","uid":7028669,"size":354151168,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:479b11011552cbc9e689b4d77c98585ce1e18123&amp;dn=20120210-Freedom+Watch.Fox+Business+Network.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1329155795,"description":"----------\nJudge Andrew Napolitano's Freedom Watch\n\nFox Business Network\n2012, February 10, Friday\n\nXvid/MP3 AVI - Transcoded from a medium-quality ReplayTV stream.\n----------\n\n[uploader note and opinion:]\nThis show apparently will end with the broadcast of 20120217.\n\nI kinda had a feeling that the show's not-so-subtle promotion of Ron Paul would ultimately land it in trouble, if that's played a role. What gives me that idea is my observation of the tone of FNC's and FBN's other programs. Regarding Ron Paul, they range from just tolerating to what sometimes borders on being belligerently dismissive.\n\nNotwithstanding that crackpot conspiracy, it seems the show's had consistently awful ratings. The core group of loyal viewership is getting vocal, but they represent too small an audience to, by themselves, cement the show's viability. Ratings are king, in the end. Red Eye, The Five, and Stossel on FBN get more autonomy, because they pull in the ratings.\n\nBut this only goes so far, the vision for the networks that the owner and the management want to have can ultimately intrude, regardless of ratings. Glenn Beck was riding high, falling off somewhat has he got comfortable enough to be more openly religious. FNC did not want to become a source of such evangelism (or at least Beck's brand of it), and killed off his show, that even past its peak was still doing decent numbers.\n\nI'm not on board with the movement to try to save FW (though the execs should receive the feedback in any case). Judge Nap was not being used to his best strengths on the program. The show itself each night strove frenetically to do too much, and cover too much. I found it some nights droll to watch as it covered too many topics each night to too shallow a depth, and over-relied on interviews with politicians. It was low hanging (but often overripe) fruit. Its pace left the important things (mostly the stuff shown in the &quot;Freedom Files&quot; segments) without enough coverage. (It can also be said that the style and format chosen for FW was cheap to produce, as compared to another format that might require more investigative fieldwork, or any fieldwork.)\n\nHis &quot;The Plain Truth&quot; segments getting a minute or so extra recently have been a bright spot. Not that I can claim to know any better, before the new year, I emailed the show with a number of my own suggestions to possibly help FW become a more thought-provoking and engaging show. I'll never know how or if those ideas were considered. Though it ought to be, it's hard to make the cause of liberty the stuff of mass audience attraction. In the details it is often very propeller-head stuff, filling a certain niche.\n\nFor me, one thing is clear: I'm sorry to see FW face the axe, but Napolitano is more than the show was able to allow him to express. It has not been his best outlet, just his most novel. While we've been treated to more of him, which has been great fun, I have to think there is a better way for him to communicate his message.\n\nHowever we receive it, sharing it locally will help that message to grow and become known, and hopefully understood. Small and consistent changes are what change attitudes and the culture.","torrent":{"xt":"urn:btih:479b11011552cbc9e689b4d77c98585ce1e18123","amp;dn":"20120210-Freedom+Watch.Fox+Business+Network.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"479b11011552cbc9e689b4d77c98585ce1e18123","infoHashBuffer":{"type":"Buffer","data":[71,155,17,1,21,82,203,201,230,137,180,215,124,152,88,92,225,225,129,35]},"announce":[],"urlList":[]}}