{"title":"nst-2.15.0-2515.i686.iso","uid":6594826,"size":1392508928,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:4b27d5d0cd9d5bbab4ff71ba662b565c128a09f9&amp;dn=nst-2.15.0-2515.i686.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cestpasgagne2","files":1,"time":1312976007,"description":"Welcome to the Network Security Toolkit (NST). This bootable ISO live CD/DVD (NST Live) is based on Fedora. The toolkit was designed to provide easy access to best-of-breed Open Source Network Security Applications and should run on most x86/x86_64 platforms.\nThe main intent of developing this toolkit was to provide the network security administrator with a comprehensive set of Open Source Network Security Tools. The majority of tools published in the article: Top 100 Security Tools by INSECURE.ORG are available in the toolkit. An advanced Web User Interface (WUI) is provided for system administration, navigation, automation, geolocation and configuration of many network and security applications found within the NST distribution. In the virtual world, NST can be used as a network security analysis, validation and monitoring tool on enterprise virtual servers hosting virtual machines.\n\n      NST Version 2.15.0-2515 Released\n\nWe are pleased to announce the latest NST release: 'v2.15.0'. This release is based on Fedora 15 using Linux Kernel: '2.6.40-4.fc15 - Rebased from latest Linux Kernel: 3.0' . Here are some of the highlights for this release:\n Developed a new interactive dynamic SVG/AJAX enabled Network Interface Bandwidth Monitor application that is integrated into the NST WUI for monitoring pseudo real-time network bandwidth rates.\n Added NST RPM packages and NST WUI integration for the Open Vulnerability Assessment Scanner (OpenVAS) and Greenbone Security tools.\n Added an NST RPM package for IPv6 network security investigation: The THC IPv6 ATTACK TOOLKIT.\n Now supporting the GNOME 3.0 desktop for NST integrated network security applications.\n Refactored all NST integrated services for transistion to the new systemd System and Service Manager for service control.\n By default, now supporting the new Fedora Network Device Naming convention (e.g., eth0 =&gt; p2p1 or eth0 =&gt; em1).\n Many new NST WUI enhancements and refinements.\n\n  As always, the networking and security applications included have been updated to their latest version.\n2011-08-10 02:12:25 UTC by rwhalb\n &lt;a href=&quot;\nhttp://www.networksecuritytoolkit.org/nst/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.networksecuritytoolkit.org/nst/index.html&lt;/a&gt;\n\nsha1sum : 54ff6ec6234715becf6820bbf6bdd32a5c791857  nst-2.15.0-2515.i686.iso      \nmd5sum : fa65530a688ae1bf645b1b02171b5dc4  nst-2.15.0-2515.i686.iso","torrent":{"xt":"urn:btih:4b27d5d0cd9d5bbab4ff71ba662b565c128a09f9","amp;dn":"nst-2.15.0-2515.i686.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b27d5d0cd9d5bbab4ff71ba662b565c128a09f9","infoHashBuffer":{"type":"Buffer","data":[75,39,213,208,205,157,91,186,180,255,113,186,102,43,86,92,18,138,9,249]},"announce":[],"urlList":[]}}