{"title":"Edward the Seventh  (1975 - Part 7)","uid":6588405,"size":522954642,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4bbe29a4dd6f5d2e98f2e4a4b244b552f3a95e6f&amp;dn=Edward+the+Seventh++%281975+-+Part+7%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rosie1966","files":2,"time":1312718176,"description":"Edward the Seventh is a 1975 television drama series, made by ITV in 13 one-hour episodes.\n\nBased on the biography of Edward VII by Philip Magnus, it starred Timothy West as the elder Edward VII and Charles Sturridge as Edward in his youth, Annette Crosbie as Queen Victoria, Deborah Grant and Helen Ryan as Queen Alexandra (the former as a young woman, the latter in later life), Robert Hardy as the Prince Consort, Alison Leggatt as the Duchess of Kent, and Felicity Kendal as Princess Vicky (later Empress Frederick of Germany). It was directed by John Gorrie, who wrote episodes 7-10 with David Butler writing the remainder of the series.\n\nThe series also featured John Gielgud as Benjamin Disraeli, Michael Hordern as William Ewart Gladstone, Harry Andrews as young Edward's tutor Colonel Bruce, Jane Lapotaire as Empress Marie of Russia (sister to Alexandra and mother of Emperor Nicholas II), Christopher Neame as Kaiser Wilhelm II (King Edward's own nephew) and, in one of his earliest roles, Charles Dance as Edward's eldest son Eddy, who died at the age of 28.\n\nThe actresses playing Edward's mistresses include Moira Redmond as Alice Keppel and Carolyn Seymour as Daisy Greville. Francesca Annis was featured in two episodes as Lillie Langtry which led to Butler writing a full series about Mrs Langtry's life for Annis to star in, Lillie.\n\nDespite the title, only the final three episodes dramatised Edward as King (in line with his short, nine-year reign). Timothy West only appeared from episode five onwards. Annette Crosbie, who won a BAFTA for her performance, was given top billing in the series (appearing in ten out of the thirteen episodes).\nIt was first broadcast on TV between April and June 1975. \n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:4bbe29a4dd6f5d2e98f2e4a4b244b552f3a95e6f","amp;dn":"Edward+the+Seventh++%281975+-+Part+7%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bbe29a4dd6f5d2e98f2e4a4b244b552f3a95e6f","infoHashBuffer":{"type":"Buffer","data":[75,190,41,164,221,111,93,46,152,242,228,164,178,68,181,82,243,169,94,111]},"announce":[],"urlList":[]}}