{"title":"HISTORY OF POP AND ROCK MUSIC - part 314","uid":6600938,"size":75614248,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4f24ab959a89d1be84bbe4d356d487bab5049bda&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+314&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1313204990,"description":"                       PART  314\n\n\n         JAMES BLOOD ULMER  -  Are You Glad To Be In America (1980)\n\n\n\n    &quot;Are You Glad to Be in America?&quot; is a song by James Blood Ulmer.  The song originally appears on the James Ulmer's 1980 album &quot;Are You Glad to Be in America?&quot;. The Allmusic review by Nathan Bush awarded the album 4 stars and states &quot;Shards of jazz, rock, funk, and surf guitar are shuffled together and unfurl in frenetic lines. At times the rhythms are too rigid and the results sound like an experiment from which the musicians are trying to break free. At best, the individuals lose themselves in a highly charged dialogue&quot;.\n\n    James &quot;Blood&quot; Ulmer (born February 2, 1942 in St. Matthews, South Carolina) is an American jazz and blues guitarist and singer. Ulmer's distinctive guitar sound has been described as &quot;jagged&quot; and &quot;stinging.&quot; His singing has been called &quot;raggedly soulful.&quot;\n   Ulmer began his career playing with various soul jazz ensembles, and first recorded with organist John Patton in 1969. After moving to New York in 1971, Ulmer played with Art Blakey's Jazz Messengers, Joe Henderson, Paul Bley, Rashied Ali and Larry Young. In the early 1970s, Ulmer joined Ornette Coleman; he was the first electric guitarist to record and tour extensively with Coleman. He has credited Coleman as a major influence, and Coleman's strong reliance on electric guitar in his fusion-oriented recordings owes a distinct debt to Ulmer.","torrent":{"xt":"urn:btih:4f24ab959a89d1be84bbe4d356d487bab5049bda","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+314","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f24ab959a89d1be84bbe4d356d487bab5049bda","infoHashBuffer":{"type":"Buffer","data":[79,36,171,149,154,137,209,190,132,187,228,211,86,212,135,186,181,4,155,218]},"announce":[],"urlList":[]}}