{"title":"Buckshot LeFonque Plus Bonus CD MP3 320kbps [RAR]","uid":6578763,"size":258389494,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:4f86be0a58f65c730c70222bfe60f7448b62d298&amp;dn=Buckshot+LeFonque+Plus+Bonus+CD+MP3+320kbps+%5BRAR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Cheesebreath","files":1,"time":1312320121,"description":"Buckshot LeFonque - A Branford Marsalis Project\n\nLimited Edition contains bonus CD with live remixes by DJ Premier and unreleased material from the European Tour June/July 1995.\n\n\nTracks:\n\n01. Ladies &amp; Gentlemen, Presenting....*\n02. The Blackwidow Blues\n03. I Know Why The Caged Bird Sings\n04. Mona Lisas (&amp; Mad Hatters)\n05. Wonders &amp; Signs*\n06. Ain't It Funny\n07. Some Cow Fonque (More Tea, Vicar?)\n08. Some Shit @ 78 BPM (The Scratch Opera)**\n09. Hotter Than Hot***\n10. Breakfast @ Denny's*\n11. Shoot The Piano Player\n12. No Pain, No Gain\n13. Sorry, Elton\n14. ...And We Out*\n\nProduced by B. Marsalis\n*Produced by B. Marsalis &amp; DJ Premier\n**Produced by DJ Premier\n***Produced by DJ Premier &amp; Blackheart\n\n\nBONUS CD Tracks:\n\n01. Breakfast @ Denny's (Uptown Version)\n02. Breakfast @ Denny's (Live Version)\n03. No Pain, No Gain (Buckethead)\n04. No Pain, No Gain (Salaam Remix)\n05. No Pain, No Gain (Mysto Mix)\n06. No Pain, No Gain (Funky Dave Berry)\n07. Some Cow Fonque (More Tea, Vicar?) (Original Extended Mix)\n08. Some Cow Fonque (More Tea, Vicar?) (Radio Edit)\n09. Some Cow Fonque (More Tea, Vicar?) (Dance Mix)\n\n\n\nLiner Notes:\n\nBranford Marsalis has finally completed the unspeakable ~ an album under his direction which is not in the jazz tradition.\nThis project comes as no surprise to listeners of Marsalis' music, however.\nHis affiliations range from the most comprehensive &amp; respected in jazz to the funkiest &amp; most favored in popular dance music (not to neglect his latest obsession with Italian opera &amp; late 19th century orchestral works).\nUnlike many close-minded party animals who CLAIM to maintain an equal appreciation for &quot;all kinds of music&quot;, Branford Marsalis is a true fan of music &amp; its ability to &quot;transcend life through its honesty.&quot;\nHe would rather discuss baseball than bebop, yet few individuals possess his vast knowledge, intellect &amp; advanced musical conception. (Perhaps that explains why, come to think of it!)\n\nOver the past 12 years, Marsalis has explored every conceivable form of music with a strong reference to jazz &amp; the blues.\nHis latest endeavor is a chronicle of popular music in the 1990's.\nThough some may refer to this recording as a &quot;jazz/hip-hop collaboration&quot; for purposes of qualification, to limit so diverse a musical statement with such a conservative slogan would be a travesty.\nBuckshot LeFonque provides an excellent example of the type of dedication &amp; sincerity that must return to all American music if we are to affect a change in societal values &amp; expectations.\n\nThe conception of blending musical styles is not a new one, but the idea has recently gained much publicity here in America.\nUntil the 1950's, all negro music was retailed under the mundane title of &quot;race records&quot;, thus, classification was not necessary.\nToday's collaborations are conceived more often for marketing purposes than out of a love &amp; compassion for the music.\nAfter thoroughly exhausting about 12 funky grooves - sampled from 1960's R&amp;B hits - hip-hoppers have been relying upon the original source for a fresh new sound.\nIt is understandable that hip-hop would have to claim &amp; develop its own sound before turning to jazz, but in American music, jazz is unavoidable.\nIt is Marsalis' full comprehension of form, content &amp; structure in jazz settings that gives Buckshot such an original sound.\nHe states, &quot;while the music itself has very little to do with jazz, the logic - the way most of the tunes develop - has a lot to do with jazz sensibilities.&quot;\nThe most obvious examples of this idea are &quot;I Know Why The Caged Bird Sings&quot;, &quot;Some Cow Fonque (More Tea, Vicar?)&quot; &amp; &quot;No Pain, No Gain.&quot;\n\nUnlike any other recording of 1994, Buckshot calls forth the fundamental principles upon which this great country was founded.\nOnly a democratic government could include one of the most significant poems in American history; music from blues legend Albert Collins, Elton John, DJ Premier, a host of today's finest jazz musicians &amp; rappers;\na love song, reggae, blues, jazz, hip-hop, rap, rock, heavy metal, an Amharic nursery rhyme, political satire; Maya Angelou; samples from Duke Ellington, John Coltrane, Bukka White, the omni-present James Brown, Fela Kuti....\n\nRapper Chuck D. recently pointed out that rap/hip-hop &quot;is not the place to look for spirituality, because it is a reflection of today's society....and there is no spirituality in the community.&quot;\nBuckshot challenges the accuracy of this statement aswell as that of negroid representation in the media (both general &amp; specific).\nPerhaps there is less of a rapport between our elders, young adults &amp; youth, but surely we have not abandoned our spiritual connection to the motherland.\nBuckshot LeFonque confirms the fact that we are not only a highly spiritual people, but also that we have a responsibility to uphold the fine traditions of all truly great Americans.\nWe must remain triumphant in the face of adversity.  ~ Delfeayo Marsalis\n\nEnjoy &amp; please seed!","torrent":{"xt":"urn:btih:4f86be0a58f65c730c70222bfe60f7448b62d298","amp;dn":"Buckshot+LeFonque+Plus+Bonus+CD+MP3+320kbps+%5BRAR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f86be0a58f65c730c70222bfe60f7448b62d298","infoHashBuffer":{"type":"Buffer","data":[79,134,190,10,88,246,92,115,12,112,34,43,254,96,247,68,139,98,210,152]},"announce":[],"urlList":[]}}