{"title":"Professional Web Video{BBS}","uid":6660929,"size":19970783,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f9fe3ed9022a2d763284c8747f3c76d9d1b1d62&amp;dn=Professional+Web+Video%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315507163,"description":"Add professional-level video to your Web communications toolbox with a complete understanding of the process, potential and limitations of Web video. Step up from the mini-cam experience with this solid introduction to professional planning and production techniques, ensuring that your video meets the same standards you set for every other communication program element. Audio, lighting, editing, encoding, are just a few of the essentials you learn how the pros produce top notch video for the Web. The companion Web site includes planning and production templates, demo files, and blog updates to help you put it all to work for you on a daily basis.\n\n* Production management from soup to nuts in an accessible form\n\n* Full color presents lively, engaging illustrations of the professional team executing every facet of the job\n\n* Companion web site featuring planning and production templates, demo files, and blog updates\nFrom the Back Cover\n\nWant to create professional quality web video that stands out in a crowded playing field? Gain a complete understanding of the opportunity, limitations, production, and distribution process with this book. Step up from the flip-cam experience with this solid introduction to professional planning and production techniques, ensuring that your video meets the same standards you set for every other element in your communication program. Follow the RHED Pixel team as they detail every step of the way with engaging illustrations that demonstrate the process from concept to distribution including: *Preproduction planning of concept, scope, budget, and casting *Web-specific techniques for audio, lighting, and videography *Detailed overview of editing and encoding of web video *Effective branding and storytelling aids including b-roll, images and motion graphics *Distribution alternatives including HTML5, Flash, podcasting, RSS, and website hosting *Effective techniques to promote and monetize your video The companion website-www.HyperSyndicate.com-includes planning and production templates, advanced tutorials, and news updates to help you put it all to work for you.\nSee all Editorial Reviews\nProduct Details\n\n    * Paperback: 306 pages\n    * Publisher: Focal Press; 1 edition (December 7, 2010)\n    * Language: English\n    * ISBN-10: 0240815092\n    * ISBN-13: 978-0240815091","torrent":{"xt":"urn:btih:4f9fe3ed9022a2d763284c8747f3c76d9d1b1d62","amp;dn":"Professional+Web+Video%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f9fe3ed9022a2d763284c8747f3c76d9d1b1d62","infoHashBuffer":{"type":"Buffer","data":[79,159,227,237,144,34,162,215,99,40,76,135,71,243,199,109,157,27,29,98]},"announce":[],"urlList":[]}}