{"title":"07-Ghost (1280x720, HD Anime) ~ Nine-T","uid":6528908,"size":6213502731,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:5157d9ef4a1d83a742d000eaba6c97a4edb2f3b4&amp;dn=07-Ghost+%281280x720%2C+HD+Anime%29+%7E+Nine-T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Nine-T","files":-1,"time":1310253891,"description":"07-GHOST \n\n\nTeito Klein is a former slave who now attends the Barsburg Empire's military academy due to his ability to use Zaiphon, a type of supernatural power. The ability is rare and thus highly prized.\nTeito is an amnesiac who frequently has frightening dreams. After a year at the academy, Teito prepares to take the notoriously difficult graduation exam. The night before the exam, Teito and his only friend, Mikage, swear they will never abandon each other if the other needs help. Both of them pass the exam. The next day, Teito hears people talking about him. Stopping to listen, he suddenly realizes that the speaker, Chief of Staff Ayanami, is the person who killed the familiar man in his dreams: his father, the king of the destroyed Raggs Kingdom. Teito is caught eavesdropping and tries to attack Ayanami but is quickly brought down by one of his subordinates and sent to prison. Mikage comes to help him escape, only to find that Teito has managed to fight past the guards by himself. The two flee the building but are cornered on a balcony. Teito pretends to hold Mikage hostage, threatening to kill him if the guards pursue him, thus making his escape, though he is wounded by a Zaiphon blast that Ayanami directs at him. Three bishops in the nearby 7th District discover the injured Teito and take him to a nearby church to recuperate. Because of the 7th District's law of sanctuary, as long as Teito stays in the church, the army cannot arrest him.\nIn due time, it is discovered that Teito carries the Eye of Mikhail, a powerful talisman for which his home country, the Raggs Kingdom, was destroyed. This fact, as well as a fateful reunion, catapults Teito into a quest for revenge against the Barsburg Empire and for knowledge about his past. At the same time, his status as the bearer of the Eye of Mikhail throws him into the long-standing conflict between the evil Verloren and his enemies, the 07 Ghosts.[1]\n\nThis is a Hatsuyuki Fansub.\n\nHave fun,\nNine-T","torrent":{"xt":"urn:btih:5157d9ef4a1d83a742d000eaba6c97a4edb2f3b4","amp;dn":"07-Ghost+%281280x720%2C+HD+Anime%29+%7E+Nine-T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5157d9ef4a1d83a742d000eaba6c97a4edb2f3b4","infoHashBuffer":{"type":"Buffer","data":[81,87,217,239,74,29,131,167,66,208,0,234,186,108,151,164,237,178,243,180]},"announce":[],"urlList":[]}}