{"title":"PhotoLine.v17.02.Multilingual.Incl.Keymaker-CORE","uid":7022150,"size":19369546,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5196a037771b5fc85355a2c8fb46a13788717a8f&amp;dn=PhotoLine.v17.02.Multilingual.Incl.Keymaker-CORE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Tom_Da_Man","files":5,"time":1328883105,"description":" &lt;a href=&quot;http://www.pl32.com/pages/imag/screenenbig.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.pl32.com/pages/imag/screenenbig.jpg&lt;/a&gt;\n\n\nPhotoLine 17\nPowerful image processing doesn't have to be expensive. PhotoLine is proofing that for many years now. Through its steady progress - in near contact to our users - it offers all modern tools needed for enhancing images.\nWe simply wish, that you like our application, and are looking forward for your suggestions in our user forum.\n\nGeneral Comments\nMain focus of the new version 17 is image processing.\nIn addition, various functions are now faster and many minor improvements have been made.\n\nCommon Functions\nSimple Browse\nThe Simple Browse window is a simplified variant of the normal Browse window. All parts with the exception of the file list have been omitted. The result is a space efficient panel which can stay open all the time.\nIn order to allow navigation, Simple Browse is listing folders in the file list, too. The folder &quot;..&quot; has a special meaning and is used for leaving the current directory. Furthermore the title bar of Simple Browse offers an expandable folder tree.\nAdditionally the context menu of the file list provides access to most important commands of the Browse panel.\n\n\nIn the menu:\nLayout &gt; Image &gt; Trim Image\tTrim Image\nTrim Image removes the transparent edges of an image and thus reduces its size.\nIn the menu:\nTool &gt; Color &gt; Export Color Profile\tExport Color Profile\nYou can use this function to save the color profile embedded in a document.\nIn the menu:\nTool &gt; Color &gt; Selective Color Correction\tSelective Color Correction\nSelective Color Correction is used for adjusting colors in an image. It originally comes from the prepress industry and therefore the correction is limited to the printing colors cyan, magenta, yellow and black. Colors controls which colors will be corrected. You can modify several colors withou leaving the dialog.\n\n\nIn the menu:\nTool &gt; Color &gt; Threshold\tThreshold\nThe function Threshold converts an image to pure black and white. You can define a threshold value, and the parts of the image brighter than that threshold will become white, and the rest black.\n\n\nFunction for &quot;Smart&quot; Removal\nPhotoLine has two tools for &quot;smart&quot; removal:\nthe Remove Brush\nYou mark the area you want to remove with the Remove Brush. It is mainly used for small areas.\nRemove Object\nRemove Object removes the selection. As it offers additional features to influence the result, it is better suited for large areas.\nIf you apply one of these tools, PhotoLine will search for matching image parts in the neighborhood and will insert them instead of the original content. This is a random process, so if you are not satisfied with a result, you can use Retry in the Tool Settings, and you might get a better result.\n\n \tThe Remove Brush\nThe Remove Brush is mainly intended for small corrections.\nThe Remove Brush can work with multiple layers. If you create a new empty layer with transparency above the one you want to correct, you can paint all corrections directly into this new layer. The original image will not be modified.\nYou can use this tool to remove pinples and moles with a single click:\n   \n\n\tRemove Object\nRemove Object deletes the selection. Usually you just have to create a selection and apply the function. In more difficult situations you can control, where PhotoLine should search for replacing image parts.\n\nExample \n\n\nYou have found a nice scene, but the gondola and the mast are disturbing.\n\n\nAt first you are deleting the gondola with the Remove Brush tool.\n\n\nAfter that you are deleting the cables the same way. You don't have to delete a whole cable at once. Instead you can remove it piecewise.\n\n\nBecause the mast is quite large, it is better to select it using the Free Lasso and to delete it with Remove Object.\nMission completed!\nIn the menu:\nLayer &gt; Scale Layer\n\n\n\nScale Layer With &quot;Liquid&quot; Mode\n&quot;Liquid&quot; will not scale the image equally, but instead it will try to keep the size of the important parts and to scale only the unimportant ones. You can create a selection to define the important parts by yourself. The quality of Liquid scaling heavily depends on the scene of the photo.\n \n\nThe original image.\n\n\nThe image horizontally scaled by 50% in a &quot;normal&quot; mode.\n\n\nThe image horizontally scaled by 50% in &quot;liquid&quot; mode.\nAs you can see, with liquid scaling the width of the towers nearly stayed the same. Most of the scaling happened in the place in-between.\n\nNew and Enhanced Tools for Creating Cut-Out Masks\nNew tools make it easier to create cut-out masks:\nThe Mask Brush\nUsing the Mask Brush you can directly edit the mask. It is mainly used for fixing minor glitches.\nThe Quick Selection\nThe Quick Selection is used for semi-automatic creation of cut-out masks.\nThe Border Matting Tool\nWith the Border Matting tool you can cut-out translucent parts of an object. Usually it is used to post-process an already existing selection.\nAside from that there are a view helper functions:\nA Magnifier.\nSelections can be copied with automatic removal of color fringes.\nExtract Selection can be used to enhance the edge of a selection.\n \tThe Mask Brush\nThe Mask Brush is used to edit an existing mask. You don't have to turn on the mode &quot;Edit Mask&quot; in order to do this.\nThe Mask Brush has two subtools. The brush allows editing parts of an image and is adding them to the selection this way. The eraser protects image parts from editing and removes them from the selection. You can access the eraser quickly by holding Alt. You can use the right mouse button, too, if you have configured PhotoLine that way (in the preferences see &quot;Clear with right mouse button&quot;).\n\n\t\nThe Quick Selection Tool\nYou use the Quick Selection tool in two steps. First you create a rectangle enclosing the object. PhotoLine will then automatically start computing a first proposal for the selection. In the second step you repeatedly place object and background marks, until you are satisfied with the result.\n\nInstall:\n=======\n1. Run Setup\n2. Use CORE keygen to generate license\n3. Say thanks!\n\n\n","torrent":{"xt":"urn:btih:5196a037771b5fc85355a2c8fb46a13788717a8f","amp;dn":"PhotoLine.v17.02.Multilingual.Incl.Keymaker-CORE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5196a037771b5fc85355a2c8fb46a13788717a8f","infoHashBuffer":{"type":"Buffer","data":[81,150,160,55,119,27,95,200,83,85,162,200,251,70,161,55,136,113,122,143]},"announce":[],"urlList":[]}}