{"title":"Remember the Alamo (TV) [2004] PBS","uid":7019979,"size":1188202812,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:51ff3d875e21d7c8a60fe1feee783f44387717b0&amp;dn=Remember+the+Alamo+%28TV%29+%5B2004%5D+PBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"ThorntonWilde","files":-1,"time":1328802368,"description":" &lt;a href=&quot;http://bayimg.com/caMDGaAdI&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/caMDGaAdI&lt;/a&gt;\n\nThe American Experience (TV) \n\nRemember the Alamo \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0397758/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0397758/&lt;/a&gt;\n\nOriginal Air Date:2 February 2004 \n\nLong before the Alamo made heroes of Jim Bowie and Davy Crockett and spawned the well-known battle cry, JosÃƒÂ© Antonio Navarro and a group of Tejanos -- Mexicans of Texas who had lived there for generations -- started the battle for Texas.\n\nThe one-hour documentary Remember the Alamo explores the life of the famed Tejano leader and his efforts to protect the sovereignty of his homeland as it passed through the hands of multiple governments.\n\n&quot;After years of research in archives and libraries, and dozens of discussions with descendants and scholars, we have created a film that challenges popular notions of what happened at the Alamo in March of 1836, and in Texas,&quot; says producer Joseph Tovares (Zoot Suit Riots), who is himself a descendant of Tejanos from San Antonio.\n\nHistory books have traditionally painted the battle at the Alamo as a two-sided fight for Texas between the United States and Mexico. Yet inside the Alamo, an old mission in San Antonio, a third group -- Tejanos -- fought alongside Anglo settlers from the U.S. &quot;The irony is that the Alamo is seen as a strictly Anglo-Texan versus Mexican dynamic, when in reality Tejanos initiated the independence movement and developed the principles of independence against the Mexican government,&quot; says historian Andres Tijerina.\n\nMore than two decades before the battle at the Alamo, Tejanos in San Antonio waged a brutal -- and unsuccessful -- rebellion against Spanish rule. At the time, Texas was part of Mexico, which was under Spanish control. Navarro's family helped lead the rebellion. When it was crushed, they and other Tejanos sought refuge in the United States.\n\nBy the time Mexico won its independence from Spain in 1821, Navarro had returned to San Antonio. Poised to lead the Tejanos and Texas, he was quickly appointed mayor.\n\nThat same year, Stephen F. Austin left his home in Missouri and moved to San Antonio with an ambitious plan to lure United States families to Texas through rock-bottom land prices. Foreseeing prosperity for his homeland, Navarro backed Austin's efforts and the two started to work as partners.\n\nAustin's plan succeeded thanks in part to Navarro's ushering a bill through the state legislature that circumvented Mexican anti-slavery laws. The bill's successful passage reassured Southern plantation owners that a move to Texas wouldn't jeopardize their ability to own slaves. But when the number of Anglo settlers in Texas reached 30,000, the Mexican government closed Texas to further immigration.\n\nMeanwhile, in Mexico City, Antonio LÃƒÂ³pez de Santa Anna had assumed the Mexican presidency. A Spanish loyalist who fought at San Antonio in 1813, Santa Anna held a grudge against Texas, Tejano rebels, and Navarro's family.\n\nIn 1834, Santa Anna concentrated power in Mexico City, dissolved all state legislatures and abolished the federal constitution. Tejanos saw Santa Anna's rise to power as a severe blow to Texas sovereignty. Newly arrived immigrants from the U.S. feared that Santa Anna would revoke their settlement contracts and confiscate their slaves. Texans and Tejanos organized and by the end of 1835 succeeded in driving all Mexican soldiers out of Texas. What started as a civil war became an overt movement to separate Texas from Mexico. In February of 1836, Navarro and other Texas leaders gathered at Washington on the Brazos, 150 miles east of San Antonio, to declare independence.\n\nSanta Anna advanced into Texas with 4,000 men, headed for the Alamo, where almost 200 American and Tejano volunteers huddled, awaiting an attack. The now-infamous battle that occurred on March 6, 1836, resulted in a Mexican victory and the death of every last Alamo defender. Not left unscathed, the Mexicans lost 600 men.\n\nSix weeks later, after a surprise attack on the Mexican forces near the San Jacinto river, Texan army commander Sam Houston rallied his troops with the cry, &quot;Remember the Alamo!&quot; Although the battle was won within minutes, the vengeful Texan army -- including Tejanos -- continued fighting for hours, killing any Mexican soldier they found. Santa Anna was captured the following day, effectively ending the war.\n\nFor several years following Texas independence, Tejanos and Anglos shared power in San Antonio. But recent Anglo immigrants from the U.S. were unaware of the Tejanos' contribution to the territory's independence, and felt a common distrust and hatred for all people of Mexican descent. As the times grew worse for his community, Navarro became a champion of Tejano rights. His Apuntes Historicos -- historical notes on the role of Tejanos in Texas independence -- reminded Texans, both Anglo and Tejano, that the fight for Texas had begun generations before the conflict with Santa Anna. Navarro asked that his readers acknowledge the longstanding presence of Tejanos in Texas and to keep their fight for sovereignty in mind as they remembered the Alamo.\n\nRemember the Alamo shows how Tejanos, far from being passive onlookers, actively changed the course of Texas history -- on the battlefield and in the political arena. It recasts the war for Texas independence as a natural extension of the Tejano fight for self-determination and economic freedom.\n\n&quot;This is a tough story for all three parties involved, but especially for the Tejanos. The frontier was a very unforgiving place,&quot; says Tovares, &quot;One can argue with many of the decisions of men like Navarro, but what's important to remember is that they were not bystanders in this fight.&quot;\n\n","torrent":{"xt":"urn:btih:51ff3d875e21d7c8a60fe1feee783f44387717b0","amp;dn":"Remember+the+Alamo+%28TV%29+%5B2004%5D+PBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51ff3d875e21d7c8a60fe1feee783f44387717b0","infoHashBuffer":{"type":"Buffer","data":[81,255,61,135,94,33,215,200,166,15,225,254,238,120,63,68,56,119,23,176]},"announce":[],"urlList":[]}}