{"title":"Ace of Base - The Golden Ratio 2010","uid":6618175,"size":363226621,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:52074ef622c1cd78524ad32beb0917b314c23ee1&amp;dn=Ace+of+Base+-+The+Golden+Ratio+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"barber9","files":-1,"time":1313872685,"description":"Ace of Base-the Swedish pop group most known for their early 90s classics All That She Wants and The Sign-might not have experienced widespread notoriety outside the release of their first album, however the influence they have had on the pop scene thereafter is unquestionable, especially with our generations pop stars growing up during their prime. Though they developed quite a cult following of classic pop music lovers and went on to release multiple albums, the group eventually disbanded and solo projects seemed the best any fan could hope for. However, earlier this year, original member and key writer Ulf Ekberg announced that the group had two new members, Clara Hagman and Julia Williamson, and would be releasing new material after a 7 year hiatus. The new, younger females replaced the face and vocals of Ace of Base, previous members Malin and Jenny Berggren, much to Ace of Base stans dismay. However, after a well-produced first single was sent to European radio and clips from the album started to leak, the group slowly began to remind the pop world that they were back with a fresh AoB sound and still had relevant pop music to make. The resulting album, The Golden Ratio, is the product of this realignment, and Im happy to say it largely succeeds in reestablishing the groups importance in pop music.\n\nAce of Base are back with and unexpectedly strong pop album. They might not get the respect I think they deserve in the music business, especially here in the States, but they are keeping the Swedish tradition of pop music writing alive and well. The record is full of beautiful harmonies and catchy pop hooks that will have you humming them for days. Its weak spot is undoubtedly the lyrics. It seems with AoB the words are just an afterthought with greater emphasis placed on the melody, chord structure, production, and overall fun value. And for the most part I can live with this, however there are times when you have to stop and ask Am I really singing this? That said, if you are a fan of pop music in general, you cannot miss out on this album as yet again, AoB show what good pop music is all about. I feel like the Swedes just know how to write the best pop. To this date, one of my favorite albums is ATeens Teen Spirit, and there are several moments on The Golden Ratio that recall this tradition of sugary sweet pop (ABBA anyone?) while giving enough dance elements to keep with current trends. Need I mention the producers of the moment such as RedOne and Max Martin who also hail from Sweden? The point is, they do pop right, and I hope more American pop artists keep drawing inspiration from records like this one. (popboi.com)\n\n- - - \n\nAce of Base - The golden ratio 2010\n(Stockholm Playground)\n\n 1. All for you \n 2. Blah, blah, blah on the radio \n 3. The golden ratio \n 4. Southern Californa \n 5. Told my ma  \n 6. Black sea \n 7. One day  \n 8. Juliet  \n 9. Precious  \n10. Vision in blue \n11. Mr Replay \n12. Who am I \n13. Doreen\n","torrent":{"xt":"urn:btih:52074ef622c1cd78524ad32beb0917b314c23ee1","amp;dn":"Ace+of+Base+-+The+Golden+Ratio+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52074ef622c1cd78524ad32beb0917b314c23ee1","infoHashBuffer":{"type":"Buffer","data":[82,7,78,246,34,193,205,120,82,74,211,43,235,9,23,179,20,194,62,225]},"announce":[],"urlList":[]}}