{"title":"Market Unlocker Pro v3.2.2.5","uid":7019946,"size":753710,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:5282d300dc61cc2cce3ec077066c372b1d3d717d&amp;dn=Market+Unlocker+Pro+v3.2.2.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"StoneBoyTony","files":-1,"time":1328801277,"description":"Market Unlocker Pro v3.2.2.5\n\n\n*Market Unlocker lets you access paid or restricted apps in Android Market 2.x and 3.x and Amazon Appstore in one click. It's safe, stable, simple and free.*\n\n\nRequires Android: 2.2+ (root)\n \n***Get Root permission\n***Have installed Android market\n***Have installed Amazon appstore (optional)\n\n\nRelease Date: February 7, 2012\n\nFor some apps are just enabled for some specific countries and not available to the other countries,so it is very difficult to download many high quality software. Market Unlocker lets you access paid apps from countries where paid apps are not yet available.\nFeatures:\n\n***Change provider in one click\n***Change provider automatically on boot or switch to flightmode \n***Proxy support for market 3.x. It support HTTP, Socks4, Socks5 proxy and user authentication. \n***Support Amazon Appstore outside USA.\n\nBasic Usage:\n\nClick any list item in &quot;Market&quot; tab to enable Market Unocket. That's all. And you can switch to Home and Proxy table for more functions.\n\nIt is not permanent, will be original after reboot or flight mode! So if you want to back to default market,just reboot or reset flight mode, but you can check &quot;Auto Unlock&quot; to fake it automatically. This option is checked by default.\n\n+++++ IMPORTANT UPDATE +++++\nYou can keep proxy disabled for your market 2.x, only check &quot;Market Unlocker&quot; to enable the function.\n\nTo work with new market 3.x, \n1. Configure a USA (surely you can use other countries ip if they also support to show paid/restriced apps) proxy server and fill into market unlocker. \n2. Enable proxy \n3. Choose provider (optional. by default verizon is selected)\n4. Check &quot;Market Unlocker&quot; to enable function. \nThat's all. Open Android market again, paid apps now are back to you. Good luck!\n\n+++++ New update since version 3.0.8 +++++ \nAmazon Appstore is supported. \n\nBasically Amazon appstore does not allow users to buy paid apps from outside USA, even if users have been registered use US credit card and US address. \n\nMarket Unlocker can also set a USA proxy for Amazon appstore to help you buy daily free apps as well as paid apps. \n\nTo achieve this:\n\nFirst install Appstore app, otherwise the function checkbox will not be visible.\n1. Go to Proxy tab\n2. Configure Proxy Type, Proxy Host, Proxy Port. Please make sure you're using an effect USA proxy server first.\n3. Check &quot;Involve Amazon Appstore&quot; button\n4. Enable &quot;Enable Proxy&quot; to &quot;ON&quot;\nThen open Appstore again, it should now work for you.\n\nNote: There's no need to enable &quot;Enable Unlocker&quot; for Amazon Appstore.\n\n\nQ&amp;A:\n\nQ:where I can find free USA proxies? and why don't you provide proxies in this app?\nA:search google. one example, http://proxy-ip-list.com/free-usa-proxy-ip.html. As they maybe frequently expire or be blocked, it does not make sense, even if leeching them automatcally somewhere. \n\nQ:why I need use an USA proxy?\nA:market 3.x is checking your ip address country. fake provider does not work any more. we need make it looks like a us user as well(from usa). \n\nQ:why I can not connect to Market after enable proxy?\nA:proxy server is broken or not supporting your request. try another proxy or disable proxy for free apps installation.\n\nQ:why I enabled proxy, but still no paid apps visible to me?\nA:you might have used a non-us proxy.\n\nQ:How can I get a working US Amazon account?\nA:Get a US billing adress and creditcard. If you don't have that you should generate the info from a site like this: Fake Name Generator(http://www.fakenamegenerator.com/\n). Keep in mind though that you won't be able to buy anything with it, but you can download the free apps of the day.\n\nQ:Why I cannot see some Apps even if everything looks working fine?\nA:Go to Android Market Setting, change content filter in market to unlimited, then go back to show all and market refresh in US mode. (Thanks Leonardo Gandini for the suggestion)\n\nmore can be found at http://mu.evanhe.com\n\nCredits to:\n\nProxyDroid\nMarketAccess\n\nWhat's in this version:\n\n- Enhanced market detecting to reduce annonying notifications\n- Removed background phone state service\n- Improved configuring market process\n- Improved to show active GSM operator instead of configured one\n- Introduced new option Google payment for upgrade to pro version\n- Support page:http://mu.evanhe.com/\n\n\n\nNote:\nModified to pro version. You will get Market Unlocker without any advertisement permanently. And unlimited times to fetch an USA proxy automatically.\n &lt;a href=&quot;\nhttps://market.android.com/details?id=com.evanhe.marketunlocker&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://market.android.com/details?id=com.evanhe.marketunlocker&lt;/a&gt;\n\nEnjoy and SeeD","torrent":{"xt":"urn:btih:5282d300dc61cc2cce3ec077066c372b1d3d717d","amp;dn":"Market+Unlocker+Pro+v3.2.2.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5282d300dc61cc2cce3ec077066c372b1d3d717d","infoHashBuffer":{"type":"Buffer","data":[82,130,211,0,220,97,204,44,206,62,192,119,6,108,55,43,29,61,113,125]},"announce":[],"urlList":[]}}