{"title":"Friedemann - The Concert","uid":6516455,"size":739834207,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:537e3d98597e64625a3dd08712056593adb7db8b&amp;dn=Friedemann+-+The+Concert&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"piggsy","files":1,"time":1309847048,"description":"brief: Instrumental blend of folk, jazz, pop &amp; chamber music\n----\n\n\nFriedemann - The Concert (2005)\n\nPerformers: Friedemann, guitar; Markus Fuller, drums &amp; percussion; Emmanuel SÃƒÂ©journÃƒÂ©, marimba/vibes/percussion; Philippe Geiss, soprano &amp; alto sax/percussion; Kurt Eisfeld, keyboards\nStudio: Biber Records 76787\nVideo: 16:9 anamorphic, color\nAudio: DD 5.1, PCM stereo\nExtras: &quot;The Story So Far&quot; (Illustrated Bio) (23 min.)\nLength: 115 minutes\nRating: ****\n\nGuitarist Friedemann is more of a European phenomenon, so North American viewers might want to start off by acquainting themselves with highlights of his career by first looking at The Story So Far, which has footage, stills and music from his work starting in 1967, singing Mr. Tambourine Man in his home town of Freiburg. \n\nFriedemann has recorded eight solo albums since 1987 and this quintet brings together musicians from Germany and France in a type of tuneful and comfortable instrumental music blending folk, pop and jazz together with a chamber music feeling.  Some of the 19 tunes - especially when Geiss solos on soprano sax - reminded me of some of Paul Winter's efforts. The band breaks up the somewhat similar sound of many of the tunes with a couple rather avant performance-piece activities, such as a piece for six lighters and another for two snaredrummers' stick dance. There are also nature-view video projections on a large screen behind the band for some tracks. Both video imaging and the surround sound mix are first rate.  \n\nTrackList: The Rusty Knight, Once in the Black Forest, The Samurai who decided to die, Six Baguettes, The Stallion's Dream, Memories of Lugnosod, Venin, Blow with the Wind, The Lady from Yonder Hill, One Summer Eve, Sparks, Sunshower, He who walks alone, Sourdos, The Eye of the Dragonfly, Toledo IV, Passion and Pride, Jungle Tune, Lament of the White Goddess (encore)","torrent":{"xt":"urn:btih:537e3d98597e64625a3dd08712056593adb7db8b","amp;dn":"Friedemann+-+The+Concert","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"537e3d98597e64625a3dd08712056593adb7db8b","infoHashBuffer":{"type":"Buffer","data":[83,126,61,152,89,126,100,98,90,61,208,135,18,5,101,147,173,183,219,139]},"announce":[],"urlList":[]}}