{"title":"Computer-Aided Forensic Facial Comparison {BBS}","uid":6644986,"size":27389223,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:539a7797c501741903672a62e35f110d4c0b0151&amp;dn=Computer-Aided+Forensic+Facial+Comparison+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1314911145,"description":"Countless facial images are generated everyday through digital and cell phone cameras, surveillance video systems, webcams, and traditional film and broadcast video. As a result, law enforcement and intelligence agencies have numerous opportunities to acquire and analyze images that depict persons of interest. Computer-Aided Forensic Facial Comparison is a comprehensive exploration of the scientific, technical, and statistical challenges facing researchers investigating courtroom identification from facial images.\n\nSupported by considerable background material, research data, and prototypic statistical and applications software, this volume brings together contributions from anthropologists, computer scientists, forensic scientists, and statisticians. Topics discussed include:\n\n    * Face database collection in 3D\n    * Error and distinguishing power associated with craniofacial landmarks\n    * Statistical analysis of face shape variation\n    * Comparison of instrumentation\n    * Court admissibility issues\n    * Missing data\n    * Computer applications development\n\nBased on the quantification and analysis of more than 3000 facial images, this seminal work lays the foundation for future forensic facial comparison, computer applications development, and research in face shape variation and analysis. Using experimental and real case data, it demonstrates the influence of illumination, image resolution, perspective, and pose angle on landmark visibility. Two DVDs are included which contain the raw 3D landmark datasets for 3000 faces, additional datasets used in 2D analysis, and computer programs and spreadsheets used in analysis and in the development of prototypic applications software.\n\n\n\n# Hardcover: 209 pages\n# Publisher: CRC Press; 1 Har/Dvdr edition (Mar 26 2010)\n# Language: English\n# ISBN-10: 1439811334\n# ISBN-13: 978-1439811337","torrent":{"xt":"urn:btih:539a7797c501741903672a62e35f110d4c0b0151","amp;dn":"Computer-Aided+Forensic+Facial+Comparison+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"539a7797c501741903672a62e35f110d4c0b0151","infoHashBuffer":{"type":"Buffer","data":[83,154,119,151,197,1,116,25,3,103,42,98,227,95,17,13,76,11,1,81]},"announce":[],"urlList":[]}}