{"title":"Democracy Now - 08 sep 2011","uid":6661630,"size":455149003,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:54dbb2c93913e1e406ff59b5c37e665092648946&amp;dn=Democracy+Now+-+08+sep+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1315530591,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Sep 08, 2011\n\n- Gaddafi Denies Libya Departure, Urges More Fighting\n- Western Firm Negotiated to Arm Gaddafi Regime Before Uprising\n- Syrian Forces Kill at Least 20 in Homs in Ongoing Crackdown on Protest Movement\n- GOP Contenders Clash in Debate; Perry Blasts Social Security as &quot;Ponzi Scheme&quot;\n- Obama to Deliver Jobs Speech; Some GOP Lawmakers Won't Attend\n- Nearly 100 Ex-Staffers for Congressional &quot;Super Committee&quot; Members Now Working as Lobbyists\n- Ex-CIA Lawyer: Obama Changed &quot;Virtually Nothing&quot; from Bush Admin on Terror Policies\n- U.S. Pressures Palestinians to Drop Statehood Bid\n- Bahrain Releases Hunger-Striking Medical Workers from Detention\n- Honduran Resistance Leader Slain\n- Students Protest Former Defense Secretary Robert Gates at University of Texas\n- 5 Dead in Tri-State Shooting Spree\n\n\nSpecial reports\n\n- Texas Faces Massive Wildfires, Record Drought as Gov. Rick Perry Denies Existence of Global Warming\n\nTexas Gov. Rick Perry was back on the campaign trail at last night's Republican presidential debate, where he questioned the science behind human-caused global warming. On Wednesday, Perry announced he was returning home to focus on a historic wildfire season in which some 3.6 million acres have burned-an area larger than the size of Connecticut. Perry has used the crisis to complain the federal government is not acting fast enough to assist firefighters, but critics have been quick to note the governor has slashed the budget for the Texas Forest Service, the first line of fire defense for most of the state. The wildfires come amidst a record drought. The state has seen its driest consecutive months since record keeping began in 1895, and the impact on the state's agricultural industry has been devastating. We speak with Forrest Wilder, reporter with The Texas Observer. His latest article on this is &quot;Texas' Permanent Drought: Our Water Deficit Didn't Start with this Drought. And It Won't End with this Drought.&quot;\n\n\n- Epitaph for Another 9/11: Renown Writer Ariel Dorfman on 1973 U.S.-Backed Coup in Chile\n\n&quot;That September 11, that lethal Tuesday morning, I awoke with dread to the sound of planes flying above my house. When, an hour later, I saw smoke billowing from the center of the city, I knew that life had changed for me, for my country, forever.&quot; Those are the words of our guest, Chilean-American author Ariel Dorfman, writing not about the September 11 attacks on the World Trade Center and the Pentagon 10 years ago this week, but another September 11. On September 11, 1973 a U.S.-backed coup in Chile led by General Augusto Pinochet ousted Chile's democratically elected president, Salvador Allende. Allende died in the palace on that day. Ariel Dorfman served as a cultural adviser to Salvador Allende from 1970 to 1973. After the coup, he went into exile, and today he is recognized as one of Latin America's greatest writers. &quot;Chile reacted to the terror that was inflicted upon us with nonviolent resistance. In other words, for instance, we did not go and bomb Washington because Washington had ordered and helped to create the coup in Chile. On the contrary, we created a peaceful revolution against Pinochet,&quot; Dorfman notes. &quot;If you contrast that to the United States, to what Bush did as a result of this very small band of terrorists, the results have been absolutely terrible. If this was a test-and I think great catastrophes are always tests of national values and national will-alas, the United States has failed that test terribly.&quot;\n\n\n- A Fateful Day: 9/11 Also Marks Important Anniversaries in India, Guatemala, Haiti and Attica, NY\n\nOn the anniversary of the 2001 attacks on the World Trade Center and the Pentagon, we look back at several national and international events linked to that day. This year on September 11, India will mark the 105th anniversary of Mahatma Gandhi launching the modern nonviolent resistance movement. We play part of a 2003 interview with Gandhi's grandson, Arun. On September 11, 1990, renowned Guatemalan anthropologist Myrna Mack was assassinated in Guatemala City. She had been stalked for two weeks prior to her death by a U.S.-backed military death squad in retaliation for her work to expose and document the destruction of rural indigenous communities by U.S.-backed state forces and allied paramilitary groups. We play part of a 2003 interview with Myrna's sister Helen Mack, who has fought tirelessly to bring justice to people killed by high-ranking Guatemalan officials in the armed forces. On September 11, 1993, in the midst of the U.S.-backed coup in Haiti, Antoine IzmÃƒÂ©ry was dragged out of a church by coup forces and murdered in broad daylight. He had been commemorating a massacre of parishioners at the Saint-Jean Bosco Church that had occurred five years earlier on September 11, 1988. Father Jean-Bertrand Aristide narrowly escaped death in that attack, and later became president of Haiti. We play an excerpt from a 2004 Democracy Now! interview with Haitian President Jean-Bertrand Aristide about the attack. We also play a portion of the film &quot;Ghosts of Attica,&quot; about Frank &quot;Big Black&quot; Smith, a prisoner who played a prominent role in the September 9, 1971, Attica prison rebellion and who was tortured by the troops who crushed the uprising days later.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:54dbb2c93913e1e406ff59b5c37e665092648946","amp;dn":"Democracy+Now+-+08+sep+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54dbb2c93913e1e406ff59b5c37e665092648946","infoHashBuffer":{"type":"Buffer","data":[84,219,178,201,57,19,225,228,6,255,89,181,195,126,102,80,146,100,137,70]},"announce":[],"urlList":[]}}