{"title":"Hentai /  After Class Lesson  eps 1-2-3","uid":6583418,"size":1568517165,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:556ca21770956bc3543450e913d72d24631da08e&amp;dn=Hentai+%2F++After+Class+Lesson++eps+1-2-3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jimevjr","files":6,"time":1312518563,"description":"Japenese with English subs UNCEROSORED\n\nAfter Class Lesson - Vol 1 [Japanese](Episode 1)\n\nRyuji Shibui known also as The Squid, is a very strange man. Although he is an older man, he has never \ndated anyone and in fact, is still a virgin. Well his lifestyle is about to change thanks to the mischief \nof Ayumi Amakawa, a cheerleader. After getting a taste of pleasure that can only be experienced through \nsex, his ambition now grows with excitement of finding another girl to have sex with. How far will The \nSquid go to fulfill his desires? Japananime is proud to announce After Class Lesson Volume One, a popular \nanime feature based on Bishop's unbelievable game.\n\n\nAfter Class Lesson - Vol 2 [Japanese](Episode 2)\n\nThe school's idol, Akiari Mizuno, is now The Squid's personal toy. However, his ambitions doesn't end \nthere. Now he's after two new girls: Shizune Fujiwara, a very bright,energetic girl and Rei Hikawa, the \nschool's elite tennis player. At the same time The Squid's first victim, Ayumi Tenkawa, does everything \nto support her love, but at the same time a dark and gloomy emotion begins to build up inside her...\n\n\nAfter Class Lesson - Vol 3 [Japanese](Episode 3)\n\nThe Squid's ambition continues to grow and now he has his eyes on his enemy, Miss Hayakawa. It's not an \neasy battle for him to win, but The Squid has a thing or two up his sleeve, especially when he has his \npast victims to be his pawn. However, things take a different turn when someone betrays him! Who is the \none betraying him? Will he conquer his ultimate ambition? You will be shocked by how this movie ends, don't \nmiss the final chapter of After Class Lesson 3!","torrent":{"xt":"urn:btih:556ca21770956bc3543450e913d72d24631da08e","amp;dn":"Hentai+%2F++After+Class+Lesson++eps+1-2-3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"556ca21770956bc3543450e913d72d24631da08e","infoHashBuffer":{"type":"Buffer","data":[85,108,162,23,112,149,107,195,84,52,80,233,19,215,45,36,99,29,160,142]},"announce":[],"urlList":[]}}