{"title":"(Blues) Cary Hudson - Bittersweet Blues","uid":6608173,"size":112511590,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:556fa79805a3c2c6c4e0a8a48567d095be06ceb4&amp;dn=%28Blues%29+Cary+Hudson+-+Bittersweet+Blues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nightissuchproximity","files":-1,"time":1313494057,"description":"mp3   320kbps\n\n\nStyles: Acoustic blues\nReleased: Feb 2007\nLabel: Black Dog\nArt: front cover\n\n\n1. Snow in Mississippi [5:18]\n2. Epitaph [3:57]\n3. Passing By [2:54]\n4. Pray for Peace [3:44]\n5. Sleeping Under the Stars [3:41]\n6. Song in C [5:04]\n7. Shoofly Blue [3:42]\n8. Just Stuff [3:14]\n9. Berlin Blues [3:18]\n10. 2 &gt;1 [4:39]\n11. Freight Train [2:46]\n12. Love Can Find a Way [4:27]\n\n\n&quot;Time is a circle, that's what I've found, everything that happens is going to come back around,&quot; Cary Hudson muses on the opening track to his first acoustic solo album. The singer/songwriter strips down even farther from his last release, 2004's Cool Breeze, which itself was scaled back from his searing electric work with his old band Blue Mountain. The title of this one lays it out; it's a pensive, bluesy reflection on a life in music, and life in general. The disc is summed up by the metaphor of fleeting moments, like &quot;Snow in Mississippi.&quot; This riveting set of a dozen folk/blues tunes is a predominantly one-man project. It's a perfect venue for these introspective, somewhat melancholy but more often world-weary snapshots of Hudson's life and experiences. His somber yet generally upbeat vocals give the impression that for all his trials, tribulations, frustrations, and bad breaks, he looks at the glass as half full. &quot;Sleeping Under the Stars&quot; illustrates the simple pleasures of the titular activity. The country-blues of Elizabeth Cotten's &quot;Freight Train,&quot; the disc's only cover, relates the tale of a hobo, sung from the first person, who revels in his love of trains even as he contemplates his mortality. The aftermath of Hurricane Katrina is the focus of both the hopeful &quot;Love Can Find a Way&quot; and &quot;Just Stuff,&quot; a rather surprisingly upbeat reflection on the storm's tragedy and how Hudson blamelessly dealt with it. &quot;Shoofly Blue&quot; brings a hint of electric guitar to a lovely, languid look at summer in the deep South, skillfully reflected in the song's lazy groove. Writing about Elvis is fraught with the trapdoors of clichÃƒÂ©s, but Hudson pulls it off beautifully on &quot;Epitaph.&quot; In just under four minutes, Presley's life and death is recounted, yet by never using his name, Hudson makes it a universal tale of missed opportunities. &quot;Being domesticated is overrated,&quot; he sings on &quot;Passing By,&quot; expressing his wanderlust and need to stay on the road. Thankfully, he stopped long enough to record this set of righteous, heartfelt tunes. It's a terrific addition to his already impressive catalog of dusky Americana, and shows that age and reflection add depth and subtlety to his work. \n\n","torrent":{"xt":"urn:btih:556fa79805a3c2c6c4e0a8a48567d095be06ceb4","amp;dn":"%28Blues%29+Cary+Hudson+-+Bittersweet+Blues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"556fa79805a3c2c6c4e0a8a48567d095be06ceb4","infoHashBuffer":{"type":"Buffer","data":[85,111,167,152,5,163,194,198,196,224,168,164,133,103,208,149,190,6,206,180]},"announce":[],"urlList":[]}}