{"title":"BBC Predators Killing for a Living 12of13 Cold-Blooded Killers X","uid":6625099,"size":854814720,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5648b0207096ca0d69c357ad5e53bf73e010ba7d&amp;dn=BBC+Predators+Killing+for+a+Living+12of13+Cold-Blooded+Killers+X&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MVGroup","files":-1,"time":1314131191,"description":"Predators - Killing for a Living\n\nNature Documentary hosted by Anthony Hopkins and John Shrapnel, published by BBC in 1997 - English narration\n\n\nInformation\n------------------------------\n\nIn the animal kingdom, it's kill or be killed on a daily basis, as creatures struggle to survive and vicious cycle of life and death is an everyday event in the wild. This documentary series chronicles the different yet lethal techniques used in this dance of death, from animals that work in well-organized gangs to lone killers that capture prey using camouflage and the element of surprise.\n\nNarrated by Anthony Hopkins &amp; John Shrapnel\nWriter : David Helton\nSeries Producer : Caroline Baker\n\nA Wildvision Production for BBC Worldwide in association with The Discovery Channel (1997)\n\n\n1)  Dining Alone \nLone predators have developed an amazing range of means to survival. The speed of cheetah, snake venom and the ability of leopard to lie in ambush are examples of refined instincts needed when hunting alone.\n\n2)  Dressing for Dinner \nPredators and catch use large numbers of clever ways to trick each other. They include misrepresentation, nets and traps. Players in this game of death are praying mantis, shooter fish, mastophoreae-cross spider and stalking squids.\n\n3)  Company of Killers \nGroup hunting guarantees catch, and living in community is favourable basis for defense . In this episode we will see the life of plundering lions, hyenas and wild dogs in packs, as well as potential preys like bulls, meerkats and puffins.\n\n4)  Ocean Peril \nAll sea creatures have developed their own ways to kill and to avoid being killed. Beside visual, hearing and smelling sense there are also specific ways for species such as dolphins sonar to find hidden fish, or angel shark's cunning disguise.\n\n5)  Flight to the Death \nPredatory birds are the most powerful and skilled beasts in the sky. Each species has its own way to obtain meals. Curved beak, claws to kill and a great vision are only part of their arsenal of deadly weapons.\n\n6)  The Killing Queen \nLion is arguably the most important predator in the African savannah. But among them the female lion is the one who works as a killing machine. Female lions namely will do most of the hunting, and beside their herd the hyenas, wild dogs and vultures enjoy the results also.\n\n7)  Rivers of Life Rivers of Death \nThe river is the focal point of all life. But there where is life is also dying, and beneath the river surface the battle between preys and predators continues all the time. We will follow the North American otters and bears hunting for salmon below the melting ice, and we see how the South American piranha gets wild at carcass.\n\n8)  Hunters of the Underworld \nPoisonous scorpions ... spiders with big claws ... myriapods ... armored insects ... Here are just some of the crawling creatures that stalk prey in the shadows beneath and around our feet.\n\n9)  Killers of the Dark \nNocturnal creatures are having an arms race. Their weapons are not offensive or defensive, but an espionage equipment. Some use night vision and take full advantage of the moon and the stars in low light, while others use a fine-tuned smell and touch senses. There are animals whose ears are more sensitive than any microphone and the creatures who observe their surroundings with three-dimensional sonars or electro-magnetic sensors. Some even produce light: a trap that attracts their prey to death.\n\n10)  Sharks \nWe will see the lives of sharks both as predators and prey. Amount of shark species is enormous, and they are amazingly different in shapes, sizes, and each species of sharks have their own way to live and work. We look sharks as skillful predator and keen opportunist, as well expose the secrets of these misunderstood predators which often are considered as evil.\n\n11)  Murder in the Family \nWe look at the animals that kill representatives of their own species. The story begins with chickens which barely after hatching from egg begin the struggle of life. As the animal grows the battle continues: food, power, possibility to copulate. Any of these fights may end in death. The circle is rotated back: male may kill their partners offspring to get mating. But not all the animals are violent. At the end of the program we visit communities which instead killing their own species rather live in perfect harmony, where males and females, adults and offspring, brothers and sisters work together.\n\n12)  Cold-Blooded Killers \nTyrannosaurus rex, &quot;Terrible Lizard King&quot;, lives in our imagination as the greatest beast ever to have walked on Earth's surface. Maybe it's good that T. rex is extinct, but many still existing animals have ancestors who passed the same terrain with this monstrous predator. Many of them have fared well and are equally adept predators as carnivore dinosaurs once were. Which ones are the real heirs of the king's crown? In this detective story we are tracing the closest surviving offspring of this remarkable beast. And the results are amazing.\n\n13)  People as Prey \nEvery day and every moment the people who live close to wild animals are likely to face a sudden and violent death. The chance to die at wild animals jaws is very small, but it does little to comfort the victims. This film examines this serious matter lightly, and it raises some very difficult questions. The program is like a trial, where the animal kingdom is being investigated by people, and where several killers can present a defense speech.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img225.imageshack.us/img225/301","torrent":{"xt":"urn:btih:5648b0207096ca0d69c357ad5e53bf73e010ba7d","amp;dn":"BBC+Predators+Killing+for+a+Living+12of13+Cold-Blooded+Killers+X","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5648b0207096ca0d69c357ad5e53bf73e010ba7d","infoHashBuffer":{"type":"Buffer","data":[86,72,176,32,112,150,202,13,105,195,87,173,94,83,191,115,224,16,186,125]},"announce":[],"urlList":[]}}