{"title":"Birth of Britain - Part 1  (National Geographic 2010)","uid":6634008,"size":735080448,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:594917857e8b64dfef7e801ffef25234ad509bc0&amp;dn=Birth+of+Britain+-+Part+1++%28National+Geographic+2010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rosie1966","files":1,"time":1314477696,"description":"History Documentary hosted by Tony Robinson, published by National Geographic in 2010 - English narration\n\n \n\nInformation\n------------------------------\n\nBIRTH OF BRITAIN WITH TONY ROBINSON:\nDid you know the Grampian Mountains were once taller than Everest and Devon was once a burning hot desert? Lions and rhinos once roamed the banks of the Thames? And the world's purest gold is produced in Wales?\n\nThese are just some of the extraordinary facts under scrutiny from Tony Robinson in the brand new series, Birth of Britain with Tony Robinson. Join him as he ventures into the country's extraordinary and fiery past, revealing how our islands were forged from molten rock, volcanic explosions, ice and seismic upheaval.\n\nTravelling around Britain's spectacular primal landscapes to investigate just how the land came to be the place we live today, Tony finds evidence of lava blasts in the heart of Edinburgh, learns the origins of our very own bling at Britain's only working gold mine and investigates evidence of Britain's deep freezes that left the land locked under ice sheets over a mile thick.\n\n\n1) Hidden Volcanoes \n- Britain has a volcanic past to rival any of the world's current hotspots, and the clues to this explosive prehistory lie beneath some of our most iconic landscapes. Starting out in Edinburgh, Tony treks, sails and flies around the British Isles in search of this fiery legacy to find the forgotten volcanoes that have not only shaped our land, but also forged our history.\n\n2) Ice Age \n- Over the last two-and-a-half million years, Britain has experienced numerous deep freezes that left the land uninhabitable and locked under ice sheets over a mile thick. Tracing the movement of the frozen wastes, Tony visits some of the country's most scenic spots - including the Scottish Highlands and the Lake District - to explore its chilly past. Ending up in London, Tony unearths the bones of monkeys, rhinos and lions that once lived on the banks of the Thames.\n\n3) Gold Rush \n- Gold has been cherished since the dawn of human history and while these islands might be more readily associated with coal or tin, there is a surprising amount of bling lurking in Britain's rocks. Heading to Wales, Tony investigates an ancient Roman mine before visiting Britain's only working gold mine in Northern Ireland. Finally, our host traces the incredible geological forces that created this valuable commodity and pans for gold in Scotland.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:594917857e8b64dfef7e801ffef25234ad509bc0","amp;dn":"Birth+of+Britain+-+Part+1++%28National+Geographic+2010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"594917857e8b64dfef7e801ffef25234ad509bc0","infoHashBuffer":{"type":"Buffer","data":[89,73,23,133,126,139,100,223,239,126,128,31,254,242,82,52,173,80,155,192]},"announce":[],"urlList":[]}}