{"title":"Rare First air 13 Witches Web Series Teaser","uid":7016531,"size":171095712,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:5b00cb355394a398ab41bce5f5b5762b25784f55&amp;dn=Rare+First+air+13+Witches+Web+Series+Teaser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Weirdoxxx","files":-1,"time":1328681780,"description":"From the creator Sabine Mondestin!\n\n13 Witches Press Release\n13 Witches Is an Amazing Story about 13 Sisters who were Persecuted In The 1700s\nThere is an exceptional new Web Series available on the Internet that is called 13 Witches.\nThis web series, profiles the story of 13 sisters who practiced the art of paganism during the 1700s. The sisters were wrongfully accused of being witches, and in turn, they were tortured, punished, and ultimately burned alive at the stake by those that they loved. Only one escaped. Her name was Nemesis Sekhmet. Nemesis struck a deal with the devil in order to have her 12 sisters reincarnated. Centuries later, the sisters have come back and seek revenge on all of those who stole their lives from them.\n The 13 sisters are very sexy, and this web series offers a dark yet comedic take on the thoughts and feelings of persecuting witches during the 18th century. Among Nemesis, played by Sabine Mondestin, the other 12 characters in the web series are Lilith, played by Paula Elle, Isis, played by Natasha Davidson, Persephore, played by Valerie Pauwels, Venus, played by Lea Kovach, Hera, played by Sara Akeera, Eurybia, played by Wanda Ayala, Enyo, played by Adiam Asrat, Pandora, played by Lila Popa, Themis, played by Lolly Watson, Diana, played by Nicole Rockmann, Andromeda, played by Victoria Vice, and Athena, played by Marie E. West. \nThis web series, produced by My Destiny Productions, showcases these 13 sisters as well as the deal Nemesis made with the devil. This web series was created by Sabine Mondestin, and offers a dark, mysterious and sexy take on the classic which tale. 13 Witches is a unique take on the ultimate vengeance against those who have done them wrong. Their quest for total world domination is coupled with a superior storyline, incredibly sexy actresses, and the most unique witch story ever told. Each of the 13 sisters have their own unique personalities, yet they share the same dream of revenge and domination. \nThis web series is currently available to watch on YouTube, and is increasing in popularity with many subscribers. The company that created 13 Witches, My Destiny Productions is located in Canada. This is clearly an up-and-coming production company, and is certainly one to look out for in the future. Despite the fact that you currently cannot watch the entire series of 13 Witches, it is important to become a subscriber so do not miss the show's premiere as well as subsequent episodes. This story is replete with demons, the devil, witches, and ordinary citizens. It is unusual to see such extraordinary talent, storylines, and superior acting on the likes of YouTube. However, 13 Witches may in fact be the sexiest which story ever told. You certainly do not want to miss out on the previews, teasers, and behind-the-scenes episodes of the making of 13 Witches. \nAvailable for viewing on YouTube, 13 Witches can easily be found by a search of YouTube, or by visiting their home website at www.13-witches.com. Discover for yourself the story; learn about the cast and crew, as well as view previews and behind-the-scenes episodes on their website.\nDiscover for yourself the greatest story about Witches that may have ever been told. Check out this new Web Series called 13 Witches, and exceptional horror fantasy.\nCheck out 13 Witches on YouTube, or view them in their home website at www.13-witches.com. See for yourself the amazing story, and learn about the cast and crew as well as review previews, and behind-the-scenes episodes. Do not miss out, as this is likely the best which story ever told.\n","torrent":{"xt":"urn:btih:5b00cb355394a398ab41bce5f5b5762b25784f55","amp;dn":"Rare+First+air+13+Witches+Web+Series+Teaser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b00cb355394a398ab41bce5f5b5762b25784f55","infoHashBuffer":{"type":"Buffer","data":[91,0,203,53,83,148,163,152,171,65,188,229,245,181,118,43,37,120,79,85]},"announce":[],"urlList":[]}}