{"title":"Ugetsu (1953)","uid":7013553,"size":4510187520,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5c1b5c3ac12ac3bcfdf194c1dc1046b12412c16b&amp;dn=Ugetsu+%281953%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Auge","files":-1,"time":1328567138,"description":"I am providing important films in ISO for the film buff or novice film historian. It is nearly impossible to find torrent files that include all the extras or even important commentaries.\nThese files are from my collection of DVDs that I have made from rented movies over the last seven years or so.\nNearly all of them have been put onto a DVD5, so unfortunately I do not have an uncompressed source handy.  That said I can assure you that these look GREAT on larger screens.\nI chose to make them this size for economy as DVD9s were $3 each when I started this and DVD5s were .25 cents each.\nNow I am working on putting some of the best ones on a hard drive to be played with my HD TV Media Player and am still thinking economy is the best rule as these are half the size of ripping a DVD9.\nThis is the best quality for the value.\n\nI would love some productive feedback  . . .   :)\n\nThis is a DVD rip to an ISO so you can watch it on your media player, mount it to a virtual drive or burn it to a DVD.\n\nThis file includes EVERYTHING the original DVD has:\n\n1953\n97 minutes\nBlack and White\n1.33:1\nSpoken Language: Japanese\nSubtitles: Englishs\nAudio commentary by filmmaker, critic, and festival programmer Tony Rayns\nKenji Mizoguchi: The Life of a Film Director (1975), a comprehensive, 150-minute documentary by filmmaker Kaneto Shindo, with new and improved subtitles\nTwo Worlds Intertwined, a new, 14-minute appreciation of Ugetsu by director Masahiro Shinoda\nProcess and Production, a new, 20-minute video interview with Tokuzo Tanaka, first assistant director on Ugetsu\nTen-minute video interview with cinematographer Kazuo Miyagawa, from 1992\nTheatrical trailers\nNew and improved English subtitle translation\n\nAwards:\nAcademy Award \nBest Costume Design Black and White nominee \n\nTIME Magazine\nAll - TIME 100 Movies \n\nSYNOPSIS:  \nQuite simply one of the greatest of filmmakers, said Jean-Luc Godard of Kenji Mizoguchi. And Ugetsu, a ghost story like no other, is surely the Japanese directors supreme achievement. Derived from stories by Akinari Ueda and Guy de Maupassant, this haunting tale of love and loss - with its exquisite blending of the otherworldly and the real - is one of the most beautiful films ever made.\n","torrent":{"xt":"urn:btih:5c1b5c3ac12ac3bcfdf194c1dc1046b12412c16b","amp;dn":"Ugetsu+%281953%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c1b5c3ac12ac3bcfdf194c1dc1046b12412c16b","infoHashBuffer":{"type":"Buffer","data":[92,27,92,58,193,42,195,188,253,241,148,193,220,16,70,177,36,18,193,107]},"announce":[],"urlList":[]}}