{"title":"Fast &amp; Furious 5 (2011) [DVDR9][PAL][Eng-Spa-Ita]","uid":6627563,"size":8247855104,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5c60698af396ba4cc5172c2938eef6902e182f28&amp;dn=Fast+%26+Furious+5+%282011%29+%5BDVDR9%5D%5BPAL%5D%5BEng-Spa-Ita%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":34,"time":1314207155,"description":"Fast &amp; Furious 5 (2011) [DVDR9][PAL][Eng-Spa-Ita]\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1596343/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1596343/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.fastandfurious5.es/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastandfurious5.es/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.fastfive.es/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastfive.es/&lt;/a&gt;\n\n--------\nEnglish:\n--------\nSystem: PAL \nFormat: DVD9 uncompressed \nAudio: Spanish Dolby Digital 5.1, English Dolby Digital 5.1, Italian Dolby Digital 5.1, English Dolby Digital 2.0 for the director's commentary\nSubtitles: English, Spanish, Portuguese, Romanian, Croatian, Slovak \nAspect Ratio: 16:9 \n  \nEXTRA INFO: \n\n- Deleted Scenes \n- Sheets cars the movie, etc ... \n  \nTitle: Fast &amp; Furious 5 \nOriginal title: Fast Five \nCountry: USA \nUSA release: 29/04/2011 \nReleased in Spain: 29/04/2011 \nReleased on DVD (rental): 24/08/2011 \nStudio: Universal Pictures \nDirector: Justin Lin \nScreenwriter: Chris Morgan \nStarring: Vin Diesel, Paul Walker, Jordana Brewster, Chris &quot;Ludacris&quot; Bridges, Tyrese Gibson, Sung Kang, Gal Gadot, Tego Calderon, Elsa Pataky, Joaquim de Almeida, Dwayne Johnson\nRating: Not recommended for children under 16 years \n\n\nSynopsis: \nVin Diesel and Paul Walker are reunited in this franchise explosive speed. This time, former police officer Brian O'Conner (Walker) will partner with the ex-con Dom Toretto (Diesel) on the opposite side of the law. They will join Dwayne Johnson, Jordana Brewster, Chris &quot;Ludacris&quot; Bridges, Tyrese Gibson, Sung Kang, Gal Gadot, Matt Schulze, Tego Calderon and Don Omar for this career at risk.\n \nSince Brian and Mia Toretto (Brewster) broke with Sun, they have crossed many borders to escape the authorities. Now, holed up in Rio de Janeiro, have to do one last job to win their freedom. Assembled his team of elite runners and will have to face a corrupt businessman who wants them dead.\n \nThe tough federal agent Luke Hobbs (Johnson) never fails in its objective. When assigned to locate Dom and Brian, he and his team relentlessly throw to catch them. But as the persecution is happening, Hobbs realizes he can not distinguish between good and bad. Now he must trust his instincts to corner their prey ... before the others run in the first place.\n \nProduction notes: \nFifth installment of the series' Fast &amp; Furious. &quot;\n\n--------\nEspaÃƒÂ±ol:\n--------\nSistema: PAL\nFormato: DVD9 SIN COMPRIMIR \nAudio: EspaÃƒÂ±ol Dolby Digital 5.1, InglÃƒÂ©s Dolby Digital 5.1, Italiano Dolby Digital 5.1, InglÃƒÂ©s Dolby Digital 2.0 para comentarios del director\nSubtitulos: EspaÃƒÂ±ol, InglÃƒÂ©s, PortuguÃƒÂ©s, Rumano, Croata, Eslovaco\nRelacion de Aspecto: 16:9\n \nINFO EXTRA: \n\n- Escenas eliminadas\n- Fichas de los coches de la pelÃƒÂ­cula, etc...\n \nTÃƒÂ­tulo: Fast &amp; Furious 5\nTÃƒÂ­tulo original: Fast Five\nPaÃƒÂ­s: USA \nEstreno en USA: 29/04/2011 \nEstreno en EspaÃƒÂ±a: 29/04/2011 \nLanzamiento en DVD (alquiler): 24/08/2011 \nProductora: Universal Pictures \nDirector: Justin Lin \nGuiÃƒÂ³n: Chris Morgan \nReparto: Vin Diesel, Paul Walker, Jordana Brewster, Chris &quot;Ludacris&quot; Bridges, Tyrese Gibson, Sung Kang, Gal Gadot, Tego Calderon, Elsa Pataky, Joaquim de Almeida, Dwayne Johnson\nCalificaciÃƒÂ³n: No recomendada para menores de 16 aÃƒÂ±os\n\n\nSinopsis:\nVin Diesel y Paul Walker vuelven a reunirse en esta franquicia de velocidad explosiva. En esta ocasiÃƒÂ³n, el ex policÃƒÂ­a Brian O'Conner (Walker) se asociarÃƒÂ¡ con el ex convicto Dom Toretto (Diesel) en el lado opuesto de la ley. Ellos se reunirÃƒÂ¡n con Dwayne Johnson, Jordana Brewster, Chris &quot;Ludacris&quot; Bridges, Tyrese Gibson, Sung Kang, Gal Gadot, Matt Schulze, Tego Calderon y Don Omar para esta carrera de alto riesgo. \n\nDesde que Brian y Mia Toretto (Brewster) rompieron con Dom, ellos han cruzado muchas fronteras para huir de las autoridades. Ahora, acorralados en RÃƒÂ­o de Janeiro, tienen que realizar un ÃƒÂºltimo trabajo para ganar su libertad. MontarÃƒÂ¡n su equipo de corredores de ÃƒÂ©lite y tendrÃƒÂ¡n que enfrentarse a un hombre de negocios corrupto que los quiere muertos. \n\nEl duro agente federal Luke Hobbs (Johnson) nunca falla en su objetivo. Cuando se le asigna localizar a Dom y Brian, ÃƒÂ©l y su equipo se lanzarÃƒÂ¡n sin tregua para capturarlos. Pero a medida que la persecuciÃƒÂ³n va sucediendo, Hobbs se da cuenta que no puede hacer distinciÃƒÂ³n entre los buenos y los malos. Ahora ÃƒÂ©l tendrÃƒÂ¡ que confiar en sus instintos para arrinconar a su presa... antes de que otros los ejecuten en primer lugar.\n\nNotas de producciÃƒÂ³n:\nQuinta entrega de la saga 'Fast &amp; Furious'.\n\n\n---------\nItaliano:\n---------\nSistema: PAL \nFormato: DVD9 non compresso \nAudio: Spagnolo Dolby Digital 5.1, Inglese Dolby Digital 5.1, Italiano Dolby Digital 5.1, Inglese Dolby Digital 2.0 per il commento del regista\nSottotitoli: inglese, spagnolo, portoghese, rumeno, croato, slovacco \nAspect Ratio: 16:9 \n  \nINFORMAZIONI SUPPLEMENTARI: \n\n- Scene tagliate \n- Fogli auto del film, ecc ... \n  \nTitolo: Fast &amp; Furious 5 \nTitolo originale: Fast Cinque \nPaese: USA \nUSA rilascio: 29/04/2011 \nRilasciato in Spagna: 29/04/2011 \nPubblicato in DVD (noleggio): 24/08/2011 \nCasa di produzione: Universal Pictures \nRegia: Justin Lin \nSceneggiatura: Chris Morgan \nProtagonisti: Vin Diesel, Paul Walker, Jordana Brewster, Chris &quot;Ludacris&quot; Bridges, Tyrese Gibson, Sung Kang, Gal Gadot, Tego Calderon, Elsa Pataky, Joaquim de Almeida, Dwayne Johnson\nRating: Non raccomandato per i bambini sotto i 16 anni \n\n\nSinossi: \nVin Diesel e Paul Walker sono riuniti in questo franchise velocitÃƒÂ  esplosiva. Questa volta, l'ex poliziotto Brian O'Conner (Walker) collaborerÃƒÂ  con l'ex galeotto Dom Toretto (Diesel) sul lato opposto della legge. Essi si uniranno Dwayne Johnson, Jordana Brewster, Chris &quot;Ludacris&quot; Bridges, Tyrese Gibson, Sung Kang, Gal Gadot, Matt Schulze, Tego Calderon e Don Omar per questa carriera a rischio.\n \nDal momento che Brian e Mia Toretto (Brewster) ha rotto con Sun, che hanno attraversato molti confini per sfuggire alle autoritÃƒÂ . Adesso, arenato a Rio de Janeiro, hanno a che fare un ultimo lavoro per vincere la loro libertÃƒÂ . Assemblato il suo team di corridori ÃƒÂ©lite e dovrÃƒÂ  affrontare un uomo d'affari corrotti che li vuole morti.\n \nIl duro agente federale Luca Hobbs (Johnson) non manca mai nel suo obiettivo. Quando viene assegnato per individuare Dom e Brian, lui e la sua squadra senza sosta buttare per catturarli. Ma, come la persecuzione che sta accadendo, Hobbs si rende conto che non puÃƒÂ² distinguere tra buoni e cattivi. Ora deve fidarsi del suo istinto di accaparrarsi le loro prede ... prima degli altri eseguiti in primo luogo.\n \nNote di produzione: \nQuinta rata di 'serie Fast &amp; Furious &quot;.\n","torrent":{"xt":"urn:btih:5c60698af396ba4cc5172c2938eef6902e182f28","amp;dn":"Fast+%26+Furious+5+%282011%29+%5BDVDR9%5D%5BPAL%5D%5BEng-Spa-Ita%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c60698af396ba4cc5172c2938eef6902e182f28","infoHashBuffer":{"type":"Buffer","data":[92,96,105,138,243,150,186,76,197,23,44,41,56,238,246,144,46,24,47,40]},"announce":[],"urlList":[]}}