{"title":"Paycheck [AC3 5.1][dvdrip][spanish]","uid":6573610,"size":1468579840,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5cd47877aeec43a8761b8e513da7a8027ab2c946&amp;dn=Paycheck+%5BAC3+5.1%5D%5Bdvdrip%5D%5Bspanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Black1000","files":-1,"time":1312088450,"description":"Paycheck [AC3 5.1]\n\nAÃƒÂ±o: 2003.\n\nDuraciÃƒÂ³n: 119 min.\n\nReparto: Ben Affleck (Michael Jennings), Aaron Eckhart (Rethrick), Uma Thurman (Rachel Porter), Paul Giamatti (Shorty), Colm Feore (Wolfe), Emily Holmes (Betsy), Joe Morton (Agente Dodge), Michael C. Hall (Agente Klein), Peter Friedman (Ministro Brown), Kathryn Morris (Rita Dunne).\n\nSinopsis\n\nBasada en un relato breve de Philip K. Dick, &quot;Paycheck&quot; cuenta la historia de Michael Jennings (Ben Affleck), un genio famoso en todo el mundo que realiza proyectos especializados para corporaciones de alta tecnologÃƒÂ­a. Cuando termina un trabajo, se borra su memoria para que no divulgue los secretos de la compaÃƒÂ±ÃƒÂ­a. Suelen pagarle muy bien por sus servicios y Jennings espera obtener un total de 4.400 millones de dÃƒÂ³lares por su ÃƒÂºltimo proyecto, en el que ha empleado cinco aÃƒÂ±os de su vida. Pero cuando termina el proyecto, en vez de tan sustancioso cheque se le entrega un sobre lleno de objetos sin valor y se le dice que habÃƒÂ­a aceptado renunciar a cobrar su trabajo. Como su memoria ha sido borrada siguiendo la costumbre habitual, Jennings no puede defenderse. Pero luego descubre que los objetos que ha recibido son pistas sobre su pasado. Con la ayuda de Rachel (Uma Thurman), la mujer que ama y con la que ha trabajado durante los ÃƒÂºltimos tres aÃƒÂ±os, Jennings emprende una carrera contrarreloj para solucionar el rompecabezas de su pasado.","torrent":{"xt":"urn:btih:5cd47877aeec43a8761b8e513da7a8027ab2c946","amp;dn":"Paycheck+%5BAC3+5.1%5D%5Bdvdrip%5D%5Bspanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cd47877aeec43a8761b8e513da7a8027ab2c946","infoHashBuffer":{"type":"Buffer","data":[92,212,120,119,174,236,67,168,118,27,142,81,61,167,168,2,122,178,201,70]},"announce":[],"urlList":[]}}