{"title":"Next(2007)DVDRip.AC3(ENG)-DROCK","uid":6612044,"size":731654144,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5cdc4ad52bba528857f1e523ea73df626b181cce&amp;dn=Next%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1313637226,"description":"A man with the ability to see the future and change the outcome of events before they occur is forced to choose between saving himself and saving the world in this supernatural thriller starring Nicolas Cage and directed by Lee Tamahori (Die Another Day, The Edge). Cris Johnson (Cage) is a Las Vegas magician who possesses the unique ability to witness the events of the immediate future moments before they happen. As a child Cris was subjected to a series of cruel experiments by government scientists and doctors, but a change of name and a new identity allowed the tortured psychic to elude detection and start a new life away from the prying eyes of his former captors. Though his clairvoyant vision only extends a few minutes into the future, it has still allowed Cris to eke out a living as a low-rent Las Vegas magician while earning a little extra cash at the blackjack tables. Up to this point in his life Cris has never used his power for anything substantial, but when he experiences a vision of Los Angeles being incinerated in a nuclear holocaust, the small-time magician realizes that he could hold the key to saving millions of lives. But as low as he has tried to lie in recent years, Cris has never completely escaped detection by the government. Now, as terrorists prepare to unleash the ultimate horror on an unsuspecting city, FBI counter terror agent Callie Ferris (Julianne Moore) sets out to capture Cris and convince him to use his exceptional gift to prevent the nuclear nightmare from becoming a terrifying reality. Jessica Biel, Peter Falk, and Thomas Kretschmann co-star in the film, which is based on a short story by acclaimed sci-fi author Philip K. Dick. \n\nRipped with Autogk.\n\nLength: 1 Hour 36 Minutes\n\nFile Type: AVI\n\nFrame Width: 688\n\nFrame Height: 288\n\nFrame Rate: 30fps\n\nAudio\n\nBit Rate: 114kbps\n\n(I re-encoded this one because I used a different program on the first one and I thought it would be fine because it was just a newer version of the program but I'm going back and checking all the last 30 movies and re-encoding the ones that are messed up)","torrent":{"xt":"urn:btih:5cdc4ad52bba528857f1e523ea73df626b181cce","amp;dn":"Next%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cdc4ad52bba528857f1e523ea73df626b181cce","infoHashBuffer":{"type":"Buffer","data":[92,220,74,213,43,186,82,136,87,241,229,35,234,115,223,98,107,24,28,206]},"announce":[],"urlList":[]}}