{"title":"Pearl Jam - Discography (1991-2006) [FLAC] TNT","uid":6658970,"size":6060729420,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5dbd5c49d8739bfb2ea8ab59f23326deb04e5841&amp;dn=Pearl+Jam+-+Discography+%281991-2006%29+%5BFLAC%5D+TNT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"insinuendo","files":212,"time":1315436217,"description":"Pearl Jam - Discography (1991-2006) [FLAC] TNT\n\n\nBiography\nby Stephen Thomas Erlewine\n\n\nPearl Jam rose from the ashes of Mother Love Bone to become the most popular American rock &amp; roll band of the '90s. After Mother Love Bone's vocalist, Andrew Wood, overdosed on heroin in 1990, guitarist Stone Gossard and bassist Jeff Ament assembled a new band, bringing in Mike McCready on lead guitar and recording a demo with Soundgarden's Matt Cameron on drums. Thanks to future Pearl Jam drummer Jack Irons, the demo found its way to a 25-year-old San Diego surfer named Eddie Vedder, who overdubbed vocals and original lyrics and was subsequently invited to join the band (then christened Mookie Blaylock after the NBA player). Dave Krusen was hired as the full-time drummer shortly thereafter, completing the original lineup. Renaming themselves Pearl Jam, the band recorded their debut album, Ten, in the beginning of 1991, although it wasn't released until August; in the meantime, the majority of the band appeared on the Andrew Wood tribute project Temple of the Dog. Krusen left the band shortly after the release of Ten; he was replaced by Dave Abbruzzese. \n\nTen didn't begin selling in significant numbers until early 1992, after Nirvana made mainstream rock radio receptive to alternative rock acts. Soon, Pearl Jam outsold Nirvana, which wasn't surprising. After all, Pearl Jam fused the riff-heavy stadium rock of the '70s with the grit and anger of '80s post-punk, without ever neglecting hooks and choruses; &quot;Jeremy,&quot; &quot;Evenflow,&quot; and &quot;Alive&quot; fit perfectly onto album rock radio stations looking for new blood. Pearl Jam's audience continued to grow during 1992, thanks to a series of radio and MTV hits, as well as successful appearances on the second Lollapalooza tour and the Singles soundtrack. Meanwhile, Temple of the Dog's self-titled album began a platinum-selling hit, thanks to renewed interest in the project (which, in addition to Pearl Jam, featured grunge heavyweight Chris Cornell) and strong radio support for the single &quot;Hunger Strike.&quot; Stone Gossard also embarked on a side project called Brad, which released the album Shame in early 1993. \n\nDespite their status as rock &amp; roll superstars, Pearl Jam refused to succumb to the accepted conventions of the music industry. The group refused to release any videos or singles from their second album, 1993's Vs. Nevertheless, it was another multi-platinum success, debuting at number one and selling nearly a million copies in its first week of release. On their spring 1994 American tour, the band decided not to play the conventional stadiums, choosing to play smaller arenas, including several shows on college campuses. Pearl Jam canceled their 1994 summer tour, claiming they couldn't keep ticket prices below 20 dollars because Ticketmaster was pressuring promoters to charge a higher price. The band took Ticketmaster to the Justice Department for unfair business practices; while fighting Ticketmaster, they recorded a new album during the spring and summer of 1994. After the record was completed, the group fired Dave Abbruzzese, replacing him with former Red Hot Chili Peppers and Eleven drummer Jack Irons. \n\nVitalogy, the band's third album, appeared at the end of 1994. For the first two weeks, the album was only available as a limited vinyl release, but the record charted in the Top 60. Once Vitalogy was available on CD and cassette, the album shot to the top of the charts and quickly went multi-platinum. Pearl Jam continued to battle Ticketmaster in 1995, but the Justice Department eventually ruled in favor of the ticket agency. In early 1995, the band recorded an album with Neil Young. Meanwhile, Vedder toured with his wife Beth's experimental band Hovercraft in the spring of 1994 as Stone Gossard founded an independent record company. Mad Season, Mike McCready's side project with Layne Staley of Alice in Chains, released its first album, Above, in the spring of 1995. Comprised entirely of Neil Young songs, Mirror Ball appeared in the summer under Young's name; although the individual members of the band were credited, the name Pearl Jam did not appear on the cover due to legal complications. Pearl Jam released a single culled from the sessions, titled Merkinball and featuring the songs &quot;I Got Id&quot; and &quot;Long Road,&quot; during the fall of 1995. \n\nIn late summer of 1996, Pearl Jam released their fourth album, No Code. Although the album was greeted with fairly positive reviews and debuted at number one, its weird amalgam of rock, worldbeat, and experimentalism dissatisfied a large portion of their fan base, and it quickly fell down the charts. The record's performance was also hurt by Pearl Jam's inability to launch a full-scale tour, due both to their battle with Ticketmaster and a reluctance to spend months on the road. The band spent most of 1997 out of the spotlight, working on new material; Gossard also released a second album with his side project Brad, titled Interiors. By the end of the year, Pearl Jam had completed a new, harder-rocking record entitled Yield. The album was greeted with enthusiastic reviews upon its February 1998 release, but its commercial fortunes weren't quite as clear cut. While their sizable cult embraced the album, sending it to number two its first week of release, Yield quickly slipped down the charts. Pearl Jam supported the record with a full-scale arena tour in the summer of 1998, issuing the concert LP Live on Two Legs at the end of the year; Jack Irons did not participate due to poor health, prompting the band to bring ex-Soundgarden drummer Matt Cameron back into the fold. \n\nIn 1999, Pearl Jam scored an unlikely pop radio smash with their cover of the J. Frank Wilson oldie &quot;Last Kiss,&quot; originally released as the seventh in a series of fan club-only singles that had also featured several incongruous covers in the past. Demand from fans and radio programmers resulted in the nationwide release of &quot;Last Kiss,&quot; and it eventually became the band's highest-charting pop hit to date, peaking at number two and going gold. The group returned in 2000 with the Tchad Blake-produced Binaural. In order to circumvent bootleggers, their subsequent European and American tours were recorded in full and released in an unprecedented series of double-CD sets, with each of the 72 volumes featuring a complete concert. Riot Act, a muscular -- and critically lauded -- collection of new songs that found the group dabbling in experimental art rock, was released in 2002. \n\nTwo anthologies arrived in 2003 and 2004, Lost Dogs: Rarities and B Sides and Rearviewmirror: Greatest Hits 1991-2003. They were followed in 2006 by the eponymous (and all-new) Pearl Jam, a number two hit on the album charts. As the band's 20th anniversary loomed on the horizon, Pearl Jam launched a series of album reissues, beginning with a deluxe version of Ten in 2009. That same year also saw the release of their ninth studio album, Backspacer, which doubled as the group's first independently released project, initially appearing exclusively in Target stores in the U.S. The band supported the album with an extensive 2010 tour. Live on Ten Legs, a collection of concert highlights from 2003-2010, appeared in January 2011. Later that year, Vedder released a solo album of standards accompanied only by ukulele, and the band celebrated their two-decade anniversary by launching a two-day festival in Wisconsin, commissioning Cameron Crowe to produce a music documentary named PJ20, and releasing a soundtrack of rare songs from the film.\n\n\nAlbums:\n\nTen - http://www.allmusic.com/album/ten-r14978\n\nVs. - http://www.allmusic.com/album/vs-r188401\n\nVitalogy - http://www.allmusic.com/album/vitalogy-r207150\n\nNo Code - http://www.allmusic.com/album/no-code-r239233\n\nLive on Two Legs - http://www.allmusic.com/album/live-on-two-legs-r382279\n\nYield - http://www.allmusic.com/album/yield-r333026\n\nBinaural - http://www.allmusic.com/album/binaural-r479623\n\nRiot Act - http://www.allmusic.com/album/riot-act-r611292\n\nLost Dogs: Rarities and B Sides - http://www.allmusic.com/album/lost-dogs-rarities-and-b-sides-r666816\n\nBenaroya Hall (Live)\n\nRearviewmirror: Greatest Hits 1991-2003 - http://www.allmusic.com/album/rearviewmirror-greatest-hits-1991-2003-r717525\n\nPearl Jam - http://www.allmusic.com/album/pearl-jam-r831300","torrent":{"xt":"urn:btih:5dbd5c49d8739bfb2ea8ab59f23326deb04e5841","amp;dn":"Pearl+Jam+-+Discography+%281991-2006%29+%5BFLAC%5D+TNT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dbd5c49d8739bfb2ea8ab59f23326deb04e5841","infoHashBuffer":{"type":"Buffer","data":[93,189,92,73,216,115,155,251,46,168,171,89,242,51,38,222,176,78,88,65]},"announce":[],"urlList":[]}}