{"title":"Botched DVDRIP DivX","uid":6566843,"size":733974528,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5f3548ac239b4f4a191c828044a6a94e8c6bb073&amp;dn=Botched+DVDRIP+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Dragbone","files":-1,"time":1311718467,"description":"Botched DVDRIP\n\n\nDirector: Kit Ryan\nGenres: Horror\nCast:\nStephen Dorff - (Ritchie Donovan)\nJamie Foreman - (Peter Khokhlakov)\nGeoff Bell - (Bogdanovich, Boris)\nJaime Murray - (Anna Kharine)\nEdward Baker Duly - (Killer)\n\nCopyright goes to: Optimum Releasing \n\n\nSummary:\n\nA professional thief finds his luck going from bad to worse when he's sent to Russia to steal a priceless antique crucifix and becomes the terrified target of a serial killer who takes the title of &quot;headhunter&quot; all too seriously. Career larcenist Ritchie Donovan (Stephen Dorff)'s latest job has just ended in tragedy, and he still owes a fortune to a fearsome Russian godfather. Fortunately for Ritchie, the crime kingpin is feeling especially benevolent today, and offers the luckless cat burglar one last chance to settle his debt. All Ritchie has to do is travel to Moscow, ascent a skyscraper penthouse, crack the safe, and steal an antique crucifix. It couldn't have been a simpler plan, but when the robbery ends in murder and police surround the building, Ritchie and the gang are forced to take hostages. Just as it begins to appear as if all hope is lost, the elevator that Ritchie and his fellow gangsters are traveling on comes to a complete stop on the building's unused thirteenth floor. But landing on the thirteenth floor of this building may not have been the lucky break it first appeared, because lying in wait on the hidden level is a serial killer with a knack for collecting heads. He makes no secret of his hobby either, because his gruesome trophies line these seldom-wandered halls like a nightmarish testament to the ultimate gamesman. With the cops closing in from below, psychotic Russian gangsters on all sides, panicked hostages freaking out, and a homicidal maniac somewhere too close for comfort, all Ritchie cares about now if getting his feet back on the ground before he loses his head.\n\nMovie Ripped and uploaded by Dragbone\n","torrent":{"xt":"urn:btih:5f3548ac239b4f4a191c828044a6a94e8c6bb073","amp;dn":"Botched+DVDRIP+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f3548ac239b4f4a191c828044a6a94e8c6bb073","infoHashBuffer":{"type":"Buffer","data":[95,53,72,172,35,155,79,74,25,28,130,128,68,166,169,78,140,107,176,115]},"announce":[],"urlList":[]}}