{"title":"BusinessCards MX 4.5 + License  [blaze69]","uid":6646859,"size":92026257,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:61065642e17a68458e64ffde0cc5a2f3b23a34f6&amp;dn=BusinessCards+MX+4.5+%2B+License++%5Bblaze69%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"blaze69","files":5,"time":1314981786,"description":"\nInstall And Register With Info From The License Text Document.\n\nSoftware BusinessCards MX is an advanced business card maker.\nBusinessCards MX gives you the flexibility to generate your self created, dynamic business cards. Now you have a tool that will allow you to design and even print your own business cards in no time. The simple interface and the flexible applications of the tool allow even a novice user to master the tool without any efforts.\n\n* New version BusinessCards MX 4.5\n\nThis program will help to design and print a professional business card.\nThe interface of the program has been designed in such a way that even a beginning user will not have problems with using the program.\nThe process of designing is based on inserting ready for use elements accessible in the program such as figures, images and the background, and freely shifting them on the prepared project.\nAnother advantage of the program is the possibility of saving data about a company or people so that it can be used later while designing a business cards. BusinessCards MX uses templates which you can prepare on your own, or you can use ready models , templates of business cards accessible in it. BusinessCards MX is very easy to use business cards maker software.\n\nThere are 750 examples of business card templates in the program.\n\nThe attributes of the program:\n\n* operating jpg, bmp, wmf , png ,tiff and more graphic formats\n* a dozen or so effects which can be used while working on all objects (text , image , backgrounds) for example: shadows, textures, sepia, gradients and others\n* export to high resolution (300 DPI , 600 DPI) pdf,jpg,tiff,bmp graphics file\n* the size of designed business cards: min 70x40 max 105x65\n* the appearance of the interface can be changed\n* convert and export to CMYK ( with ICC profiles )\n* support right to left languages (like arabic,hebrew)\n* support unicode\n* print on both sides of the paper (duplex printing)\n* multilanguage support:\nEnglish, German, Portuguese, Spanish, Italian, French, Norwegian, Swedish, Polish, Czech, Hungarian, Russian ,Bulgarian ,Farsi(Persian) ,Serbian ,Chinese(simplified) ,Romanian, Croatian , Arabic,Bosnian\n* 400 supported business card paper for ink jet and laser printers, from Avery, APLI, Hisago, Sigel, A-One ,Printec and other manufacturers.\n\n\n\nScreens :\n\n[img]http://img163.imageshack.us/img163/2777/99830480.gif[/img]\n\n[img]http://img35.imageshack.us/img35/3950/55150709.gif[/img]\n\n[img]http://img836.imageshack.us/img836/3580/76784300.gif[/img]\n\n[img]http://img84.imageshack.us/img84/8248/21444389.gif[/img]\n\n","torrent":{"xt":"urn:btih:61065642e17a68458e64ffde0cc5a2f3b23a34f6","amp;dn":"BusinessCards+MX+4.5+%2B+License++%5Bblaze69%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61065642e17a68458e64ffde0cc5a2f3b23a34f6","infoHashBuffer":{"type":"Buffer","data":[97,6,86,66,225,122,104,69,142,100,255,222,12,197,162,243,178,58,52,246]},"announce":[],"urlList":[]}}