{"title":"NHK.World.August.Chronicles_720p.HDTV.x264-NHK","uid":6631999,"size":19157058071,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:6159014a00ed77934a015c2874d04555542a1b2e&amp;dn=NHK.World.August.Chronicles_720p.HDTV.x264-NHK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"denys55","files":25,"time":1314405173,"description":"NHK August Chronicles\n===============================================================================\nAugust is the month when the Japanese confront their past.\nIn August 1945, at the end of World War II, the United States dropped atomic\nbombs on the cities of Hiroshima and Nagasaki. Less than one week later, Japan \nsurrendered. The total number of those killed in the bombings was more than \n200,000. The major difference between conventional and nuclear weapons is the \nafter-effects of the latter.\n\nEvery year, NHK produces programs presenting the ways in which the \nafter-effects of atomic radiation have long been influencing people and society\nin general and reconsidering both the atomic bombings and the War in the light \nof newly discovered materials and verbal evidence.\n\nIn March this year, Japan was hit by an earthquake with an unprecedented \nmagnitude, and the Fukushima Daiichi nuclear disaster that resulted has led to \nradioactive substances being diffused in Japan and overseas. Even today, a \nlarge number of people are forced to live in evacuation shelters, unsure of \nwhat the future may hold.\n\nIt is only common sense that the peaceful uses of nuclear energy and the \nbelligerent use of nuclear weapons are very different matters. This year, \nhowever, the international community has been driven into focusing on the \neffects of radiation and reconsidering the threat of nuclear terror. We decided\nit was imperative for us to reflect on the damage caused by nuclear weapons.\nIn addition, we thought that when we consider the past we should look back not \nonly at memories of the bombings but also at what exactly was happening in \nJapan in a state of war prior to them.\n\nSincerely wishing for a world free of war and nuclear weapons, we are \npresenting 13 programs this year in our 'August Chronicles' series.\n\n\nThe first half of the series\n===============================================================================\nIn December 1941, three and a half years before the atomic bombings, Japan \nentered World War II by carrying out a surprise attack on Pearl Harbor. The \nnation was plunged into a reckless conflict. 70 years have passed since then.\nThe first half of 'August Chronicles' this year, which marks the 70th \nanniversary of the attack on Pearl Harbor, includes a drama and a series of \nfour documentaries.\nThey describe how Japan went to war based on a mistaken evaluation of its place\nin the international community and how the general public lived during the war \nyears.\nWhat is the nature of the mass psychology that draws normal people into the \nmaelstrom of battle? The first half of 'August Chronicles' investigates the \ntrue face of the state of war and describes its terrors.\n\n\nThe second half of the series\n===============================================================================\nIn the world community, there are various interpretations regarding the \nAmerican atomic bombings on Japan. In the United States, the belief remains \nthat they were unavoidable as a means to bring the war to an end, and in the \nAsian countries that Japan invaded they are sometimes described as a symbol of \nliberation.\nThe second half of our 'August Chronicles' series includes a two-part debate on\nnuclear power between students and citizens in Hiroshima and documentaries that\nlook in a multifaceted manner at people of different nationalities who were\ndirectly involved with the atomic bombs.\nThrough these programs, by carefully studying the history of the atomic \nbombings and listening to the voices of victims, we want to share the wish that\nthe tragedies caused by nuclear weapons will never be repeated despite the\nvarious interpretations in different countries and individual viewpoints.\n\n\nIncluded (Ordered by airdate)\n===============================================================================\nLost.Innocence.Lost.Lives_2011_720p.HDTV.x264-NHK\nNagasaki.Peace.Memorial.Ceremony_2011_720p.HDTV.x264-NHK\nWhy.Did.Japan.Go.To.War_Part.1_2011_720p.HDTV.x264-NHK\nWhy.Did.Japan.Go.To.War_Part.2_2011_720p.HDTV.x264-NHK\nWhy.Did.Japan.Go.To.War_Part.3_2011_720p.HDTV.x264-NHK\nWhy.Did.Japan.Go.To.War_Part.4_2011_720p.HDTV.x264-NHK\nMy.Father.Killed.Japanese_2011_720p.HDTV.x264-NHK\nMotivating.Thought_Revisiting.Justice_Part.1_2011_720p.HDTV.x264-NHK\nMotivating.Thought_Revisiting.Justice_Part.2_2011_720p.HDTV.x264-NHK\nThe.Forsaken.Ones_2010_720p.HDTV.x264-NHK\nMy.Burning.Back_2005_FS.720p.HDTV.x264-NHK\nVictors.Plea.For.Peace_2011_720p.HDTV.x264-NHK\n\n\n\nMissing :(\n===============================================================================\nHiroshima Peace Memorial Ceremony \n\n\n\nNotes and contact \n===============================================================================\nSorry for what is missing, I actually didn't know all this was airing. If you\nwant to contact me, you can do so at sunif0x87()gmail.com\n\nDDL's available (at the time of posting, some are still uploading):\n     -\n     -\n     -\n\nFeel free to reshare all those, even DDL. \n","torrent":{"xt":"urn:btih:6159014a00ed77934a015c2874d04555542a1b2e","amp;dn":"NHK.World.August.Chronicles_720p.HDTV.x264-NHK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6159014a00ed77934a015c2874d04555542a1b2e","infoHashBuffer":{"type":"Buffer","data":[97,89,1,74,0,237,119,147,74,1,92,40,116,208,69,85,84,42,27,46]},"announce":[],"urlList":[]}}