{"title":"Resident Evil 4 (BEST PC EDITION!) -illiria","uid":6656987,"size":7628811913,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:625250ca1fb6bc701c64e23a6b66884d4cbdbaf3&amp;dn=Resident+Evil+4+%28BEST+PC+EDITION%21%29+-illiria&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"illiria","files":-1,"time":1315358525,"description":"With this release, you will be getting great graphics, very comfortable controls, patched and flawless game. If that didn't convince you, read the details below. :)\n\n\nThis is one of these rare projects that I put hellish effort into. I didn't create the mods this time around, but even compiling it all properly has been quite hard and took a lot of time.\n\n\nScreenshots:\n &lt;a href=&quot;\nhttp://bayimg.com/DAJBEaADP&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/DAJBEaADP&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/DaJbiaaDp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/DaJbiaaDp&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/dajBJAADp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/dajBJAADp&lt;/a&gt;\n\n\nThe game has been completely redone, from scratch. Changes from the original are:\n\n1) Game is patched to version 1.1.0\n2) Normal mouse support added (it's not &quot;jumpy&quot;, and won't be, if you won't touch the settings)\n3) High-resolution textures added\n4) High-definition (HD!) game cinematics added (all are in HD except for some in Ada's scenario)\n5) Normal keyboard shortcuts added (keys are NOT remappable in this release, but they're VERY comfortable, trust me)\n\n\n\nIF MOVIES DON'T PLAY, INSTALL THE VIDEO CODEC I'VE INCLUDED IN THE AUTORUN MENU! Yes, Windows needs codecs to play videos, no revelation, eh?\n\n\nAt the end of installation, a TXT file explaining game control configuration will be launched - I advise you to familiarize yourself with it. It will also be saved in your game directory, and Start Menu shortcuts.\n\n\n\nOne thing I didn't mention directly there however, is that you can always move your aim with W/A/D/S instead of mouse, you you will find mouse aim uncomfortable. Just hold right mouse button to aim, left to shoot, but instead of aiming using the mouse, you can aim using W/A/D/S. And yes, for all your paranoiacs there - it's very comfortable too.\n\nOverall, controls are very similar (or exactly the same) as in Resident Evil 5. You found them comfortable there, haven't you? Thought so. :) Except for you can also use left mouse button for &quot;Action&quot;. Ah, just read the damned Control Configuration Readme. :P\n\n\nI won't be giving you screenshots of the game itself here, I am a busy person. It's easy to find in Google. Besides, there is no mystery. Hi-def movies, hi-res textures.\n\n\n\nP.S. Check for my other &quot;BEST PC EDITION!&quot; releases sometime in the future. I will be releasing other games, which were HIGHLY improved and compiled with great professionalism.\n\nP.P.S. Also included game trainer, if you want cheats. :)\n\n\n-----------------------------------------------------\nIf something is detected as a virus - false positive.\n-----------------------------------------------------\n\n\n\n\n-illiria","torrent":{"xt":"urn:btih:625250ca1fb6bc701c64e23a6b66884d4cbdbaf3","amp;dn":"Resident+Evil+4+%28BEST+PC+EDITION%21%29+-illiria","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"625250ca1fb6bc701c64e23a6b66884d4cbdbaf3","infoHashBuffer":{"type":"Buffer","data":[98,82,80,202,31,182,188,112,28,100,226,58,107,102,136,77,76,189,186,243]},"announce":[],"urlList":[]}}