{"title":"HISTORY OF POP AND ROCK MUSIC - part 308","uid":6561539,"size":736752097,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:627f38cb26d45b6463b7a8c4657dfb082951633c&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+308&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zlatkopupovac","files":-1,"time":1311502925,"description":"                    PART  308\n\n\n             CHARLES &amp; EDDIE  -  Would I lie to you (1992)\n             MARY MARY  - (Shackles)  Praise You (1999)\n             MARC ANTHONY  - I Need To Know  (1999)\n             MARC ANTHONY -  Tragedy (2002) \n\n\n\n     &quot;Would I Lie to You?&quot; is a R&amp;B song by Charles &amp; Eddie. Written by Mike Leeson and Peter Vale and produced by Josh Deutsch, &quot;Would I Lie to You?&quot; was the debut single by the pop-soul duo, and it proved to be their biggest hit. A major international success, it reached number one on the UK singles chart for two weeks in November 1992 and was also number one in New Zealand, Germany and Austria. It was a top five hit in several other European countries while in Australia it went to number 3. The single became a Top 20 hit in the USA, peaking at number 13 on the Billboard Hot 100 and it enjoyed award-winning sales, earning a platinum record in the UK, a gold record in both Germany and Austria and silver record award in France.\n     &quot;Shackles (Praise You)&quot; is the debut single by singer-songwriter duo Mary Mary. It was first released in 2000 and has since been dubbed the signature Mary Mary song as it ultimately raised the profile of the duo in the gospel music industry. Stan North of GospelFlava.com deemed it as one of the pioneer songs of Urban Gospel music The song was originally recorded and released in December 1999 upon Mary Mary's signing with Columbia Records and was re-released one month later as a promotional single for their upcoming album, &quot;Thankful&quot;.\n     &quot;I Need to Know&quot; is a song  written and produced by Marc Anthony and Cory Rooney (1999) , and also a Spanish version (titled DÃƒÂ­melo) was released with the collaboration of Robert Blades and Angie Chirino, and the lyrics are about a man who wants to know about a woman's feelings for him, going with the title &quot;I need to know&quot;. Both versions of the track were very successful in the United States. The English version peaked at number 3 in the Billboard Hot 100 and at number-one in the Hot Latin Tracks for 5 consecutive weeks.This track received three Latin Grammy nominations, Song of the Year, Record of the Year and Best Male Pop Vocal Performance, winning for Song of the Year at the Latin Grammy Awards of 2000. Also on the Grammy Awards received a nomination for Best Male Pop Vocal Performance, which lost out to Sting's &quot;Brand New Day&quot;\n     &quot;Tragedy&quot;  is a song  written by Robert Kelly &quot;Rob&quot; Thomas. The song originally appears on the Marc Anthony's 2002 album &quot;Mended&quot;. It is the sixth overall solo studio album and second English studio album by  Anthony.The album features the hit singles &quot;I've Got You&quot;, the Spanish version &quot;Te Tengo Aqui&quot;, &quot;Love Won't Get Any Better,&quot; as well as the well-known single &quot;Tragedy&quot; The album was certified Platinum by the CRIA in October 2002..\n\n\nFrom Wikipedia, the free encyclopedia","torrent":{"xt":"urn:btih:627f38cb26d45b6463b7a8c4657dfb082951633c","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+308","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"627f38cb26d45b6463b7a8c4657dfb082951633c","infoHashBuffer":{"type":"Buffer","data":[98,127,56,203,38,212,91,100,99,183,168,196,101,125,251,8,41,81,99,60]},"announce":[],"urlList":[]}}