{"title":"Deus Ex: Human Revolution PROPER Repack -illiria","uid":6636419,"size":8535257088,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:62838cd0d29b5f9da236e2482aead2d7df1d9c0c&amp;dn=Deus+Ex%3A+Human+Revolution+PROPER+Repack+-illiria&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"illiria","files":-1,"time":1314574251,"description":"Repack of Deus Ex: Human Revolution version 1.1.622.0.\n\n\nFirst of - yes, it weights more than other repacks, but yes, it's proper. It contains all the pre-order DLCs (a mission and weapons), it's already patched, and it installs fast (a lot faster than other repacks, anyway).\nAnd yes, it does fit a single dual-layer DVD.\n\n\nScreenshots:\n\n &lt;a href=&quot;\nhttp://bayimg.com/pAjLEaadm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/pAjLEaadm&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/pajLFAadm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/pajLFAadm&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/pAjLgAadm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/pAjLgAadm&lt;/a&gt;\n\n\nThere's not much else to say. Just the usual - if you want a normal, polished version with a clean install and removal - here you go. Everything is tested (I nearly finished the game), crack is proper, works with trainers (certain trainers may cause occasional crashes - it's not game's fault).\n\nLanguage supported - ONLY English.\n\n\n\n---------------\n\nNote about patching your installation disc with future patches (OPTIONAL):\n\nIn case future patches will come out, I believe it will be very easy to update your game installation. In DVD root folder you will see game EXE. You can replace it with a new version, and my installer will install a new version. In EVE root\\Data folder, you will see &quot;patch 000&quot; file - as far as I can tell, this is a patch file for the game.\n\nSo to put it simple, if the game patch will be &quot;patch000&quot; file and cracked EXE - replace both in my DVD image, and my installer will auntomatically install the new version! Because I left these resources unpacked, external.\n\nIf the patch will contain some *other* files though, it won't work. Replacing will only wirk with the files that are already on the disc. replace them - and new versions will install.\n\nALSO if you want to just use a different crack, simple replace it in DVD root folder, and that is what my installer will install. Tjhough I do warn you that I have included a proper crack, no sense in replacing it (unless you're replacing with new version).\n\n\n\nP.S. I've made this project a day ago, but couldn't decide whether I should upload it or not (I don't like spending time writing long descriptions, I can tell you that much), but decided to upload still. Sorry for the wait, and enjoy a proper repack.\n\n\n\n-illiria","torrent":{"xt":"urn:btih:62838cd0d29b5f9da236e2482aead2d7df1d9c0c","amp;dn":"Deus+Ex%3A+Human+Revolution+PROPER+Repack+-illiria","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62838cd0d29b5f9da236e2482aead2d7df1d9c0c","infoHashBuffer":{"type":"Buffer","data":[98,131,140,208,210,155,95,157,162,54,226,72,42,234,210,215,223,29,156,12]},"announce":[],"urlList":[]}}