{"title":"SMART Utility 3.02 &amp; Core Keygen","uid":6648174,"size":5759524,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:64a67747d243425df529da62912730c2faf3e64d&amp;dn=SMART+Utility+3.02+%26+Core+Keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chad10,000","files":-1,"time":1315031182,"description":"WHAT IS SMART UTILITY?\nSMART Utility is an application to scan the internal hardware diagnostics system of hard drives. SMART (Self-Monitoring, Analysis, and Reporting Technology) is a system built into hard drives by their manufacturers to report on various measurements(called attributes) of a hard drive\\'s operation. The attributes can be used to detect when a hard drive is having mechanical or electrical problems, and can indicate when the hard drive is failing. SMART Utility can read and display these attributes. This allows time to hopefully backup, and then replace the drive. SMART Utility also allows running a drive\\'s built in self test, which can also indicate malfunctions on the drive.\n\nWHY USE SMART UTILITY?\nSMART Utility is different from other drive utilities, such as Disk Utility, which only read the overall SMART Status. SMART Utility not only displays the individual attributes to see their status and information, but it also uses an internal algorithm based on those attributes to detect drives failing before SMART indicates it has failed. This pre-fail detection can save precious data before SMART has determined that the drive has failed. And, while the raw information can be viewed on the command line with smartmontools (which is what SMART Utility is based on, SMART Utility presents it in an easy to read format, as well as running its internal pre-fail algorithm. Plus, with the ability to run self tests, problems can be detected even sooner.\n\nFEATURES\nDisplays all supported drives and their partitions\nDisplays important information in the main window, such as drive model, capacity, power on hours, temperature, bad sector counts, and error counts and types\nDisplays easy to read overall SMART status with color coded text\nDisplays more detailed information in separate windows, including capabilities, all available attributes, and the past five errors\nDisplays information using the Growl notification service (if installed)\nDisplays information in menu bar\nSupports saving drive reports for later viewing\nSupports printing drive reports\nSupports scanning in the background\nSupports running a hard drive\\'s built-in test, and displays the results of the test\nSupports scanning OS X software RAID drives, as well as drives in many RAID enclosures and cards (including SeriTek drives)\nSupports logging all information to a log file for verifying SMART data\nSupports customizing the pre-fail algorithm, including only alerting new bad sectors and error counts\nSupports Mac OS X 10.4.11, 10.5, 10.6, and 10.7, on both PowerPC and Intel Macs\nFully localized in French, thanks to Ronald A. Leroux\n","torrent":{"xt":"urn:btih:64a67747d243425df529da62912730c2faf3e64d","amp;dn":"SMART+Utility+3.02+%26+Core+Keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64a67747d243425df529da62912730c2faf3e64d","infoHashBuffer":{"type":"Buffer","data":[100,166,119,71,210,67,66,93,245,41,218,98,145,39,48,194,250,243,230,77]},"announce":[],"urlList":[]}}