{"title":"Supernatural S04 E12 - E22 DVDrip DutchReleaseTeam (dutch subs n","uid":6576360,"size":4401949706,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:64a709136402d9b0c9f1c5869b8dc31c91256312&amp;dn=Supernatural+S04+E12+-+E22+DVDrip+DutchReleaseTeam+%28dutch+subs+n&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MtotheAtiash","files":-1,"time":1312212917,"description":"USA\nGenre: Drama, Mystery, Thriller, Fantasy, Horror, Comedy\nTaal: Engels\nOndertitels: vaste Nederlandse ondertiteling\nVertaling: Bierdopje.com\nIMDb\nAflevering nummer 12 - 22\n\nSeason 4, Episode 12: Criss Angel Is a Douche Bag\nSam and Dean investigate the activities of a trio of magicians who are using a grimoire to execute real feats of magic.\n\nSeason 4, Episode 13: After School Special\nSam and Dean investigate a haunting at one of their old high schools where we will see what school was like for the brothers.\n\nSeason 4, Episode 14: Sex and Violence\nThe Winchester's investigation into a series of deaths takes a deadly turn when a siren tries to tear them apart for good.\n\nSeason 4, Episode 15: Death Takes a Holiday\nSam and Dean try to find out why people in a small town are having near death experiences with alarming frequency by going into the spirit world.\n\nSeason 4, Episode 16: On the Head of a Pin\nCastiel and Uriel ask Dean to torture Alastair for information. But when Alastair breaks free, Castiel starts to believe that their is a traitor among the angels.\n\nSeason 4, Episode 17: It's a Terrible Life\nIn an alternate reality mysteriously created as if Sam and Dean where never brothers and have never met, Sam and Dean work at a marketing office where they are forced to team up with one another when a series of mysterious suicides point to a ghost haunting the premises.\n\nSeason 4, Episode 18: The Monster at the End of This Book\nAn author has been writing books about Sam and Dean since 2005. Sam and Dean try to figure out how he knows so much about them.\n\nSeason 4, Episode 19: Jump the Shark\nSam and Dean are contacted by one Adam Milligan who claims to be John Winchester's son. The boys immediately suspect a demon trap and go to investigate. Adam turns out to legitimately be John's son and Dean is furious that John kept Adam's existence from them as well as sheltered Adam from the hunting life. Meanwhile other supernatural forces are at work, which lead to a tragic twist that neither Sam, Dean, or their new sibling could have guessed.\n\nSeason 4, Episode 20: The Rapture\nCastiel has been sent back to Heaven. His human host, Jimmy, tries to regain his life. But the demons won't leave him alone and now his family is at risk. Sam and Dean can help a little, but they're going to need a &quot;miracle&quot; to win.\n\nSeason 4, Episode 21: When the Levee Breaks\nSam is becoming more and more inhuman. Dean and Bobby put him in the safe hold until he gets over his addictions. After Sam escapes with help, unknown to him, from Castiel, he finds Ruby and begins to feed once again. Dean begins to truly believe that the old Sam is gone for good.\n\nSeason 4, Episode 22: Lucifer Rising\nWhen the last few of the 66 Seals are broken by Lilith's minions, Sam and Dean prepare for the big and probably futile fight in very different ways. Sam joins Ruby on a final attempt to kill Lilith before Lucifer rises, while Castiel and Zachariah tell Dean that it's time to play his part in stopping Lucifer.\n\nhardcoded dutch subs\n\ndeze review wordt u aangeboden door het DutchReleaseTeam\nVoor de reviews van de nieuwste films, muziek, series, games etc ga dan eens naar &lt;a href=&quot;\nhttp://www.hetmultimediacafe.be/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hetmultimediacafe.be/&lt;/a&gt;","torrent":{"xt":"urn:btih:64a709136402d9b0c9f1c5869b8dc31c91256312","amp;dn":"Supernatural+S04+E12+-+E22+DVDrip+DutchReleaseTeam+%28dutch+subs+n","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64a709136402d9b0c9f1c5869b8dc31c91256312","infoHashBuffer":{"type":"Buffer","data":[100,167,9,19,100,2,217,176,201,241,197,134,155,141,195,28,145,37,99,18]},"announce":[],"urlList":[]}}