{"title":"Off Limits {1988] Willem Dafoe","uid":6635239,"size":737508644,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:660f55c04c2bdd496d883737416b2a71d1e55090&amp;dn=Off+Limits+%7B1988%5D+Willem+Dafoe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1314490538,"description":" &lt;a href=&quot;http://bayimg.com/nAjJMAADm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/nAjJMAADm&lt;/a&gt;\n\nOff Limits (1988) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0095774/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0095774/&lt;/a&gt;\n\nOff Limits is a 1988 action-thriller film set during the Vietnam War starring Willem Dafoe and Gregory Hines and directed by Christopher Crowe. The term &quot;off limits&quot; referred to the area where the original crime took place, an area of Saigon off limits to military personnel. The name of the film was changed to Saigon or Saigon: Off Limits when it was released throughout the rest of the world.\n\nThe film marks Willem Dafoe's second Vietnam War movie. He was assisted in preparing for this role by Vietnam Veteran and former Counterintelligence Special Agent Ed Murphy. Dafoe had previously starred in Platoon and would go on to play roles in Born on the Fourth of July and Flight of the Intruder.\n\n  Willem Dafoe  ...  Buck McGriff  \n  Gregory Hines  ...  Albaby Perkins  \n  Fred Ward  ...  Dix  \n  Amanda Pays  ...  Nicole  \n  Kay Tong Lim  ...  Lime Green  \n  Scott Glenn  ...  Colonel Dexter Armstrong  \n  David Alan Grier  ...  Rogers  \n  Keith David  ...  Maurice  \n  Raymond O'Connor  ...  Elgin Flowers  \n  Richard Brooks  ...  Preacher  \n  Thuy An Luu  ...  Lanh (as Thuy Ann Luu)  \n  Richard Lee Reed  ...  Colonel Sparks  \n  Woody Brown  ...  Co-Pilot  \n  Ken Siu  ...  Plowboy  \n  Viladda Vanadurongwan  ...  Sister Agnes  \n\nWhat helps distinguish the film from the overcrowded police procedural genre is its setting. Set against the backdrop of war, and dealing with a race-related series of murders, Off Limits has much potential, but not once does it use its setting to its advantage. Rather, writer/director Christopher Crowe (who also wrote the screenplay for The Last of the Mohicans) seems content to put the emphasis on the performances of his cast.\n\nIt's as well that the cast is up to task, considering how it is their work that ultimately makes or breaks the film, a task not made any easier by the one-dimensional characters. Hines and Dafoe prove a good combination, and both are dependable actors, so dependable, in fact, that they are able to practically sleep walk their way through the movie yet still keeping the viewer interested. Stealing the film from under their noses, however, is Scott Glenn (Sucker Punch), as an out-of-his-mind suspect. His role may be small, but it is memorable for Glenn's near-psychotic reading of the role. Also offering more than able support is Fred Ward (Tremors). These actors do well to keep the viewers attention away from the repetitive plot and ensure that Off Limits is worth a look.\n\nCrowe's direction, though not flashy, still suggests he could have had a much more celebrated career as a director. Problems with the screenplay aside, his work behind the camera results in a slick-looking film, and he keeps the story moving along at a quick pace. It's a source of much frustration that everyone puts in solid work that is undone by such an unambitious screenplay. There are moments that shine, with Keith David's (Requiem For a Dream) memorable turn as a fast-talking, no-nonsense serviceman instantly grabbing the attention, but these are far too few in number. Even the potentially explosive racial tensions between the Americans and Vietnamese fails to ignite, with nothing more than a few heated looks and racial slurs managing to creep in.\n\nOff Limits is a perfect movie for anyone scouring the channels late at night; it's uncomplicated, fast paced, and contains just enough action to keep you watching. \n","torrent":{"xt":"urn:btih:660f55c04c2bdd496d883737416b2a71d1e55090","amp;dn":"Off+Limits+%7B1988%5D+Willem+Dafoe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"660f55c04c2bdd496d883737416b2a71d1e55090","infoHashBuffer":{"type":"Buffer","data":[102,15,85,192,76,43,221,73,109,136,55,55,65,107,42,113,209,229,80,144]},"announce":[],"urlList":[]}}