{"title":"Scream(1996)DVDRip.AC3(ENG)-DROCK","uid":6661679,"size":737113964,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:66a378be5dc8a2ed0955a0a0c958529a4159e5ff&amp;dn=Scream%281996%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1315533215,"description":"Scream is at once a slasher film and a tongue-in-cheek position paper on the &quot;dead teenagers&quot; movies of the late 1970s/early 1980s that plays as half-parody, half-tribute. Sydney Prescott (Neve Campbell) is having a rough time lately: she's still getting over the brutal rape and murder of her mother a year ago, and now one of her friends (Drew Barrymore) has been killed by a lunatic who harassed her with terrifying phone calls, then stabbed her to death while wearing a Halloween costume. Soon Sydney is receiving similar phone calls, quizzing her on the arcane details of such films as Friday the 13th and Prom Night, and is attacked by the same cloaked maniac. With her father missing, she has hardly anyone on her side except her best friend Tatum (Rose McGowan) and Tatum's brother Dewey (David Arquette), a half-bright cop. As for the murderer, it could be any number of people: Syd's father; her cute but overly intense boyfriend Billy (Skeet Ullrich); Tatum's goofball boyfriend Stuart (Matthew Lillard); or Randy (Jamie Kennedy), who works at the local video store and seems to like horror movies just a little too much. Much like Halloween, Scream spawned a series of sequels and inspired a large number of similar films -- its original working title, Scary Movie, became the title of the 2000 parody film by Damon Wayans. \n\nRipped with Handbrake.\n\nLength: 1 Hour 51 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:66a378be5dc8a2ed0955a0a0c958529a4159e5ff","amp;dn":"Scream%281996%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66a378be5dc8a2ed0955a0a0c958529a4159e5ff","infoHashBuffer":{"type":"Buffer","data":[102,163,120,190,93,200,162,237,9,85,160,160,201,88,82,154,65,89,229,255]},"announce":[],"urlList":[]}}