{"title":"Cyber Update Feb.2012------WP-18137  Bobbi Starr and Yasmine d","uid":7023086,"size":856515114,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:6709acf4312d464305d1f054ed1a43cb2c1b0a1e&amp;dn=Cyber+Update+Feb.2012------WP-18137++Bobbi+Starr+and+Yasmine+d&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1328912252,"description":"From Kink.com    (Wiredpussy)  + Pics\n\n\nThinking that her life of wealth and privilege gives her carte blanche to flout the law, Yasmine de Leon did not count on running into Patrolwoman Bobbi Starr. As someone bound to protect and serve, Bobbi doesn't buy into Yasmine's pleas of who she is and what her husband will do to her when she's picked up breaking the law. If anything, it pisses Bobbi off even more.\n \nBobbi strikes out for the 99 percent and shows the 1 percent, Yasmine, what it's like with no phone call and no lawyer. Bobbi uses the most extreme methods at her disposal to extract a confession. Sensing that Yasmine needs more persuasion than the average perp (or, maybe because she had a bad day) Bobbi secures her suspect for further interrogation using methods suspiciously like lesbian bondage.\n \nTeaching Yasmine what it means to be in the wrong place at the wrong time for everyone else in the world, Bobbi engages in real class warfare by manhandling Yasmine over a table, applying a taser to her, then violating her pussy with an electrified plug before moving her on to more electro BDSM.\n \nWith the help of the violet wand, Bobbi ties Yasmine to a jail cell and shocks her pussy one spark at a time. But Yasmine's gagged yelps don't end the BDSM. Bobbi ensures that Yasmine respects her authority by making her pussy dance with electrical shocks. With a strap-on dildo, Bobbi violates the rich bitch's ass, then releases her from the electro bondage session.\n\n\nScreens &lt;a href=&quot; http://www.wiredpussy.com/site/shoot.jsp?shootId=18137&amp;c=1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.wiredpussy.com/site/shoot.jsp?shootId=18137&amp;c=1&lt;/a&gt;\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:6709acf4312d464305d1f054ed1a43cb2c1b0a1e","amp;dn":"Cyber+Update+Feb.2012------WP-18137++Bobbi+Starr+and+Yasmine+d","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6709acf4312d464305d1f054ed1a43cb2c1b0a1e","infoHashBuffer":{"type":"Buffer","data":[103,9,172,244,49,45,70,67,5,209,240,84,237,26,67,203,44,27,10,30]},"announce":[],"urlList":[]}}