{"title":"The Crucified Soldier   (Channel 4 2002)","uid":6602638,"size":456393984,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:69260180b7c109f174f9e146ed8825fbb46e487a&amp;dn=The+Crucified+Soldier+++%28Channel+4+2002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rosie1966","files":2,"time":1313271856,"description":"The Crucified Soldier refers to the widespread story of an Allied soldier serving in the Canadian Corps who may have been crucified with bayonets on a barn door or a tree, while fighting on the Western Front during World War I. Three witnesses said they saw an unidentified crucified Canadian soldier near the battlefield of Ypres, Belgium on or around 24 April 1915, but there was no conclusive proof such a crucifixion actually occurred. The eyewitness accounts were somewhat contradictory, no crucified body was found, and no knowledge was uncovered at the time about the identity of the supposedly crucified soldier. During World War II the story was used by the Nazis as an example of British propaganda.\n\nBritish documentary film maker Iain Overton investigated the story of the Crucified Soldier as well as other myths of World War I in his doctoral dissertation and developed them into a television documentary, which was transmitted in 2002 as part of UK Channel 4's Secret History series. Overton uncovered new historical evidence which identified the crucified soldier as Sergeant Harry Band of the Central Ontario Regiment of the Canadian Infantry, who was reported missing in action on 24 April 1915 near Ypres. Other soldiers in his unit wrote to Band's sister Elizabeth Petrie to express their condolences; a year later, one of them finally confirmed in a letter to her that her suspicions her brother had been &quot;the crucified soldier&quot; were true. Band's body was never recovered, and he is commemorated on the Menin Gate memorial.\n\nThe evidence discovered by Overton included a typewritten note by a British nurse found in the Liddle Collection of war correspondence in Leeds University. The note related comments by a Lance Corporal C.M. Brown to his nurse, Miss Ursula Violet Chaloner, who he told of a Sergeant Harry Band who was &quot;crucified after a battle of Ypres on one of the doors of a barn with five bayonets in him.&quot;\n\nSome accounts erroneously name the soldier identified in Overton's documentary as &quot;Harry Banks,&quot; thus creating an apparent contradiction in that the only Canadian soldier of that name enlisted into the Over-seas Expeditionary Force on 1 September 1915 in Victoria, British Columbia, Canada, some five months after the supposed crucifixion. In addition, Banks appears to have survived the War, as he is not commemorated by the Commonwealth War Graves Commission, the agency responsible for recording the deaths and grave or memorial sites for Commonwealth soldiers killed in the both World Wars. In fact, the surname of &quot;Banks&quot; is not mentioned in the Overton documentary at all.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:69260180b7c109f174f9e146ed8825fbb46e487a","amp;dn":"The+Crucified+Soldier+++%28Channel+4+2002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69260180b7c109f174f9e146ed8825fbb46e487a","infoHashBuffer":{"type":"Buffer","data":[105,38,1,128,183,193,9,241,116,249,225,70,237,136,37,251,180,110,72,122]},"announce":[],"urlList":[]}}