{"title":"Smoking Teeth, Rooted, Quecksilber (mercury amalgam fluoride can","uid":6659481,"size":2701271909,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6b63de4ad1ff25218cb0269fb8ea9ef5ab31aec0&amp;dn=Smoking+Teeth%2C+Rooted%2C+Quecksilber+%28mercury+amalgam+fluoride+can&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FluxCapacitor","files":6,"time":1315461291,"description":"Smoking Teeth, Rooted, Quecksilber:\n\nSmoking Teeth is a short video from the Academy of Oral Medicine and Toxicology on the toxicity of mercury or 'silver' amalgam dental fillings.  It's referenced in the documentary Quecksilber by Robert Gammal and provided here in its 8-minute entirety.\n\nQuecksilber (2004) and Rooted (2006) are each hour-long documentaries exploring the health threats from mercury fillings and root canal therapy as well as touching upon the toxic effects of fluoride in drinking water and going into the history and politics of dental practices.  They enumerate the many diseases and disorders caused or exacerbated by these practices, including brain damage, kidney damage, birth defects, skin problems, allergies, infertility, Alzheimer's, Parkinson's, multiple sclerosis, autism, ADHD, and cancer, among others.  They are both fully referenced documentaries produced by Dr. Robert Gammal, BDS aka La Mmag Productions.  More info can be found at the sites www.quecksilber.net, www.rooted.tv, www.robertgammal.com, and www.lammag.com, as well as the Youtube channel,\n\nAlso included is a paper by Dr. Gammal titled &quot;To the Deans of Dentistry&quot; with over 500 references, which recounts many of the same facts and figures cited in his documentaries and a video of Dr. Gammal reading portions of this paper.\n\nSee also the documentary &quot;The Fluoride Deception,&quot; available on Youtube.\n\n\nFrom Quecksilber:\n\n&quot;In January 2003, the Superior Court of California ruled that dentists must display the following sign in their waiting rooms: 'Dental amalgam, used in many dental fillings, causes exposure to mercury, a chemical known to the State of California to cause birth defects and other reproductive harm.  Root canal treatments and restorations including fillings, crowns and bridges, use chemicals known to the State of California to cause cancer'.&quot;\n\n\nFrom Rooted:\n\n&quot;Soluble poisons may pass from the infected teeth to the lymph or blood circulation, and produce systemic disturbances entirely out of proportion to the quantity of poison involved.&quot; - Dr. Weston Price, 1920 \n\n\nFrom the Open Letter:\n\n&quot;Dental amalgam that is not in the mouth is called waste amalgam.  It's regarded by the Environmental Protection Agency as a toxic waste hazard.&quot;\n\n\n\nIf you are interested in this subject you might also want to check out my other torrent, &quot;Is there MERCURY in your mouth?&quot; which contains the 1994 BBC Panorama documentary &quot;Poison in the Mouth&quot; and the 1990 60 Minutes documentary &quot;Is there poison in your mouth?&quot; as well as a number of pdf documents. - FluxCapacitor","torrent":{"xt":"urn:btih:6b63de4ad1ff25218cb0269fb8ea9ef5ab31aec0","amp;dn":"Smoking+Teeth%2C+Rooted%2C+Quecksilber+%28mercury+amalgam+fluoride+can","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b63de4ad1ff25218cb0269fb8ea9ef5ab31aec0","infoHashBuffer":{"type":"Buffer","data":[107,99,222,74,209,255,37,33,140,176,38,159,184,234,158,245,171,49,174,192]},"announce":[],"urlList":[]}}