{"title":"NASAs James Lovelock - Revenge of GAIA","uid":6877934,"size":208753126,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6e08fe00eff94fcf2b2bdfc1aa52c5e8480efd10&amp;dn=NASAs+James+Lovelock+-+Revenge+of+GAIA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"UnviolentPeacemaker","files":46,"time":1323527404,"description":" &lt;a href=&quot;http://www.amazon.com/Revenge-Gaia-James-Lovelock/dp/046504168X&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.amazon.com/Revenge-Gaia-James-Lovelock/dp/046504168X&lt;/a&gt;\n\n1. URGENT, PLS, SEED, SEED, SEED ALL, ALL, ALL ...\nUnviolentPeaceMaker's TPB uploads     &lt;a href=&quot;\nhttp://thepiratebay.se/user/UnviolentPeacemaker/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/UnviolentPeacemaker/&lt;/a&gt; .  \nSOON I MAY BE PREVENTED.  DO IT.  \nKEEP THESE TORRENTS ALIVE.  Thanks.  All of them.\n\n2. NOTE:  High Quality ATT Voice. Dont like it?  Dont download it.  Dont complain.  Dont get in the way.\n\n--------\n\n'If we had our way this would be on the reading syllabus' GQ\n\n'The most profound scientific thinker of our time ... the greatest living Englishman' Bryan Appleyard, Literary Review\n\n'He has changed the way we look at the world' Colin Tudge, Guardian\n\n'This book could prove to be one of the twentieth-century's most important pieces of polemic' James Flint, Daily Telegraph\n\n'Lovelock's vast learning, crisp and energetic writing, and original thinking mean that every disagreement is a prompt to become better informed and clearer-thinking about climate change' John Whitfield, Independent on Sunday\n\n'A sharp jolt to political complacency .. . fresh and thought-provoking' Andrew Robinson, The Times Higher Education Supplement\n\n'A scientific visionary ... packed with wisdom and integrity, beautifully written, challenging' David King, The Times\n\n'The prose has an elegance and clarity that put the standard eco-rant to shame' Tom Fort, Spectator\n\n'His poetic yet precise, scientific yet spiritual, way of thinking takes us to the heart of what it is to be a human on this strange planet called Earth ... This is a hugely serious book. You will rarely read anything more serious, more humane, more humbling, more passionate, more scientific, more spiritual, more important' Fred Pearce, BBC Focus\n \n'One of the most famous scientists on the planet and one of the creators of our current environmental consciousness' Ian Irvine, Independent\n\n'This brief, urgent and sobering polemic' Ned Denny, Evening Standard\n\n'The man who conceived the first wholly new way of looking at life on Earth since Charles Darwin' Michael McCarthy, Independent\n","torrent":{"xt":"urn:btih:6e08fe00eff94fcf2b2bdfc1aa52c5e8480efd10","amp;dn":"NASAs+James+Lovelock+-+Revenge+of+GAIA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e08fe00eff94fcf2b2bdfc1aa52c5e8480efd10","infoHashBuffer":{"type":"Buffer","data":[110,8,254,0,239,249,79,207,43,43,223,193,170,82,197,232,72,14,253,16]},"announce":[],"urlList":[]}}