{"title":"Rules Of The Game (1939)","uid":7013330,"size":4510285824,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6fd4e15959522202fa83e72b7cadf3a59791352b&amp;dn=Rules+Of+The+Game+%281939%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Auge","files":-1,"time":1328552397,"description":"I am providing important films in ISO for the film buff or novice film historian. It is nearly impossible to find torrent files that include all the extras or even important commentaries.\nThese files are from my collection of DVDs that I have made from rented movies over the last seven years or so.\nNearly all of them have been put onto a DVD5, so unfortunately I do not have an uncompressed source handy.  That said I can assure you that these look GREAT on larger screens.\nI chose to make them this size for economy as DVD9s were $3 each when I started this and DVD5s were .25 cents each.\nNow I am working on putting some of the best ones on a hard drive to be played with my HD TV media Player and am still thinking economy is the best rule as these are half the size of ripping a DVD9.\nThis is the best quality for the value.\n\nI would love some productive feedback  . . .   :)\n\nThis is a DVD rip to an ISO; you can watch it on your media player, mount it to a virtual drive or burn it to a DVD.\n\nThis file includes EVERYTHING the original DVD has:\n\n1939\n106 minutes\nBlack and White\n1.33:1\nSpoken Language: French\nSubtitles: English\nIntroduction to the film by director Jean Renoir\nAudio commentary written by film scholar Alexander Sesonske and read by filmmaker Peter Bogdanovich\nComparison of the films two endings\nSelected-scene analysis by Renoir historian Chris Faulkner\n\nSYNOPSIS:  Considered one of the greatest films ever made, The Rules of the Game (La regle du jeu), by Jean Renoir, is a scathing critique of corrupt French society cloaked in a comedy of manners in which a weekend at a marquis country chÃƒÂ¢teau lays bare some ugly truths about a group of haut bourgeois acquaintances. The film has had a tumultuous history: it was subjected to cuts after the violent response of the premiere audience in 1939, and the original negative was destroyed during World War II; it wasnt reconstructed until 1959. That version, which has stunned viewers for decades, is presented here.\n","torrent":{"xt":"urn:btih:6fd4e15959522202fa83e72b7cadf3a59791352b","amp;dn":"Rules+Of+The+Game+%281939%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fd4e15959522202fa83e72b7cadf3a59791352b","infoHashBuffer":{"type":"Buffer","data":[111,212,225,89,89,82,34,2,250,131,231,43,124,173,243,165,151,145,53,43]},"announce":[],"urlList":[]}}