{"title":"books on christian history","uid":6577665,"size":198063132,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7132095f733ee4371f8e6f0c249751e0a8e4005c&amp;dn=books+on+christian+history&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"tarthwell","files":81,"time":1312278768,"description":"Books concerning Christian history, mostly pdf format.\n\n_________________________________________________________\n\nBang - History of the Methodist Church, vol 1-4\nBenedict - General History of Baptist Denomination in America vol 1-2\nBrown - The Political Activities of the Baptists and Fifth Monarchy Men\nBurrage - History of Baptists in Maine\nCarroll - A History of Texas Baptists - J. M. Carroll\nChristianity_ The First Three Thousand Y - Diarmaid MacCulloch\nFoxe's Book of Martyrs' and Early Modern - JOHN N. KING\nHistory and the Supernatural in Medieval - Carl S. Watkins\nLay Piety and Religious Discipline in Mi - Nicole R. Rice\nQuaker Constitutionalism and the Politic - Jane E. Calvert\nChristian - A History of the Baptists - John T. Christian\nCramp - Baptist History - J. M. Cramp\nCrosby - History of the English Baptists vol 1-4\nCross - The Reformation and Baptist Compromise\nCrucibles of Political Loyalty_ Church Institutions and Electoral Continuity in Hungary\nD'Aubigne - History of the Reformation in the Time of Calvin vol 1-8\nD'Aubigne - History of the Reformation of the 16th Century\nDavis - History of the Welsh Baptists - J. Davis\nDuncan - A History of the Baptists in Missouri - R. S. Duncan\nEstep - An Anabaptist Ancestry - William R. Estep\nEstep - Sixteenth-Century Anabaptism and the puritan connection: Reflection upon Baptist origins- William R. Estep\nEvans - The Early English Baptists Volume 1-2 - Benjamin Evans\nFristoe - The History of the Ketocton Baptist association - William Fristoe\nFurman - A History of the Charleston Association of Baptist Churches - Wood Furman\nGeddes - The Church History of Ethiopia - Michael Geddes\nGoadby - Bye-Paths in Baptist History - J. J. Goadby\nGorrie - Lives of Eminent Methodist Ministers - P. Douglass Gorrie\nGriffin - History of the Primitive Baptists of mississippi - Benjamin Griffin\nGriffiths - A History of Baptists in New jersey - Thomas S. Griffiths\nGrime - History of Middle Tennessee Baptists - J. H. Grime\nHefele - History of the Church Councils vol 1-5 - Charles Hefele\nHetherington - History of the Westminster assembly of divines - William Hetherington_ D.D._ LL.D\nHowell - The Early Baptists of Virginia - Robert Boyle C. Howell_ D.D\nIvimey - A History of the English Baptists vol 1-4 - Joseph Ivimey\nJones - Ecclesiastical Empire - Alonzo Jones\nJones - History of the Christian Church vol 1-2  - William Jones\nJones - Lessons From The Reformation - Alonzo Jones\nJones - The Baptists_ Their Origin, Continuity, principles, spirit, polity, position, and influence - T. G. Jones D.D\nKliever - General Baptist Origins_ The Question of anabaptist influence - Lonnie D. Kliever\nKnox - History of Reformation of Religion Within the realm of Scotland - John Knox\nM'Crie - The Reformation in Spain - Thomas M'Crie\nMartyn - Life and Times of Martin Luther - W. Carlos Martyn\nMelancthon - The Life &amp; Acts of Martin Luther - Philip Melancthon\nMiller - Miller's Church History - Andrew Miller\nNewman - History of the Baptist Churches in the united states - A. H. Newman\nOrchard - A Concise History of Baptists - G. H. Orchard\nPaschal - History of the North Carolina Baptists 1  - George Washington Paschal\nPerrin - History of the Ancient Christians - Jean Paul Perrin\nPurefoy - A History of the Sandy Creek Baptist tradition - Elder George W. Purefoy\nReligion and War Resistance in the Plowshares movement - Sharon Erickson Nepstad\nVedder - A Short History of the Baptists - Henry C. Vedder\nWylie - The History of Protestantism, vol 1-3 - J. A. Wylie\n","torrent":{"xt":"urn:btih:7132095f733ee4371f8e6f0c249751e0a8e4005c","amp;dn":"books+on+christian+history","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7132095f733ee4371f8e6f0c249751e0a8e4005c","infoHashBuffer":{"type":"Buffer","data":[113,50,9,95,115,62,228,55,31,142,111,12,36,151,81,224,168,228,0,92]},"announce":[],"urlList":[]}}