{"title":"The.Darkness.II-SKIDROW","uid":7020634,"size":6505448942,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7228efa60a050185289418d5dc03cdc1ba6cd893&amp;dn=The.Darkness.II-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MsB1982","files":3,"time":1328824279,"description":"S K I D R O W\n.the leading force.\n\nproudly presents\nThe Darkness II (c) 2K Games\n\n09-02-2012........Release Date &lt;-&gt; Protection.........Steam + CEG\nFPS..................Game Type &lt;-&gt; Disk(s)..................1 DVD\n\nRELEASE NOTES\n\nInspired by the popular comic book series produced by Top Cow\nProductions, Inc., The Darkness II is an intense first person shooter\nthat delivers a twisted and gripping narrative of tragedy, modern crime\ndrama, and supernatural horror.\n\nPlayers will be taken down the brutal and personal path of Jackie\nEstacado, head of a New York crime family and wielder of an ancient and\nruthless force of chaos and destruction known as The Darkness.\n\nIt's been two years since Jackie Estacado used The Darkness to kill the\nmen responsible for his girlfriend s murder. He s been unable to shake\nthe memory of Jenny's death since bottling up his supernatural power\nand now The Darkness wants out. A sudden, unprovoked attack by a\nmysterious organization known as the Brotherhood heralds the start of a\nfull-scale war and opens the door for The Darkness to reemerge, setting\nJackie on a journey to hell and worse.\n\nFeatures\n\n4-Player Co-op Campaign - Play as one of four unique characters each\ncapable of wielding weapons infused with Darkness powers.\n\nQuad-Wielding Chaos - Slash, grab, and throw objects and enemies with\nthe Demon Arms while simultaneously firing two weapons, adding a new\ndimension to the FPS category.\n\nHarness an Unstoppable Power - Master the Demon Arms and summon the\npowers of The Darkness for even more explosive gameplay.\n\nKill the Lights - The vicious powers of The Darkness manifest only in\nthe shadows so use the environment to your advantage and watch out for\nenemies who will use light as a weapon.\n\nIntense and Personal Journey - Experience a dark, twisted and gripping\nstory written exclusively for the game by acclaimed comic book author\nPaul Jenkins whose credits also include The Incredible Hulk, Wolverine,\nand the original The Darkness game.\n\nDistinctive Graphic-Noir Style - Graphic novel shading and color\ncombined with the dramatic lighting of film noir pays tribute to the\nsource material and brings the pages of the comic series to life.\nInspired by the popular comic book series created by Top Cow.\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy!","torrent":{"xt":"urn:btih:7228efa60a050185289418d5dc03cdc1ba6cd893","amp;dn":"The.Darkness.II-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7228efa60a050185289418d5dc03cdc1ba6cd893","infoHashBuffer":{"type":"Buffer","data":[114,40,239,166,10,5,1,133,40,148,24,213,220,3,205,193,186,108,216,147]},"announce":[],"urlList":[]}}