{"title":"S.P.A.Z.v0.9007 PC [Hyperdrive25].exe","uid":6507031,"size":129490265,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:747428ef793823d811d9788aa2bed8ead2066733&amp;dn=S.P.A.Z.v0.9007+PC+%5BHyperdrive25%5D.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hyperdrive25","files":-1,"time":1309460258,"description":"                  SPACE PIRATES AND ZOMBIES v9.007 PC\n                  ***********************************\n     Year: 2011  \n Platform: PC  \nPublisher: MinMax Games Ltd \nDeveloper: MinMax Games Ltd \n     Size:122 MB\n    Genre: Space Simulaion / Adventure / Strategy / Action\n\nSpace Pirates and Zombies takes place far enough in the future that Earth has become a toxic backwater planet. The galaxy has been colonized by humans, and the only means to travel to new star systems is through highly restricted and well defended warp gates. It is well known that systems closer to the galactic core become richer and richer as well as more scientifically advanced. This has led to theories of a secret system with a cache of treasure or knowledge at the galactic core feeding this growth. As a pirate, you must assemble a fleet and discover what treasure awaits you there.\n\nSpace Pirates and Zombies is a mix of the deep old school space adventure genre with modern physics, action and graphics technology.\n\n+33 ships to research, build, outfit and pilot\n+70 unique components to discover to customize ship performance\n+Totally physics based combat system\n+Explore a persistent randomly generated galaxy containing hundreds of star systems\n+Freedom to explore the galaxy and take on challenges at your own pace\n+Aid, flee, or exploit the warring factions in each star system\n+Change the balance of power in any system by interacting with its unique event  \n system that responds to player activity\n+Carefully spend your hard earned research points on hundreds of upgrades across 15 categories\n\nChanges\n-------\n- Last mothership hull has a correct name\n- Various spelling fixes\n- Distance indicator on target HUD\n- Combat mouse color overlay does not give away enemy cloaked ships\n- Trojan Horse mission tuning (pickup ship set to passive, UTA is forced to hate \n  during the mission)\n- Mission health bars now understand ship shields\n- Tactics panel buttons that have hotkeys will now show them on mouse over\n- No more invincible ship exploit\n- Better objective tracking on chapter 4 infection missions (shows remaining \n  count, health, etc)\n- UTA Distress mission will now fail if you aggravate the UTA or allow both \n  stations to be destroyed.\n- Drone component mouse over now shows connection to other weapon research \n  categories\n- Mission space props have a tiny bit of dampening to prevent them from flying off \n  into oblivion\n- Front end buttons dont get confused when there are no save games present\n- Subsystem stats on the research screen are not so confusing compared to beam \n  research.\n- Scavenger hunt mission objective more clear\n- Saving a game drops the player out of the save menu to prevent accidental save \n  clobbering\n- Artifact discovery tuning (Artifact x2 health, more time between enemy waves)\n- Shield and cloak recharge ratio shown on the HUD now\n- Research screen categories now have descriptions\n- Level up and warp gate cleared callouts now stack correctly\n- Removed some lip smack and ticks in cut scene dialog\n- Ally and friend icons on relations tutorial is now correct\n- New front end buttons take up less space (in prep for upcoming feature list)\n- Can no longer get front end and tactics panel to co-exist\n- Follow me flavored escort mission Ai is more obedient and wont be so distracted by enemies and pickups.\n- No more cloaked escort targets.\n\nSystem requirements\n-------------------\nWindows XP/Vista/7\nDirectX 9c\n2 GHz Processor \n1Gb Ram\n___________________________________________________________________________________\n\nAnother Quality Torrent Courtesy of Hyperdrive25. All My torrents are here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Hyperdrive25&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Hyperdrive25&lt;/a&gt;\n\n\nRemember To Keep Seeding. A little seeding goes a long way...\n\n***************************ITS TIME TO GO HYPER!!!*********************************\n\nI love to share,\nI love to care,\nI like to sing,\nSo that I can bring,\nA ray of sunshine in your life.\n\n\nRemember: its YOUR WORLD. I just live in it. :) \n\n          *** A BIG THANK YOU FOR ALL YOU SEEDERS OUT THERE! *** \n                            \n                        KEEP UP THE GOOD WORK!\n\n                            I LOVE U ALL!\n\n\n\n","torrent":{"xt":"urn:btih:747428ef793823d811d9788aa2bed8ead2066733","amp;dn":"S.P.A.Z.v0.9007+PC+%5BHyperdrive25%5D.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"747428ef793823d811d9788aa2bed8ead2066733","infoHashBuffer":{"type":"Buffer","data":[116,116,40,239,121,56,35,216,17,217,120,138,162,190,216,234,210,6,103,51]},"announce":[],"urlList":[]}}