{"title":"Val Guest - Dirk Bogarde - Yolande Donlan - Penny Princess (1952","uid":6650116,"size":4618129408,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7597ea6ac6f6f475b05c3a21c871cfe5dd15db77&amp;dn=Val+Guest+-+Dirk+Bogarde+-+Yolande+Donlan+-+Penny+Princess+%281952&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"oddeven","files":-1,"time":1315113774,"description":"A bit of schneese for a lazy Sunday afternoon...\n\nDirk, of course, since this is an early one, falls in love within seconds, with the manufactured ditz of Yolande Dolande, an American heiress with about as much brains as we have come to expect of heiresses. Her playful use of language is something hard to gorget. She does bring with it some American conviction and some Yankee ingenuity. Dirk brings his suave airs - there's even a seen that would best be described as a bevy of babes swooning over him, so much that the business in question's productivity is called into question - as well as some much needed brains. Perfect consort material.\n\nMs. Dolande, wife of the director, made one of her early appearances in a bit of mid-career Bela Lugosi cheese, entitled &quot;The Devil Bat&quot;, in which after shave plays a diabolic role.\n\nThe film itself starts with a rather unique titleboard:\n\n&quot;The producers wish to thank the citizens of Lampidorra for not speaking Lampidorran - thus saving the expense of English subtitles.&quot; \n\nThere are no subtitles of any kind.\n\nThis is a bare bones improvement over an earlier Greek release.\n\nUncompressed NTSC DVD5 VIDEO_TS files","torrent":{"xt":"urn:btih:7597ea6ac6f6f475b05c3a21c871cfe5dd15db77","amp;dn":"Val+Guest+-+Dirk+Bogarde+-+Yolande+Donlan+-+Penny+Princess+%281952","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7597ea6ac6f6f475b05c3a21c871cfe5dd15db77","infoHashBuffer":{"type":"Buffer","data":[117,151,234,106,198,246,244,117,176,92,58,33,200,113,207,229,221,21,219,119]},"announce":[],"urlList":[]}}