{"title":"Our Word Is Our Weapon. Selected Writings of Subcomandante Insur","uid":6600738,"size":12051029,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:75a083ba8177b93f7630eb2f29d248ec88500992&amp;dn=Our+Word+Is+Our+Weapon.+Selected+Writings+of+Subcomandante+Insur&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":4,"time":1313194456,"description":"Our Word Is Our Weapon. Selected Writings of Subcomandante Insurgente Marcos\n\n\nFormat: MP3\nBitrate: 32 Kbps\n\nIn this landmark book, Seven Stories Press presents a powerful collection of literary, philosophical, and political writings of the masked Zapatista spokesperson, Subcomandante Insurgente Marcos. Introduced by Nobel Prize winner JosÃƒÂ© Saramago, and illustrated with beautiful black and white photographs, Our Word Is Our Weapon crystallizes ''the passion of a rebel, the poetry of a movement, and the literary genius of indigenous Mexico.''\n\nMarcos first captured world attention on January 1, 1994, when he and an indigenous guerrilla group calling themselves ''Zapatistas'' revolted against the Mexican government and seized key towns in Mexico's southernmost state of Chiapas.\n\nIn the six years that have passed since their uprising, Marcos has altered the course of Mexican politics and emerged an international symbol of grassroots movement-building, rebellion, and democracy. The prolific stream of poetic political writings, tales, and traditional myths which Marcos has penned since January 1, 1994 fill more than four volumes. Our Word Is Our Weapon presents the best of these writings, many of which have never been published before in English.\n\nOur Word Is Our Weapon is divided into three sections. Section 1 brings together his essential political essays and shows the evolution of Zapatista thinking as a movement both within and outside of Mexico. Section 2 presents Marcos's philosophical thinking, personal reflections, and includes a humorous recollection of his first days as a guerrilla, as well as his letters to other writers. The third section features the many short stories, folk tales, and indigenous myths that Marcos has become known for, including his award winning ''The Story of the Colors.''\n\n\nRunning Time: 50:12\n\n\n1 Opening Remarks at the First Intercontinental Encuentro for Humanity and Against Neoliberalism\n2 To Plant The Tree of Tomorrow\n3 Why We Use the Weapon of Resistance\n4 The Word and the Silence","torrent":{"xt":"urn:btih:75a083ba8177b93f7630eb2f29d248ec88500992","amp;dn":"Our+Word+Is+Our+Weapon.+Selected+Writings+of+Subcomandante+Insur","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75a083ba8177b93f7630eb2f29d248ec88500992","infoHashBuffer":{"type":"Buffer","data":[117,160,131,186,129,119,185,63,118,48,235,47,41,210,72,236,136,80,9,146]},"announce":[],"urlList":[]}}