{"title":"Hack - Peter Wrenshall [EPUB]","uid":6564974,"size":1100875,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:760869ae00c11f022d90ab8350859921fccae6ae&amp;dn=Hack+-+Peter+Wrenshall+%5BEPUB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Dax58","files":4,"time":1311639310,"description":"Hack by Peter Wrenshall. This is a really good book and i personally recommend it, \nthe ending was really unexpected for me :P\n\n[plot]\nHack, by Peter Wrenshall, is a page-turning young adult novel set in the world of cyber crime. Teenaged computer criminal Karl Ripley is lonely and isolated, except he has a special skill and he's great at what he does-computer hacking. But when he breaks into the Pentagon's computer, a friend turns him in and he's soon arrested and sent to jail. All seems lost until the FBI offers him a job to act as bait for a terrorist, an offer he can't resist. Tormented by the friend who turned him in, Karl is obsessed with getting even. But when he meets a young woman and starts to care for her, he soon finds himself torn between revenge, his old life of crime, and a new love. But is she who she seems to be? Brimming with hairpin twists and turns, Hack explores the underbelly of computer crime. His characters are rich and engaging, and his prose is razor sharp. This is a wonderful book for any computer fanatic or any young person who enjoys a great read.","torrent":{"xt":"urn:btih:760869ae00c11f022d90ab8350859921fccae6ae","amp;dn":"Hack+-+Peter+Wrenshall+%5BEPUB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"760869ae00c11f022d90ab8350859921fccae6ae","infoHashBuffer":{"type":"Buffer","data":[118,8,105,174,0,193,31,2,45,144,171,131,80,133,153,33,252,202,230,174]},"announce":[],"urlList":[]}}