{"title":"Call of Juarez The Cartel-SKIDROW","uid":6647574,"size":7227531470,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:777169fa7f97a775f036b7380d39e37b04bdac68&amp;dn=Call+of+Juarez+The+Cartel-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DibyaTPB","files":5,"time":1315002675,"description":"\n\nS  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nCall of Juarez: The Cartel (c) Ubisoft\n\n02-09-2011........Release Date - Protection...SteamUbisoft DRM\nFPS/GTA CLONE........Game Type - Disk(s)..................1 DVD\n\nRELEASE NOTES\n\nWelcome to the new Wild West.\n\nThis first-person shooter brings the lawlessness of the Old West into\npresent day. You'll embark on a bloody road trip from Los Angeles to\nJuarez, Mexico immersing yourself in a gritty plot with interesting\ncharacters and a wide variety of game play options.\n\nExperience the lawlessness of the modern wild west as you hunt down\nthe Mendoza cartel in a world where the ends justify the means. Your\nhunt for the Cartel boss takes you on an epic road trip from a meth\nlab in the Sequoia national forest to the Cartel headquarters in\nCiudad Juarez. With over 10 distinct environments including urban LA\nbrothels and back streets, gritty boat docks, a swanky yacht party,\nthe open deserts in Arizona and New Mexico, a Mexican funeral and more.\n\nFeatures:\n\nNEW CO-OPETITION GAME PLAY\nPartner with 2 other teammates to achieve joint objectives, while\nsneaking behind their back to advance your secret personal agenda. Play\nthe 20-mission campaign mode solo or with up to 3 friends Triple the\nreplay value: Play the entire campaign with each of the 3 characters\neach character has their own unique story and distinct ending.\n\nFUN MULTIPLAYER EXPERIENCE\nPlay up to 6 vs 6 in Team Death Match and Cops vs Gangsters. As you\nplay, your character will evolve, unlocking weapons and gear.\n\nRICH STORY COMBINED WITH GAME PLAY VARIETY\nRelevant character-driven story that unfolds differently depending on\nwhich character you play. Game play is driven by variety: Punitive\nraids, witness protection, tough interrogations, undercover missions,\nshootings in crowd, car chases and more Choose between 30 weapons\nincluding pistols, revolvers, sub machine guns, machine guns, assault\nrifles, shotguns, sniper rifles, anti air weapons and more.\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder to the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy\n\nADDITIONAL NOTES\n\nUse included Launcher.exe to set languages\n\nEnjoy our new cracktro by our own demo section. More stuff to come\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix  irokos\ntitan artdivision\n\n\nEnjoy, seeding at max, also enjoy the norars!","torrent":{"xt":"urn:btih:777169fa7f97a775f036b7380d39e37b04bdac68","amp;dn":"Call+of+Juarez+The+Cartel-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"777169fa7f97a775f036b7380d39e37b04bdac68","infoHashBuffer":{"type":"Buffer","data":[119,113,105,250,127,151,167,117,240,54,183,56,13,57,227,123,4,189,172,104]},"announce":[],"urlList":[]}}