{"title":"Windows Xtreme v11.50 Pack + 5 Skins","uid":6529181,"size":41386715,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:792a31fe6327e9a2a1fa529f6306192ca29eae33&amp;dn=Windows+Xtreme+v11.50+Pack+%2B+5+Skins&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kadavul","files":1,"time":1310269051,"description":"[b]Windows Xtreme v11.50 Pack + 5 Skins[/b]\n\n\nWinstep Xtreme - the best replacement for the standard Windows shell with many convenient features, which sometimes are lacking in a standard envelope. install the package you get at the disposal of several modules, each of which performs a specific task in the design of the shell and has its own unique set of funktsiyay.\n\nAdditional Information:\n\n For example NextSTART module completely replaces the Start menu, taskbar and system notification area (system tray), with not only replace, but will allow you to use a lot of settings that are not in the standard Windows Explorer Windows. WorkShelf module is a replacement desktop, FontBrowser - handy viewer font, NeXuS - multilevel Quick access to frequently used applications\n\nNeXuS - a system of attachment, which is perfect for super fast access to most used applications. You can have a huge number of panels, but they may be hiding other menus. When not in use, you can hide them behind the screen edges, so they do not take place in the display.\n\nWorkShelf - is tabulated panel, which is best suited for complex organizational tasks, such as: organizing document, URL, movies, work projects, etc. If the panel is placed on top of your program, WorkShelf - is all that is at the bottom.\n\nNextSTART - this is the menu system, which will take care of managing all your tasks. Menus are great for accessing frequently used files and system commands that are not available in the file system or are not recognized by the user with a graphical representation. You can create any kind on the menu and hot spots NextSTART you can open all the menus with super fast access with the mouse.\n\nWinstep Xtreme has the following modules: talking atomic clock, shopping cart, checking e-mail program, monitor the weather, the program display of CPU, network and memory meters and an impressive program of Wanda Wanda. New modules are added constantly.\n\nNexus Ultimate - Good tool for quick launch of applications, weather monitoring and system data. The panel is made in the style of Mac OS. Flexibility to configure, but it is not difficult to configure. There are different skins.\n\nSkinPack:\n\n GREEN LANTERN ICON + 3 ANIMATED\n Complet Skin Nabs\n iPhone4\n Cool Glass Windows 7 Skin\n [XS] Energon 2.0\n Tron Light!\n Blue Seven","torrent":{"xt":"urn:btih:792a31fe6327e9a2a1fa529f6306192ca29eae33","amp;dn":"Windows+Xtreme+v11.50+Pack+%2B+5+Skins","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"792a31fe6327e9a2a1fa529f6306192ca29eae33","infoHashBuffer":{"type":"Buffer","data":[121,42,49,254,99,39,233,162,161,250,82,159,99,6,25,44,162,158,174,51]},"announce":[],"urlList":[]}}