{"title":"WS Video Converter Platinum (CondazArow)","uid":6621482,"size":22796400,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7959ac10a716c32c4a3d8131e163f5a593f288c0&amp;dn=WS+Video+Converter+Platinum+%28CondazArow%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CondazArow","files":2,"time":1313972189,"description":"CondazArow\n\n--------------\nWonderShare Video Converter Platinum:\n\nWondershare Video Converter Platinum can directly convert videos for playback on all popular portable video/audio players, including from HD (High Definition) and AVCHD video formats to popular video formats. It's a great tool helps to save all online videos on your PC and enjoy them with your mobile device anywhere and anytime as you like. Key Features: 1.Convert videos between various formats It support to convert videos between all popular formats and convert HD and AVCHD videos to common formats. 2.Edit videos freely as you wish Crop video to create ideal video with different screen size. Trim your video files to convert your favorite movie clips. Add special effect to your video such as Gray, Emboss, Negative and Old film. Add either text or image as watermark to coin and color your video files. Add and edit subtitle with .MKV as source file and plug-in subtitle in SRT format to your video. Merge more than one file into a single one. Capture pictures from video and save as jpeg and bmp files. 3.Extract video to various audio formats Extract audio from video. Output formats for audio: m4a,wma, wav,mp3,aac,ac3,ape, mka, ogg, au, aiff, flac, etc. 4.Fast, light and save time Support batch conversion, to convert more than one file at one time. 5.Preview and compare Two real time preview windows let you compare and get the best video effects out of movies.\n\n\nThanks for seeding and commenting my torrents!!!","torrent":{"xt":"urn:btih:7959ac10a716c32c4a3d8131e163f5a593f288c0","amp;dn":"WS+Video+Converter+Platinum+%28CondazArow%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7959ac10a716c32c4a3d8131e163f5a593f288c0","infoHashBuffer":{"type":"Buffer","data":[121,89,172,16,167,22,195,44,74,61,129,49,225,99,245,165,147,242,136,192]},"announce":[],"urlList":[]}}