{"title":"BetterZip v 2.0.2 Intel and pre[K]racked","uid":6519850,"size":6669141,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:7b484d4536e7ad0689a6199f8affef84dee31e32&amp;dn=BetterZip+v+2.0.2+Intel+and+pre%5BK%5Dracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"polisdavid","files":-1,"time":1309952537,"description":"Official Web SIte: &lt;a href=&quot; http://macitbetter.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://macitbetter.com/&lt;/a&gt;\n\nBetterZip lets you quickly inspect archives without first extracting their contents.\n\n* Extract Only Files You Really Need: If you only need a few files or \n  folders from a larger archive, you don't have to extract the whole thing. \n  Simply drag the files you need from the BetterZip window to any Finder \n  'window or the desktop.\n\n* Open Archives Without Extracting: Not only can BetterZip open\n   archives without first extracting them but you can also search for a file\n   using the iTunes-like interface. BetterZip can open and extract archives \n  with the most common formats: ZIP, SIT, TAR, XAR, GZip, BZip2, \n  RAR, 7-Zip, CPIO, ARJ, LZH/LHA, JAR, WAR, CAB, ISO, CHM,\n   RPM, DEB, NSIS, BIN, HQX.\n\n* Create Archives: Simply drag files and folders from your hard drives, \n  disks, or network places into your new zip file. You no longer have to \n  copy all the files into a temporary folder first. The supported formats are      \n  ZIP, TAR, GZip and BZip2 compressed TAR, XAR, 7-ZIP, and RAR \n  (using the external RAR commandline tool). Large archives can also be \n  split.\n\n* Protect Your Data: BetterZip can protect your data with a password and\n   create WinZip compatible AES-256 encrypted archives. 7-zip and rar \n  archives can also be protected.\n\n* Update Archives: Add new or updated files to existing archives. \n  Remove any file or folder from an archive, or even move files around \n  inside the archive as if it were a normal folder.\n\n* Make Archives Compatible: Strip Mac specific files and resource forks \n  from archives for best compatibility with systems like Windows or \n  Linux.\n\nNew Features:\n\n* Added an option to suppress the creation of folders for extracted\n  archives (in extract presets).\n\nEnhancements:\n\n* The queue window is now closed upon completion of all operations, if\n  it was opened automatically.\n\n* Enhanced Lion compatibility.\n\n* Removed option &quot;quit after last window closed&quot;. If BetterZip is started\n  as a service, it will always quit when finished. If started in normal\n  window mode, it will never quit automatically.\n\nBug Fixes:\n\n* Fixed crash when using BetterZip as a service.\n\n* Closing windows with unsaved changes now works correctly.\n\n* The password manager no longer gets confused when switching tabs in\n  the preferences window.\n\n* BetterZip no longer asks to save modified, empty archives when\n  exiting.\n\n* The queue progress bar didn't update correctly when extracting rar\n  archives.\n\n* BetterZip now prevents extracting of unsaved archives.\n\nSystem Requirements:\n\nIntel Mac OS X 10.6 or later\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:7b484d4536e7ad0689a6199f8affef84dee31e32","amp;dn":"BetterZip+v+2.0.2+Intel+and+pre%5BK%5Dracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b484d4536e7ad0689a6199f8affef84dee31e32","infoHashBuffer":{"type":"Buffer","data":[123,72,77,69,54,231,173,6,137,166,25,159,138,255,239,132,222,227,30,50]},"announce":[],"urlList":[]}}