{"title":"TOMB RAIDER  Crystal Skulls - fan made levels","uid":6522944,"size":57272169,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7f7795cf829943ddcde9ef0095fede261972a65d&amp;dn=TOMB+RAIDER++Crystal+Skulls+-+fan+made+levels&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1310057537,"description":"* Hello nice games and Tomb Raider fans ...\n\n\n* Play another nice pack with creative worked Tomb Raider Fan-Made levels ...\n\n\n* FILE INFO : COMPLETE AND PRATICAL with fantastic compression methods and WALKTHROUGH INCLUDED !\n\n\n\n\n* STORY :\n\n\n*  Early morning at Croft Manor the residents were already awake. Lara Croft, dressed up in her sports outfit, has just finished her warming-up training. Heading to the assault course outside, she went across a small room where Zip was sitting on a sofa with his laptop in his hands.\n\\&quot;Hey Lara!\\&quot;\n\\&quot;Hello Zip.\\&quot; Lara was opening the door of another room, when Zip said:\n\\&quot;Lara! Do you know Kane Pawsner?\\&quot;\n\\&quot;I have heard of him. He is the archeologist, who has found an ancient temple in Mexico recently. Why?\\&quot;\n\\&quot;He sent you a video message a few minutes ago.\\&quot;\n\\&quot;Lets see it!\\&quot;\nShortly after, the picture of a handsome, brown-haired young man appeared on the screen of Zips computer.\n\\&quot;Good morning, Miss Croft. This is Kane Pawsner, archeologist. I know something you might be interested in. I am sure you have heard about the legendary Crystal Skulls. These skulls have enormous powers and big knowledge one can hardly imagine. Well, I am searching for these skulls, trying to solve their secrets. I have to stay in Mexico for a while. I know the location of one of them, though. I have forwarded the coordinates to you. Are you interested?\\&quot;\n\\&quot;Here they are.\\&quot; Zip said, showing the location to Lara.\n\\&quot;China, the Valley of the Tigers. Sounds great.\\&quot;\nAnd so she set off...\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n* GLOBE FILES 2011 *","torrent":{"xt":"urn:btih:7f7795cf829943ddcde9ef0095fede261972a65d","amp;dn":"TOMB+RAIDER++Crystal+Skulls+-+fan+made+levels","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f7795cf829943ddcde9ef0095fede261972a65d","infoHashBuffer":{"type":"Buffer","data":[127,119,149,207,130,153,67,221,205,233,239,0,149,254,222,38,25,114,166,93]},"announce":[],"urlList":[]}}