{"title":"Alex Jones Show - 2011 July 10 SU [sebaygo1]","uid":6531448,"size":42635757,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:80315b20b31ea2932b045fec408b12f30a2d6a00&amp;dn=Alex+Jones+Show+-+2011+July+10+SU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":8,"time":1310369350,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\n\n\nSunday, 10 July 2011\n\n\n[sebaygo1]\n\n\nThe 2 hour Sunday show is typically a review of the past week's news and a look forward to the coming week's events.\n\nThe Infowars web site describes today's broadcast as follows.\n\nToday on this live Sunday edition of the Alex Jones Show, Alex covers a host of current topics and takes your calls. While the Obama Administration is under fire for lying about its knowledge of the ATF's Operation Fast and Furious, where it smuggled firearms to Mexican Drug Gangs, Alex breaks down its relation to larger government drug dealing and an attempt to use the program as a false flag against the 2nd Amendment. Alex will also discuss the lavish lives led by the elite who continue to call for carbon taxes and other curbs in development in the name of saving the environment.\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:80315b20b31ea2932b045fec408b12f30a2d6a00","amp;dn":"Alex+Jones+Show+-+2011+July+10+SU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80315b20b31ea2932b045fec408b12f30a2d6a00","infoHashBuffer":{"type":"Buffer","data":[128,49,91,32,179,30,162,147,43,4,95,236,64,139,18,243,10,45,106,0]},"announce":[],"urlList":[]}}