{"title":"The Baconing [English][SKIDROW][PC][ArShAd][sneak_shot]","uid":6650883,"size":1104391812,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8189a9463dbeb8c7d1f943602db9a085e3c8c8fa&amp;dn=The+Baconing+%5BEnglish%5D%5BSKIDROW%5D%5BPC%5D%5BArShAd%5D%5Bsneak_shot%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sneak_shot","files":-1,"time":1315143240,"description":"presenting s n e a k _ s h o t\n\n\n\nrelease date:02-09-2011\n\n\n\ndescription:\n\n\nThe Baconing is an action RPG video game developed by Hothead Games . It was published by Valcon Games on the Xbox 360 and independently on all other platforms. It was released August 30, 2011 for PlayStation 3 via the PlayStation Network and August 31, 2011 for Mac OS X and Microsoft Windows via Steam and for the Xbox 360 via Xbox Live Arcade.\n\n\n\n\nThe game opens with a bored protagonist DeathSpank. Having defeated all of his foes in the land, he decides to try on all six mystical Thongs of Virtue at once, and in doing so inadvertently creates an evil incarnation of himself, the AntiSpank. DeathSpank must then travel the land to destroy five of the six Thongs of Virtue in the Fires of Bacon. Once he is successful he can defeat the AntiSpank and bring peace to SpankTopia.\n\n\n\nThe Baconing borrows much of its gameplay from the two previous titles in the DeathSpank series, DeathSpank, and DeathSpank: Thongs of Virtue. As with the previous games, this title is an action RPG. The game can also be played cooperatively, with the first player controlling DeathSpank and the second having a choice to control of four sidekicks\n\n\n\n\n\nThe Baconing was announced on May 25, 2011 for the Mac OS X, Microsoft Windows, PlayStation 3 and Xbox 360.[3] DeathSpank was dropped from the game\\'s title, though it is a continuation of the DeathSpank series. Producer Mike Inglehart stated \\&quot;This new title isn\\'t DeathSpank 3 or DeathSpank: The Baconing, instead it should be thought of as The Baconing.\\&quot; Inglehart elaborated by saying that \\&quot;this is a standalone experience that will appeal to fans of the DeathSpank character, but also to gamers everywhere who love unique and engaging video games.\\&quot;[4] Inglehart also clarified that the DeathSpank prefix was not removed due to copyright or trademark issues.\n\n\n\n\nIt was released on August 30, 2011 on the PlayStation 3 as part of the PSN Play promotion on the PlayStation Network.[5] The Mac OS X, Microsoft Windows and Xbox 360 versions were released on August 31, 2011.\n\n\n\n\nthanks to:        ArShAd\n\n\n\n\n\n\nseed comment n enjoy...!!!\n","torrent":{"xt":"urn:btih:8189a9463dbeb8c7d1f943602db9a085e3c8c8fa","amp;dn":"The+Baconing+%5BEnglish%5D%5BSKIDROW%5D%5BPC%5D%5BArShAd%5D%5Bsneak_shot%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8189a9463dbeb8c7d1f943602db9a085e3c8c8fa","infoHashBuffer":{"type":"Buffer","data":[129,137,169,70,61,190,184,199,209,249,67,96,45,185,160,133,227,200,200,250]},"announce":[],"urlList":[]}}