{"title":"When a man loves a woman 720p HDTV XviD (moviesbyrizzo)","uid":6862143,"size":4507126195,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:81fc2a8f477f8388504de453f8329cc527c6afb2&amp;dn=When+a+man+loves+a+woman+720p+HDTV+XviD+%28moviesbyrizzo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1322938451,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0111693/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0111693/&lt;/a&gt;\n\nThis is the HDTV version of the PAL multisubs release (2:00 hrs)\n\n1280 X 688 DivX 4700k video bitrate from PAL DVD convert 256k audio \nincludes songs from soundtrack including Michael Bolton instead doing\n&quot;When a man loves woman&quot; and our suggested addition of &quot;have I told you lately&quot;\n\n\nSRT Subtitles extracted from the PAL DVD version include Swedish, German, Norwegian, Finnish, Polish, Hungarian, Portuguese, Icelandic. Spanish \nand Dutch were downloaded from the net as they weren't on the disc, nor could\nwe find Italian anywhere. So we promise a special Italian version with hard-coded\nIrish style subtitles as soon as we find an srt file on the net or elsewhere soon!\nAll SRT files are in UTF-8 format\n\n\nI watched most of this movie feeling pain in remembering relationships I've\nhad with the &quot;Meg Ryans&quot; of this world - to whatever degree individually,\nand I could only keep saying out loud &quot;Please! Please! Please! don't \nleave me Meg! (I was putting myself into the picture in Andy Garcia's role -\nalthough I'm real Irish-Italian and he has the same stuff - only from a\ndifferent school. (I was married into a wealthy family from Australia - \na gal with a princess like charm in what was her manner. \nShe was called Elizabeth.\n\nMeg Ryan has a problem - the pickings are slim, folks always trying to talk \nher out of taking real and genuine care where its available (And Andy Garcia\nhas it to spare if you really get to know the true greatness in him - and she doesn't think he cues quite as much on the quick uptake and so she feels left\nout when around her own crowd.\n\nYet what is being on the &quot;in&quot; of pop culture in America preaching to Meg other\nthan &quot;affirmative action&quot; of the worst kind exclusively?\n\nIt is true though that Garcia is perhaps too intense in his approach at times,\nsometimes seeming blind to what is good and the right thing to do. he is\nI think, smothering towards the child in this movie shown wanting to seek out\nher real father for example - I suggest he uses the wrong instincts to\nwin - sorta thinking all can even be somehow in a figurative sense brought to\ntheir knees as it were, in some respect - if he were to perhaps just maybe insist\non the &quot;it'll pass&quot; approach as the right solution to what the problems are,\nas he sees them instead.\n\nYou certainly do have to know when to give a person space, and realize what is\neven somewhat assaultive (strong word) in some respect, on fragile sensibilities.\nYet Garcia wants to be good - and he has it within him to learn the better way.\nWe aren't shown much in the movies of what Meg Ryan often has to endure from\ntypes she's normally around - you might just consider Garcia an actual saint\nin the making after all.\n\n\nMeg Ryan often plays too hard to get (in life through such situations) in a way\nthat cannot be overcome, other than she feels you have had to endure so as to \naffirm her sense of worth. What is that worth? Fact is that if she chose to\npresses the bargain - there's no price too high that she wouldn't deserve\nhypothetically. Such German-Irish gals are as God on earth in their capacity\nfor Christianly beauty that is not seconded anywhere on gods green earth - \nI speak of course broadly to include all the Irish spirited gals of \nthe most dear in Germany and even Sweden and elsewhere - even the US/Russia\ncertainly too. Yet the American model is certainly in particular a great\nChristian the capacity for goodness so as to be a beacon to the planet at\nsome point. They'd have to remember the accent they once spoke with back in \nGermany or Ireland - and lo and behold - even more true brilliance would overcome\nthem. Of this I am altogether certain. Truly great folks there\n\n\nBut what's the point  of breaking something just to hand it to someone back and\nthen say &quot;now you can keep it cause if it wasn't broke - it would be more than\nyou deserve. (Referring to Garcia's capacity to show a loving heart here in a\nmanner of speaking that is, and Megs care for him in return).\n\nNo man can truly and adequately deserve Meg Ryan I suppose. She is just too\nbeautiful for adequate human appreciation. She has to be cared for and nurtured\nand love without reservation. But if she is to remain sane and in her human beauty\nshe must be fair as well, to those who are deserving it. They only must be willing\nto try and be ably willing to do better - and demonstrably so - they might just\nturn out to be the best when they have been shown the ropes. Only they'd have to\ncome with some wisdom too and the stuff of Garcia has endured much and remained\ngreatly virile and committed to the care of family and with true genuine emotions\nof conscientious care and love second to none, I submit, when it is in fact secure.\n\nMeg Ryan deserves an Irish spirited man who has real love to give and will\ntreasure and comfort her and bring her joy. Andy Garcia should be allowed to\naudition in full fairness. He could just be the best she's got with what the\nworld has come to in some respects now. I can tell you his sort doesn't \ntolerate OJ getting away with what he did - and he would stake his life if he\nwere protecting his own in a situation of life and death in the legitimate\ndefence of his community. That's scary for some - on the other hand - what's\nnot scary about those that ask OJ for autographs instead? I'm just saying Meg\ndoesn't have any true vocal friends left - as they're all preachin equality down\nthere just now. So what's a lovely gal to do? \n\n\nBy the way, its not quite fair that she asks Garcia not to act as though he can \ncure all with just his strength. Loving care with supportive strength of\ntrue Christianly wisdom is what a man must give or no woman will remain healthy\nmentally speaking. Her spirit will wither and she will not remain with him given\nthe chance. She needs strength. But physically engaged strength alone cannot save\nthe day in America. You have to be on the &quot;team&quot;  as it were or no one pulls the\nstrings for you. as such he faces unfair competition and doesn't really know the\nsystem he is into well enough to play as a winner should. He might just be shocked\nto learn how to cue well enough to say yeah' I guess I could sell my soul too.\n\nI never had any tolerance for seeing someone raise their voice to a Meg Ryan\nhowever I now only insist it be in competent true Christianly spirit (god-\nlike in fact), based on merited genuine care and true love and in fully deserving\nfashion - or else I'm not going to stand idly by myself! I love this gal dearly\nand it is to her happiness that I stake my life. At the expense of all - none\nexcepted! be nice to this gal, huh! \n\n\nI love you Meg Ryan! Please don't ever leave a nice guy again! They be hard\nto find as it is dear! ever seen a grown man cry? that's what Andy Garcia and\nme are made to do with genuine care!\n\nSo there!\n\nMichael Rizzo Chessman\nmoviesbyrizzo\t","torrent":{"xt":"urn:btih:81fc2a8f477f8388504de453f8329cc527c6afb2","amp;dn":"When+a+man+loves+a+woman+720p+HDTV+XviD+%28moviesbyrizzo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81fc2a8f477f8388504de453f8329cc527c6afb2","infoHashBuffer":{"type":"Buffer","data":[129,252,42,143,71,127,131,136,80,77,228,83,248,50,156,197,39,198,175,178]},"announce":[],"urlList":[]}}