{"title":"Paths of Glory","uid":6569423,"size":4098686976,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8219fef13c0c2fafa005c966c82cb254c9715912&amp;dn=Paths+of+Glory&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hoofdkussen","files":-1,"time":1311876696,"description":"www. Norskbits .com - Last ned Filmer, TV-serier, Spill, Program og Musikk http://www.norskbits.com\n\nCheck :: http://www.norskbits.com :: for more of my torrents, and the rest of the Kubrick collection!\n\nThis bargain &quot;collection&quot; features three of Stanley Kubrick's earliest feature films: Killer's Kiss, The Killing and Paths of Glory. \n\nKiller's Kiss (1955) was, after the barely-released and now-unavailable Fear &amp; Desire, the first of Kubrick's movies to see the light of day. It draws heavily upon a short boxing documentary which Kubrick produced earlier, called &quot;The Day of the Fight&quot;, but is none the worse for that, and certainly has its moments. Look out for the scene amongst the shop dummies and the chase through the streets near the end which is eerily prescient of the much later &quot;2001: a space odyssey&quot; (1968). \n\nThe Killing (1956) is a giant leap forward, and tells its story in an unconventional way, which Tarantino acknowledged as a prime source for his &quot;Reservoir Dogs&quot; debut. The characters are well-developed and we really care what happens to them in this tense story of a racetrack heist. \n\nPaths of Glory (1957) can be seen as the first of Kubrick's anti-war trilogy, the others being &quot;Dr Strangelove...&quot; (1964) and &quot;Full Metal Jacket&quot; (1987). It has the finest cast of these three films and features Kirk Douglas as Colonel Dax, a French commander in the trenches during the First World War. He is ordered to undertake an impossible task with his platoon by his general (George Macready)who is trying to impress his own superior officer (Adolphe Menjou). When it inevitably goes wrong he insists on holding a court-martial for those involved... The cinematography is especially impressive, featuring wonderful &quot;backwards&quot; tracking shots through the trenches in front of the advancing Dax, and gleaming shots of the generals' palatial surroundings. The final tear-jerking scene features Kubrick's future wife as the young singer. \n\nThere are very few DVD extras, but the films themselves are what you will return to time and again. Highly recommended for those who love cinema but haven't seen these films.\n\n\nwww. Norskbits .com - Last ned Filmer, TV-serier, Spill, Program og Musikk http://www.norskbits.com\n\nCheck :: http://www.norskbits.com :: for more of my torrents, and the rest of the Kubrick collection!\n","torrent":{"xt":"urn:btih:8219fef13c0c2fafa005c966c82cb254c9715912","amp;dn":"Paths+of+Glory","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8219fef13c0c2fafa005c966c82cb254c9715912","infoHashBuffer":{"type":"Buffer","data":[130,25,254,241,60,12,47,175,160,5,201,102,200,44,178,84,201,113,89,18]},"announce":[],"urlList":[]}}