{"title":"SAFE HOUSE cam XVID color GLOBE","uid":7029484,"size":1074240853,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:82ef720b824e1157a2d566616fb4dbb3169bd5bb&amp;dn=SAFE+HOUSE+cam+XVID+color+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1329179392,"description":"* XVID   * 01H45M11S    * + 1200 Bitrate    * Worked with the Dub plugins\n\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* Intro :\n\nSafe House is an action thriller film directed by Daniel Espinosa, starring Denzel Washington and Ryan Reynolds. It was released on February 10, 2012 in North America by Universal Pictures. Filming took place in Cape Town, South Africa.\n\n\n* Plot :\n\nAfter acquiring a seemingly invaluable file, rogue ex-CIA agent Tobin Frost flees to a US embassy while under fire. \nHe is apprehended and placed in a safe house in South Africa, where young CIA-operative Matt Weston (Ryan Reynolds) acts as its guardian. The operatives interrogate Frost in order to reveal all of his criminal contacts by water-boarding him. A group of rebels interrupt the torture and kill everyone inside as Weston and Frost flee outside. Weston commandeers one of the civilian vehicles and orders Frost to get inside its trunk. Frost obeys as the rebels step outside and Weston leads them on a high speed chase around Cape Town.\nAfter escaping successfully, Weston contacts his superior, David Barlow (Brendan Gleeson). He\\\\\\\\\\\\\\'s more than hesitant when another official, Catherine Linklater (Vera Farmiga), orders him to go off the grid and to await further instructions. Meanwhile, Weston takes Frost to a run down apartment, where he demands that Frost handcuffs himself to the wall. He does so peacefully. Meanwhile, Weston contacts his girlfriend, Ana Moreau, and asks her to tell him if there are any suspicious vehicles outside of her residence. Ana notices a police vehicle and reports it to him. Weston then tells her to leave her apartment because it\\\\\\\\\\\\\\'s not safe for her to be there anymore. \nWhen asked to provide an explanation for recent events, he makes up a cover story instead of telling her the truth. \nWeston is then ordered by the CIA to retrieve a \\\\\\\\\\\\\\'package\\\\\\\\\\\\\\' - a bag with a GPS inside detailing the location of another safe house where Weston is supposed to escort Frost to. He does so, with Frost at gunpoint, and starts to leave the stadium.\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n* GLOBE FILES 2012 *\t\t","torrent":{"xt":"urn:btih:82ef720b824e1157a2d566616fb4dbb3169bd5bb","amp;dn":"SAFE+HOUSE+cam+XVID+color+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82ef720b824e1157a2d566616fb4dbb3169bd5bb","infoHashBuffer":{"type":"Buffer","data":[130,239,114,11,130,78,17,87,162,213,102,97,111,180,219,179,22,155,213,187]},"announce":[],"urlList":[]}}