{"title":"sr-pofbc.iso","uid":6580513,"size":1566685184,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:84104b03db76a23481175d235e7f76883cfeb6ba&amp;dn=sr-pofbc.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zukke","files":1,"time":1312380195,"description":"release date:03-08-2011\n\n\n\ndescription:\n\n\n\nIt\\'s the 16th century, the golden era of pirates, and this is your\nchance to become the pirate king and conquer the Caribbean. Start out\nas a humble pirate and earn fame and notoriety to become a recognized\npirate captain.\n\nEventually you will be able to join infamous pirate strongholds like\nPort Royal, Tortuga and others. Getting promotions within the pirate\nbrotherhood requires force, daring, guile and even deceit. But be\ncareful because other pirates will be competing for promotions too.\nHowever, bribery, favors and outright assassinations will assure you\nclimb the ranks faster. As you are promoted to higher ranks, you will\nown, manage and develop parts of the stronghold and entice other\ncaptains to join your fleet. After building your fleet destroy the\nother two pirate strongholds to become the King of All Pirates.\nCombining elements from fast-paced naval action to light town\nmanagement, Conquest of the Caribbean is a game no pirate fan should\nmiss.\n\nFeatures:\n\nRoam the open World with your Pirate crew and pick up missions as you\nsail the seas.\n\nNotoriety and fame brings you closer to your ultimate goal: the King of\nAll Pirates\n\nBattle it out with rival pirates and nations on both land and sea\n\nExperience life as a pirate through three campaigns and eras\n\nGather famous pirates to your crew, but be sure to keep them supplied\nwith rum or they\\'ll side with your rivals\n\nSelect your character from several different Pirate Captains, each with\ntheir own unique skills and features!\n\n\nsame as sneak shot just unpacked :)","torrent":{"xt":"urn:btih:84104b03db76a23481175d235e7f76883cfeb6ba","amp;dn":"sr-pofbc.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84104b03db76a23481175d235e7f76883cfeb6ba","infoHashBuffer":{"type":"Buffer","data":[132,16,75,3,219,118,162,52,129,23,93,35,94,127,118,136,60,254,182,186]},"announce":[],"urlList":[]}}