{"title":"Little House On The Praire Series One-Disc 3 -Episodes[9-12]","uid":7026470,"size":3073596362,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:86839baa7838c9de1f36c83f0f5a478a59b987ee&amp;dn=Little+House+On+The+Praire+Series+One-Disc+3+-Episodes%5B9-12%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"jocktheripper","files":-1,"time":1329031032,"description":"note[ sorry but torrent file is mis labeled]\n\nlittle house on the prairie series one -disc 3 ep[9-12]\n\nh.264 mp4\n\nimdb: http://www.imdb.com/title/tt0071007/\n\nrating: 7.5\n\n\n\nEpisode 9[School Mom]\n\nCaroline's special efforts to teach a shy, older boy to read while she is substitute-teaching for an injured Miss Beadle are ruined when mean-spirited Mrs. Oleson humiliates him in front of the class and he vows never to return to school.\n**************************\n\nEpisode 10[The Raccoon]\n\nBlaming herself when Laura's doll breaks during a game of catch, Mary is delighted to give her sad, little sister an abandoned, baby raccoon. After Pa reluctantly agrees to let her keep him, Laura names him &quot;Jasper&quot;, teaches him tricks and tries to keep the mischief-maker out of trouble. But one day, Jasper bites Jack, the Ingalls' dog, and disappears into the woods. When Charles later shoots a snarling, rabid raccoon who is killing the chickens and begins to watch Jack for signs of rabies, a tearful Mary reveals a terrible secret... Jasper had also bitten Laura\n**************************\n\nEpisode 11[The Voice Of Tinker Jones]\n\nA deaf-mute traveling tinker may have the only solution after Rev. Alden's request for a new church bell starts the Kennedys and Olesons feuding over who will donate the bell and who will take the credit.\n**************************\n\nEpisode 12[The Award]\n\nA frightened, angry Caroline impulsively forbids Mary from taking a scholarship exam as punishment for accidentally starting a late-night fire in the barn where she had gone to study to keep from waking her sleeping little sister, Laura. But more than anything, Mary wants the exam winner's prize, a beautiful, new Webster's Dictionary, and when she delays telling her teacher that she won't be taking the test, Laura worries that her big sister is planning to defy their mother.\n**************************","torrent":{"xt":"urn:btih:86839baa7838c9de1f36c83f0f5a478a59b987ee","amp;dn":"Little+House+On+The+Praire+Series+One-Disc+3+-Episodes%5B9-12%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86839baa7838c9de1f36c83f0f5a478a59b987ee","infoHashBuffer":{"type":"Buffer","data":[134,131,155,170,120,56,201,222,31,54,200,63,15,90,71,138,89,185,135,238]},"announce":[],"urlList":[]}}