{"title":"James A. Michener's Texas - cOOt","uid":6874987,"size":2581019544,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:872d3f4629a012e703e01518c5f9347072aca50b&amp;dn=James+A.+Michener%5C%27s+Texas+-+cOOt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"jerry7_57","files":-1,"time":1323383886,"description":"James A. Michener's Texas (also called Texas) is a 1994 ABC television movie directed by Richard Lang and starring Patrick Duffy as Stephen Austin, Stacy Keach as Sam Houston, Chelsea Field as Maddie Quimper, Rick Schroder as Otto McNab, Grant Show as William Travis, David Keith as Jim Bowie, John Schneider as Davy Crockett, MarÃƒÂ­a Conchita Alonso as Lucia, and Benjamin Bratt as Benito Garza. The film is narrated by Charlton Heston.\n\nThe year is 1821. The vast, unsettled territory that will one day be known as Texas still belongs to Mexico. But the forces that will shape the future of this sprawling land have already been set in motion. It begins with Mexico's infamous and brutal General Santa Anna and explodes into an armed revolt waged by such legendary names as the fiery and headstrong Sam Houston, Stephen Austin, the Father of Texas and the immortal heroes of the Alamo: Davy Crockett and Jim Bowie. Set against the thrilling backdrop of America's turbulent frontier, Texas weaves a dazzling, epic tapestry of conflict romance and adventure. It's the story of an inspiring fight for freedom and statehood - and of the soldiers, settlers, outlaws and empire-builders caught up in their young homeland's stormy quest to fulfill its extraordinary destiny!\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0108316/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0108316/&lt;/a&gt;\n\nEnjoy the show, and thanks for choosing cOOt torrents","torrent":{"xt":"urn:btih:872d3f4629a012e703e01518c5f9347072aca50b","amp;dn":"James+A.+Michener%5C%27s+Texas+-+cOOt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"872d3f4629a012e703e01518c5f9347072aca50b","infoHashBuffer":{"type":"Buffer","data":[135,45,63,70,41,160,18,231,3,224,21,24,197,249,52,112,114,172,165,11]},"announce":[],"urlList":[]}}