{"title":"Democracy Now - 24 aug 2011","uid":6627533,"size":453580619,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8827c6c6f14eb95909814ce1b5b46f08dde13fb4&amp;dn=Democracy+Now+-+24+aug+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1314205658,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\n\nHeadlines for Aug 24, 2011\n\n- Gaddafi Vows &quot;Martyrdom&quot; As Battle For Tripoli Persists\n- NY Attorney General Booted From Mortgage Company Settlement Task Force\n- NY Supreme Court Dismisses Sex Crimes Charges Against Former IMF Chief\n- Nuclear Power Plant Near East Coast Earthquake Epicenter Lacking Seismographs Since 1990s\n- Military Contractor KBR Sues Gang-Rape Accuser For $2 Million\n- New Jersey ACLU Joins Parents in $100 Million Lawsuit Over Facebook Donation\n- South Sudan Calls For Troop Deployment Following Massive Revenge Killings\n- Chile's Largest Labor Union Calls Two-Day Strike as Students Continue Protests\n- Democrats Nominate Mississippi's First African-American Gubernatorial Candidate in Modern History\n- Report: Climate Change Disproportionately Impacts Indigenous Americans\n- Canadian Actors Arrested Alongside 60 Others in Pipeline Protest at White House\n- Foreign Policy Adviser to Mitt Romney Actively Supporting Iranian Terrorist Organization\n\n\nSpecial reports\n\n- The $1 Billion Dollar Question: Who Are the Libyan Rebels?\n\nLibyan rebels have consolidated their grip on the capital of Tripoli by capturing Col. Muammar Gaddafi's main compound, but the whereabouts of the Libyan leader remain unknown and he has vowed his forces would resist &quot;the aggression with all strength&quot; until either victory or death. Reporters in Tripoli say heavy gunfire could still be heard nearby the area of the Rixos hotel where dozens of international journalists guarded by heavily armed Gaddafi loyalists are unable to leave. The Arab league said on Tuesday it will meet this week to consider giving Libyan rebels the country's seat at the league, after it was taken away a few months ago from the Gaddafi government. Today Britain's National Security Council is meeting to to discuss unfreezing Libyan assets to financially assist the National Transitional Council. We speak with Gilbert Achcar, a professor at the School of Oriental and African Studies in London. &quot;Who are the rebels? Well, this is the $1 billion question,&quot; says Achcar. &quot;Even in NATO's circles, you find the same questions.&quot;\n\n\n- The 9/11 TV News Archive: 3,000 Hours of Video News Coverage of 2001 Attacks Posted Online\n\nAs the nation prepares to mark the 10th anniversary of the September 11 attacks, a pair of leading Internet archivists are launching an ambitious project called &quot;Understanding 9/11: A Television News Archive,&quot; which catalogs 3,000 hours of domestic and international TV news footage from 20 channels from the week around September 11, 2001. Television news coverage of the September 11 attacks and their aftermath not only documented one of the most important events in mass memory, but also influenced public perception. We feature excerpts of coverage from the global archive and speak with the its organizers, Brewster Kahle and Rick Prelinger. Kahle is an Internet entrepreneur, activist, digital librarian and founder of the Internet Archive and the Open Content Alliance, a group of organizations committed to making a permanent, publicly accessible archive of digitized texts. Prelinger is an archivist, writer, filmmaker and founder of the Prelinger Archives, a collection of 60,000 advertising, educational, industrial and amateur films acquired by the Library of Congress in 2002 after 20 years' operation. &quot;[9/11] was a major event, that was really a television event. People understood this through television,&quot; says Kahle. He adds that seeing &quot;how people are starting to come to grips with it really shaped how we saw the whole event.&quot;\n\n\n- Pioneering Internet Archivists Brewster Kahle and Rick Prelinger on Preservation in the Digital Age\n\nInternet archivists Brewster Kahle and Rick Prelinger discuss their efforts to build both a physical and digital library of every book ever published. &quot;The idea is to build a library of Alexandria, version two,&quot; says Kahle. &quot;It costs us about 10 cents a page or about $30 a book to photograph and then make it accessible and searchable for anyone.&quot; The archivists also discuss their home movie project. &quot;Home movies are astonishing. They're personal not corporate expression,&quot; says Prelinger. &quot;They're individuals witnessing history, not simply great events but also history everyday life.&quot; The movies are being contributed by families and rescued from estate sales, among other sources.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:8827c6c6f14eb95909814ce1b5b46f08dde13fb4","amp;dn":"Democracy+Now+-+24+aug+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8827c6c6f14eb95909814ce1b5b46f08dde13fb4","infoHashBuffer":{"type":"Buffer","data":[136,39,198,198,241,78,185,89,9,129,76,225,181,180,111,8,221,225,63,180]},"announce":[],"urlList":[]}}