{"title":"Batman Begins -2005- 1080p [PS3 &amp; fat32 Compatible]","uid":6573341,"size":11712318972,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:8950913c3317b6cb32176665aacbcda9152b43b1&amp;dn=Batman+Begins+-2005-+1080p+%5BPS3+%26+fat32+Compatible%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DarthPS3","files":3,"time":1312069347,"description":"This is my third movie upload, second 1080p upload. \nThis movie has been split into three parts to easily transfer on to a portable hard drive. \nThe files have also been converted to play directly on the PS3 system, eliminating the need to stream the file and allowing for easier routine transfers between hard drives formatted to fat32, which will not allow a single file to transfer if it is over 4 gigs. \n\nThank you to all the teams, scenes and other uploaders that have brought so much delightful fun into my life.\n \nPlease help seed when done.\n\nAs always, please be patient for the first 3-4 days after I initially upload the torrent. Thank you to all those that have helped seed my other torrents, which allows me to continue uploading new stuff. \n These are all my personal files, films and television shows that I could not find (most often in high resolution) in a format that would allow me to simply pop on a external hard drive. I converted all these files, and since they are sitting there decided to share them.\n Though my torrents take a few days to download, most of the original sources that I myself downloaded took a few days.\n So, if you want to go find and download those original sources, awesome, but if you were as frustrated as I was and either don't want to convert them or don't know how, here you go. \n\n ","torrent":{"xt":"urn:btih:8950913c3317b6cb32176665aacbcda9152b43b1","amp;dn":"Batman+Begins+-2005-+1080p+%5BPS3+%26+fat32+Compatible%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8950913c3317b6cb32176665aacbcda9152b43b1","infoHashBuffer":{"type":"Buffer","data":[137,80,145,60,51,23,182,203,50,23,102,101,170,203,205,169,21,43,67,177]},"announce":[],"urlList":[]}}