{"title":"Men In Black(1997)DVDRip.AC3(ENG)-DROCK","uid":6566088,"size":733264888,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8a91407e2ed512bebdec218f0d2a7d0ce76f95c5&amp;dn=Men+In+Black%281997%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1311687849,"description":"For his fifth effort as a feature-film director, one-time cinematographer Barry Sonnenfeld brought his cartoonish visual style and darkly humorous sensibilities to this adaptation of, appropriately enough, a tongue-in-cheek sci-fi comic book. Will Smith stars as James Darrel Edwards, a New York City cop with an athletic physique and a flippant, anti-authoritarian attitude toward law enforcement. After chasing down a mysterious perpetrator one night who turns out to be an alien, James is recruited by &quot;K&quot; (Tommy Lee Jones), a veteran of a clandestine government agency secretly policing the comings and goings of aliens on planet Earth. Nicknamed the &quot;men in black&quot; for their nondescript uniform of black suit, shoes, tie, and sunglasses, the agents are assigned to recover a bauble that's been stolen by an intergalactic terrorist (Vincent D'Onofrio). It seems the item is none other than the galaxy itself, and its theft has plunged humanity into the center of what's shaping up to become an interstellar war, unless K and his new wisecracking partner, now renamed &quot;J,&quot; can stop the bad guy. On their side but somewhat in the dark is a pretty, unflappable city medical examiner (Linda Fiorentino) who has been zapped one too many times by K's ingenious memory-sapping device. Men in Black was a box office smash, inspiring an animated children's television series and a hit soundtrack album that featured a performance by star (and rapper) Smith. \n\nRipped with Handbrake.\n\nLength: 1 Hour 38 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 160kbps","torrent":{"xt":"urn:btih:8a91407e2ed512bebdec218f0d2a7d0ce76f95c5","amp;dn":"Men+In+Black%281997%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a91407e2ed512bebdec218f0d2a7d0ce76f95c5","infoHashBuffer":{"type":"Buffer","data":[138,145,64,126,46,213,18,190,189,236,33,143,13,42,125,12,231,111,149,197]},"announce":[],"urlList":[]}}