{"title":"Omega Syndrome (VHS Rip) Dutch Subs","uid":6582920,"size":1483193298,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8aabda5200273952ba5f7dff09a1faa7a3e4cbf3&amp;dn=Omega+Syndrome+%28VHS+Rip%29+Dutch+Subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rubberboy37","files":1,"time":1312489198,"description":"Aktie\n88 minuten\nAVI\nVHS Rip\n1987\n\nMet Ken Wahl (Purple Hearts, The Soldier)en Nicolle Eggert (Blown Away, When She Was Bad)\n\nLos Angeles wordt geterrorisseerd door een machtige misdadige Neo-Nazi bende genaamd: Omega. Op een dag weet de politie een van de bende leden, Ralph Dunlap, te arresteeren en hem in ruil voor bescherming er toe te brengen een verklikker te worden. Tijdens het politiestransport van Ralph naar zijn veilige onderkomen, vindt een brute overval plaats. Twee van de meest gevreesde Omega leden, de krankzinnige, en aan geweld verslaafde Yo-Yo en de voor niets terugdeinzende, koelbloedige sadist Saxon, richten een waar bloedbad aan. RalphÃ‚Â´s drie man sterke politiebegeleiding wordt vermoord en hijzelf komt zwaargewond in het ziekenhuis terecht. Omega blijft een bedreiging voor zijn leven. Yo-Yo- en Saxon zitten echter niet stil en kidnappen de tienerdochter van Jack Corbett, een aan lager wal geraakte journalist. Met gevaar voor zijn eigen leven valt hij de rechtse terroristen aan, wordt bewusteloos geslagen en ontdekt na bijgekomen te zijn dat zijn dochter Jessie spoorloos is. De politie kan (en wil) hem niet helpen. Dan zit er maar nog ÃƒÂ©ÃƒÂ©n ding op: als Vietnam-veteraan heeft hij voor wel hetere vuren gestaan, dus samen met zijn keiharde dienstmakker 'Philadelphia' Horton begint hij een genadeloze speurtocht naar zijn dochter Jessie.\n\nWegens gewelddadige scenes niet geschikt voor al te jeugdige kijkers.","torrent":{"xt":"urn:btih:8aabda5200273952ba5f7dff09a1faa7a3e4cbf3","amp;dn":"Omega+Syndrome+%28VHS+Rip%29+Dutch+Subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8aabda5200273952ba5f7dff09a1faa7a3e4cbf3","infoHashBuffer":{"type":"Buffer","data":[138,171,218,82,0,39,57,82,186,95,125,255,9,161,250,167,163,228,203,243]},"announce":[],"urlList":[]}}