{"title":"Andersonvilles of the North","uid":6532327,"size":1421945,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b366fe7b2d462c593c129c15bdbd0f41acdb147&amp;dn=Andersonvilles+of+the+North&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_F1_","files":-1,"time":1310389344,"description":"James M. Gillispie, &quot;Andersonvilles of the North&quot;\n University of North Texas Press | English | 2008 | ISBN: 1574412558 | 296 pages | PDF | 1.35 MB\n\n Soon after the close of military operations in the American Civil War, another war began over how it would be remembered by future generations. The prisoner-of-war issue has figured prominently in Northern and Southern writing about the conflict. Northerners used tales of Andersonville to demonize the Confederacy, while Southerners vilified Northern prison policies to show the depths to which Yankees had sunk to attain victory.\n Over the years the postwar Northern portrayal of Andersonville as fiendishly designed to kill prisoners in mass quantities has largely been dismissed. The &quot;Lost Cause&quot; characterization of Union prison policies as criminally negligent and inhumane, however, has shown remarkable durability. Northern officials have been portrayed as turning their military prisons into concentration camps where Southern prisoners were poorly fed, clothed, and sheltered, resulting in inexcusably high numbers of deaths.\n Andersonvilles of the North, by James M. Gillispie, represents the first broad study to argue that the image of Union prison officials as negligent and cruel to Confederate prisoners is severely flawed. This study is not an attempt to &quot;whitewash&quot; Union prison policies or make light of Confederate prisoner mortality. But once the careful reader disregards unreliable postwar polemics, and focuses exclusively on the more reliable wartime records and documents from both Northern and Southern sources, then a much different, less negative, picture of Northern prison life emerges. While life in Northern prisons was difficult and potentially deadly, no evidence exists of a conspiracy to neglect or mistreat Southern captives. Confederate prisoners' suffering and death were due to a number of factors, but it would seem that Yankee apathy and malice were rarely among them.\n In fact, likely the most significant single factor in Confederate (and all) prisoner mortality during the Civil War was the halting of the prisoner exchange cartel in the late spring of 1863. Though Northern officials have long been condemned for coldly calculating that doing so aided their war effort, the evidence convincingly suggests that the South's staunch refusal to exchange black Union prisoners was actually the key sticking point in negotiations to resume exchanges from mid-1863 to 1865.\n Ultimately Gillispie concludes that Northern prisoner-of-war policies were far more humane and reasonable than generally depicted. His careful analysis will be welcomed by historians of the Civil War, the South, and of American history.","torrent":{"xt":"urn:btih:8b366fe7b2d462c593c129c15bdbd0f41acdb147","amp;dn":"Andersonvilles+of+the+North","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b366fe7b2d462c593c129c15bdbd0f41acdb147","infoHashBuffer":{"type":"Buffer","data":[139,54,111,231,178,212,98,197,147,193,41,193,91,219,208,244,26,205,177,71]},"announce":[],"urlList":[]}}