{"title":"Het Blok S07E02 XviD","uid":6659878,"size":366537803,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8c55d248e2c1f3765aa511045a4addac9e74e787&amp;dn=Het+Blok+S07E02+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ProGemist","files":-1,"time":1315477101,"description":"Het Blok S07E02 2011 XviD\n\nDe populaire klusstrijd Het Blok start heftig. Voordat de koppels het pand kunnen \n\nbetreden, staat hen een battle te wachten. Dit is niet zomaar een battle. De koppels moeten 24 uur lang achter elkaar klussen. Goed presteren is van levensbelang, want de uitslag is allesbepalend voor het verdere verloop van Het Blok. Dat het zwaar wordt is een feit, maar deze eerste opdracht brengt meteen zoveel emoties en frustraties met zich mee dat de koppels compleet overdonderd worden. De toon is gezet! Het Blok start vanaf 31 augustus om 20.30 uur met een extra lange eerste aflevering op Net5. \nIn de eerste aflevering arriveren de vier koppels gespannen op een geheime locatie in Amsterdam, waar Erik van der Hoff ze verwelkomt bij de heftigste openingsbattle ooit. In 24 uur tijd moeten de koppels vanuit het niets een compleet ingerichte woonkamer neerzetten met muren, ramen en een vloer. Maar dit niet alleen, de kamer moet ook volledig geschilderd en ingericht worden. Slapen is dus absoluut geen optie! Het wordt een hectische en bovenal slopende race tegen de klok, waarbij de emoties hoog oplopen. Als de stofwolken van deze slopende battle dan eindelijk zijn opgetrokken, rijst de vraag wie de opdracht het beste heeft volbracht en dus de winnaar is. Nog belangrijker: wat heeft het winnende koppel gewonnen? \nHet Blok gaat dit seizoen 'back to basic' en bevat alle vertrouwde ingrediÃƒÂ«nten: vier liefdeskoppels, lange klusnachten, slopende weekenden, harde deadlines en verrassende opdrachten. De vier koppels die dit jaar de strijd aan gaan zijn de fanatieke Astrid (38) &amp; Stefan (38), de sportieve Suzanne (23) &amp; Krijn (35), de benjamins Kim (24) &amp; John (26) en de levensgenieters Thom (30) &amp; Wim (40). Deze vier uitgesproken stellen hebben elf weken de tijd om vier appartementen met een beperkt budget volledig te renoveren en in te richten.\n\nVeel kijk plezier\n\nVolg ons op twitter progemist\n\nEn seed seed mensen :-)","torrent":{"xt":"urn:btih:8c55d248e2c1f3765aa511045a4addac9e74e787","amp;dn":"Het+Blok+S07E02+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c55d248e2c1f3765aa511045a4addac9e74e787","infoHashBuffer":{"type":"Buffer","data":[140,85,210,72,226,193,243,118,90,165,17,4,90,74,221,172,158,116,231,135]},"announce":[],"urlList":[]}}