{"title":"The Door In The Floor [2004] Tod Williams","uid":7013817,"size":732010762,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8d0e68f9ccdf4cefab42752f659a67146b98cd1d&amp;dn=The+Door+In+The+Floor+%5B2004%5D+Tod+Williams&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1328574859,"description":" &lt;a href=&quot;http://bayimg.com/LamEIAaDh&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/LamEIAaDh&lt;/a&gt;\n\nThe Door in the Floor (2004)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0348593/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0348593/&lt;/a&gt;\n\nMKV format plays best in DIVX Player\n\nThe Door in the Floor is a 2004 American drama film written and directed by Tod Williams. The screenplay is based on the first third of the 1998 novel A Widow for One Year by John Irving.\n\nThe film is set in an exclusive beach community on Long Island, where children's book author and artist Ted Cole (Jeff Bridges) lives with his wife Marion (Kim Basinger) and their young daughter Ruth (Elle Fanning), who usually is supervised by her nanny Alice. Their home is filled with photographs of the couple's teenaged sons, who were killed in an automobile accident; the tragedy left Marion deeply depressed and her marriage in shambles. The one shared experience that holds the family together is a ritualistic daily viewing of a home gallery of family photographs of the deceased sons.\n\nThe movie is about a marriage between two smart people who are too afraid, or perhaps too cruel, to fight out in the open. They play a deep game of psychological chicken, all the more hurtful because they know so well what buttons to push. We learn eventually that their two sons were killed in a car crash, that Marion in some ways blames Ted, that in middle life they've had a daughter, Ruth (Elle Fanning), to try to heal the loss and that the loss was not healed. Now Ted proposes to hire a young student as his assistant for the summer. This is Eddie (Jon Foster). Because we have already visited the upstairs corridor lined with photographs of their two dead boys, we notice immediately that Eddie looks a lot like the older boy. Marion notices, too, as she is intended to.\n\nThe movie is based on the first third of John Irving's 1998 novel A Widow for One Year, which is mostly about Ruth growing up and developing problems of her own. This story focuses on the relationship of her parents. Ted Cole is a womanizer, a failed serious novelist who has found success with children's books, which he illustrates himself; his illustrations require female models, who he recruits from the neighborhood, and who only gradually discover that they are to be nude, and to have sex with Ted. Marion, meanwhile, is stuck in a sad blankness, unable to stir herself back into life.\n\nThe boy Eddie is smart, serious, ambitious, headed for a good school and very impressed to be working for a famous writer. Ted has little for him to do, except to drive him to and from liaisons with Mrs. Vaughn (Mimi Rogers), one of his current mistresses. Ted can't drive himself because his license has been suspended.\n\nDuring the course of the summer, Ted says he has been &quot;thinking,&quot; which in a marriage usually means trouble, and he suggests a &quot;trial separation,&quot; which usually means the trial will be successful. He times this suggestion for soon after Eddie comes to work for him, and Eddie finds himself dividing his time between the beach house and the house in town. That this is part of Ted's plan to passively urge his wife into adultery is obvious to Marion if not to Eddie, who becomes sexually obsessed with the older woman. She catches him one day masturbating with the inspiration of her bra and panties.\n\nYoung men have daydreams about older women like this, just as older women have nightmares about the young men. But the director, Tod Williams, pays unseemly attention to their sex itself. The film should be about their transgression, not their technique. The relationship between Marion and Eddie is the least satisfactory in the movie, because the movie isn't really about it -- it's about how Ted and Marion use it.\n\n","torrent":{"xt":"urn:btih:8d0e68f9ccdf4cefab42752f659a67146b98cd1d","amp;dn":"The+Door+In+The+Floor+%5B2004%5D+Tod+Williams","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d0e68f9ccdf4cefab42752f659a67146b98cd1d","infoHashBuffer":{"type":"Buffer","data":[141,14,104,249,204,223,76,239,171,66,117,47,101,154,103,20,107,152,205,29]},"announce":[],"urlList":[]}}