{"title":"The Big Bang Theory Season 4 Episode 23 - The Engagement Reactio","uid":6608867,"size":98659947,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8e43e5e0415bebf0ca38358a3ade30053dc80a6c&amp;dn=The+Big+Bang+Theory+Season+4+Episode+23+-+The+Engagement+Reactio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"geofreygachie","files":1,"time":1313509427,"description":"One day at the Cheesecake Factory, Priya asks Bernadette and Howard about their marriage plans and they reveal that their parents do not know about their engagement yet. Howard then decides to tell his mother. He first sends her away for a lunch with Bernadette and they end up getting along well. When Howards finally tells her of the engagement, she collapses while in the bathroom, apparently of a heart attack, and Howard takes her to the hospital after injuring himself while trying to knock down the bathroom door. The mysophobic Sheldon is initially hesitant to visit the hospital, but Penny pressures him to go.\n\nIn the hospital, Priya &amp; Penny start to talk and bond while discussing Leonard and his bedroom activities. Sheldon tries to avoid hospital germs by trying not to touch anything, but ends up in a bio-hazard room, much to his horror. Sheldon is eventually forced to stay in the hospital under a 2-week quarantine after the exposure, with his friends keeping him company.\n\nWhen Howard reveals the reason for the &quot;heart attack&quot; to Bernadette, she is very upset. When Mrs. Wolowitz wakes up, it is discovered that she actually had food poisoning from the restaurant that she and Bernadette ate at, and was worried about Bernadette, whom she actually likes a lot.\n\nNote: In the &quot;The Adhesive Duck Deficiency&quot; episode, Sheldon took Penny to the hospital without displaying the reluctance and discomfort he had in this episode.\nTitle reference: Mrs. Wolowitz's reaction to the news of Howard and Bernadette's engagement. ","torrent":{"xt":"urn:btih:8e43e5e0415bebf0ca38358a3ade30053dc80a6c","amp;dn":"The+Big+Bang+Theory+Season+4+Episode+23+-+The+Engagement+Reactio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e43e5e0415bebf0ca38358a3ade30053dc80a6c","infoHashBuffer":{"type":"Buffer","data":[142,67,229,224,65,91,235,240,202,56,53,138,58,222,48,5,61,200,10,108]},"announce":[],"urlList":[]}}