{"title":"ftvgirls.com.2011-11.Emilee.XXX.[GoldenPirates]","uid":6862886,"size":4583518598,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:8e53041e10cb2559b200df4f1ba291f3b4df3857&amp;dn=ftvgirls.com.2011-11.Emilee.XXX.%5BGoldenPirates%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"GoldenPirates","files":-1,"time":1322971480,"description":"Another torrent from goldenpirates.org\n\nno viruses, no shit, no Bullshit, just pure PORN!\n\nSite:     &lt;a href=&quot;\nhttp://www.ftvgirls.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ftvgirls.com&lt;/a&gt;\n\nTeam:               &lt;a href=&quot;\nhttp://goldenpirates.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://goldenpirates.org&lt;/a&gt;\n\nUploader/Ripper: goldenPirates\n\n\nMore Golden releases here:               &lt;a href=&quot;\nhttp://thepiratebay.se/user/Goldenpirates&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Goldenpirates&lt;/a&gt;\nand here:               &lt;a href=&quot;\nhttp://blog.goldenpirates.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://blog.goldenpirates.org/&lt;/a&gt;\n\nEnjoy! \n\nThis torrent contains two videos, (split into several files), and three photosets.  \n\nPreviews and screenshots:\n &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?smpc07oowyosxeh2hkg1e5zpxdx1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?smpc07oowyosxeh2hkg1e5zpxdx1&lt;/a&gt;  cover &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?6uscfiz5tu8k20or7xqllth39w&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?6uscfiz5tu8k20or7xqllth39w&lt;/a&gt;    face &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?uocc8knus8crlrydip64c33230dl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?uocc8knus8crlrydip64c33230dl&lt;/a&gt;  breasts &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?c75w376tvjun386vbsopenvaod8&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?c75w376tvjun386vbsopenvaod8&lt;/a&gt;   vagina &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?cmq8a4rrdo1tzgrbvdzax23v8m7o&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?cmq8a4rrdo1tzgrbvdzax23v8m7o&lt;/a&gt;  ass &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?px6io5v4nu9fofppnfvk6f6zfm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?px6io5v4nu9fofppnfvk6f6zfm&lt;/a&gt;    double insertion &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?0gnb8pw9m6oyen8egr2jfsxn60v&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?0gnb8pw9m6oyen8egr2jfsxn60v&lt;/a&gt;   vid 1 screens &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?3zdbzuza1n600ax8pke3165jkwg8&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?3zdbzuza1n600ax8pke3165jkwg8&lt;/a&gt;  vid 1 storyboard &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?ujsxd0j85as9jgl3h70037avwf9g&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?ujsxd0j85as9jgl3h70037avwf9g&lt;/a&gt;  vid 2 screens &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?8j3rp2geqy0i7yqlktdp3f2hvi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?8j3rp2geqy0i7yqlktdp3f2hvi&lt;/a&gt;    vid 2 storyboard\n\nThe video screenshots and storyboards are for only one file of each video.  Screenshots and storyboards for all video files are in the torrent.\n\nVideo descriptions from website:\n\nModel Comments: Hi, I'm Emiliee. I'm a horrible writer, and that's why I'll be an engineer one day. I tell a few different stories during the video, but you're probably still wondering who I am. I'm 22 years old, Irish, and I'm originally from the South. I was homeschooled in high school, and now I'm currently studying chemical engineering. I really would like to become a doctor one day. I have two cats, one a foster cat and one from a shelter. I have the biggest heart for animals. Sexually, I consider myself to be a bisexual polyamorous switch. I enjoy both men and women.. preferably at the same time! I moved to California when I turned 18 because the south was way too conservative for me. California is a much better fit for me.. (-; Being in a much more sexually open environment has opened my eyes to so many things, and I've truly become more comfortable and accepting of who I am. This video is a result of that.  I'm naturally a very, very kinky girl, and today you'll see me trying to fist myself for the first time, and it was caught on video! The thought of people watching me is a huge turn on. I was super nervous the first scene, but after I got over that everything I was doing to myself got so intense. I squirted way more than I ever have, and my orgasms were way more intense. While I'm bummed I broke the amazing blue glass dildo, playing with that toy was my favorite part!  Doing this video was amazing and something I've wanted to do for a while.\n\nVideographer/Photographer's Comments:  Emilee applied with this email: 'Hi! I really love how natural the girls look and how tasteful the FTV site is. I got your email address off of the contact page of your site, and I would love to be on the site. I'm 22, 5'6 120 with natural 32Ds, blond hair, and blue eyes. I'm open to anything solo or g/g. I'm naturally bisexual, so g/g would be prefered. I'm sending a link to a few pictures taken three weeks ago, and I'd love to hear back!&quot;  She sent me several professionally done non-nude photos, but I also asked her for some simple candids.  First she sends this picture #1 which looks very conservative, then all of a sudden she sends this picture #2, the total opposite!  She was well prepared, bringing with her lots of clothes, dresses &amp; heels.  She particularly liked the white dress and pink heels.  She is the kind of Irish girl that you think prudish, or conservative, but she ends up being one of the most oversexed, horny women I've ever shot.  Her excitement and enthusiasm was over the top, and once she started masturbating, she wouldn't stop.  Clip 2 you see her use her own vibrator, and her vagina responds to the near-orgasms several times, until a large climax with her squirting.   Then, rather randomly, she starts pushing in fingers, trying four fingers deep inside her without me asking her to do so.  I do ask her to stuff that funky toy inside her, back end first, and walk around with it... as members request quite often.  Then at her request, she does a double penetration video, stuffing and getting off with the toys, and some rough anal penetration at the end.  She also was inspired by Anne's jogging shoot, so she had taken the initiative and brought with her workout clothes.  So we went to the same location of Anne's jogging shoot 3 years ago and had her run around with her breasts out.  Caught a lot of peoples' attention...  Also take note of her stories she talks about through some of these videos, they are quite interesting and rather extreme.\n\n\nModel Comments: (written on previous page)\n\nVideographer/Photographer's Comments:  Its true, she wears this dress &amp; heels to church.  With panties on of course.  We happened to be near a church, and she starts fingering herself again, losing herself to her oversexed nature.  Out comes a glass toy from her purse, and she starts pounding herself real hard with it.  Her vagina takes a real beating there, but she seems to love it so much.  It also ends up surprising us both, as this toy brings her to countless squirting orgasms.  Its a toy from the FTV closet, and after this erotic experience, we take some photos, but while its inside her, it falls out and smashes on the tile.  So this outtake shows what happened after Clip1.  Then, to avoid any risk (since she was screaming her head off during the masturbation/squirt) we moved to another location where she tries to full fist herself.  She ends up forcing her g-spot and making herself squirt (if not pour) all over the place.  Where is all this liquid coming from? Its a huge amount of clear liquid, and this on a hot dry day.   Then we do some extreme closeups, she has those long labia to stretch and pull, same goes for her nipples.  Running out of time and daylight, she tries fisting one last time, doing it the 'rear' way, and pounds herself pretty hard.  Her vagina finally gives out on her, and she started bleeding a bit (and that is why on clip4 it cuts off suddenly).  She reminds me of another oversexed girl who came from a very conservative background, Vicki -- who literally exploded on camera.","torrent":{"xt":"urn:btih:8e53041e10cb2559b200df4f1ba291f3b4df3857","amp;dn":"ftvgirls.com.2011-11.Emilee.XXX.%5BGoldenPirates%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e53041e10cb2559b200df4f1ba291f3b4df3857","infoHashBuffer":{"type":"Buffer","data":[142,83,4,30,16,203,37,89,178,0,223,79,27,162,145,243,180,223,56,87]},"announce":[],"urlList":[]}}