{"title":"Freezing","uid":7023091,"size":3619390764,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8efd8420d70a6482e8f22dfb0a77480cfaf8d66e&amp;dn=Freezing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drako_darpan","files":1361,"time":1328912598,"description":"Ambientado en un mundo ligeramente futurista donde la Tierra ha sido invadida y estÃƒÂ¡ en guerra con los extraterrestres de otra dimensiÃƒÂ³n llamada Nova, la historia sigue las aventuras de un muchacho japonÃƒÂ©s llamado Kazuya Aoi que se inscribe en una escuela especial para chicas genÃƒÂ©ticamente modificadas llamadas Pandoras para luchar contra los extraterrestres, y donde las parejas masculinas(limitadores), utilizan un poder especial llamado &quot;freezing&quot; (congelaciÃƒÂ³n) para limitar la movilidad de su oponente o contrarrestar el freezing de el oponente para que las Pandoras puedan atacar. El protagonista hace que el conocimiento de una chica mayor e inusual llamada Satellizer L. Bridgette, que parece ser la de Pandora mÃƒÂ¡s fuerte de su clase, pero aÃƒÂºn no ha elegido una pareja de sexo masculino para ser su limitador debido a su fuerte aphephobia, o temor a ser tocada, una condiciÃƒÂ³n que habÃƒÂ­a surgido de una infancia traumÃƒÂ¡tica, en el que su medio hermano estÃƒÂ¡ involucrado. A pesar de las advertencias de todos sus amigos, Aoi decide ser su limitador.","torrent":{"xt":"urn:btih:8efd8420d70a6482e8f22dfb0a77480cfaf8d66e","amp;dn":"Freezing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8efd8420d70a6482e8f22dfb0a77480cfaf8d66e","infoHashBuffer":{"type":"Buffer","data":[142,253,132,32,215,10,100,130,232,242,45,251,10,119,72,12,250,248,214,110]},"announce":[],"urlList":[]}}