{"title":"A Child's Garden Of Grass","uid":6656062,"size":35716788,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8f4c04aaf7376209b3cab78073bfb77c52d4f4b4&amp;dn=A+Child%5C%27s+Garden+Of+Grass&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dhjohns","files":1,"time":1315322129,"description":"A Child\\'s Garden of Grass: A Pre-Legalization Comedy (1971)\n\nIn 1969, Jack S. Margolis wrote a book called A Child\\'s Garden of Grass. Two years later, an album based on that book surfaced on Elektra Records. If you\\'re looking for a silly comedy album in which the entire theme is on marijuana, and its affects, then you should go get a copy. I am not certain the album is available on CD, as far as I know, it\\'s only available on LP.\n\nEach subject of the album starts off with some strange electronic effects before the narrator gets on with the subject. Example is \\&quot;Listening to Music\\&quot;. This cut tells you what kind of music you can listen to while being stoned (classical, folk, acid rock, jazz, electronic music). He warns you never listen to Myron Florin (accordion player for the Lawrence Welk Show), as well as several other polka players while stoned, unless they were being played all together at once.\n\nAnother example is \\&quot;Creativity\\&quot; where the narrator seems to suggest when you\\'re stoned, you begin to overestimate your \\&quot;artistic\\&quot; talents. By the end of that cut, you start hearing some really bad rock and roll, played and sung by the person being stoned. Of course an album dealing with this subject should never be without \\&quot;Physical Effects\\&quot; and \\&quot;Psychological Effects\\&quot;, as well as how to acquire marijuana (which seems to suggest any manner possible, even stealing). \\&quot;Psychological Effects\\&quot; really cracks me up, because you hear a conversation between a man and a woman, and the person totally forgot what he was saying, and didn\\'t care. There was also a lot of giggling as they listen to some really crappy music.\n\nYou can be very certain that this album would not be in the hands of the \\&quot;Just Say No\\&quot; crowd, or conservatives in general. This is one silly album and a great period piece. If you\\'re looking for comedy about the affects of weed, this is the album to get.","torrent":{"xt":"urn:btih:8f4c04aaf7376209b3cab78073bfb77c52d4f4b4","amp;dn":"A+Child%5C%27s+Garden+Of+Grass","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f4c04aaf7376209b3cab78073bfb77c52d4f4b4","infoHashBuffer":{"type":"Buffer","data":[143,76,4,170,247,55,98,9,179,202,183,128,115,191,183,124,82,212,244,180]},"announce":[],"urlList":[]}}