{"title":"Out Cold(2001)DVDRip.AC3(ENG)-DROCK","uid":6594192,"size":726919168,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8f96d656e9e788cf59f2546f603a430e535b087a&amp;dn=Out+Cold%282001%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1312963761,"description":"Four wacky guys take on a pack of rich stuffed shirts (does this premise sound at all familiar?) in this broad comedy. Rick (Jason London) is a slobby but good-natured snowboarder who is mending a broken heart after splitting up with Anna (Caroline Dhavernas), a girl he met while on vacation in Mexico. Rick has headed back to Bull Mountain, AK, where he and his buddies Luke (Zach Galifianakis), Anthony (Flex Alexander), and Pig Pen (Derek Hamilton) spend their days riding the slopes and their nights partying hard. Rick and his pals hope to someday open a hangout for fellow boarders, but after Papa Muntz, the city's founder and largest landowner, passes on, his son Ted (Willie Garson) sells most of his property to John Majors (Lee Majors), a wealthy but pompous developer who wants to convert Bull Mountain into Snownook, an upscale ski resort catering to yuppies. Determined to keep Bull Mountain safe for like-minded burnouts and radical skiers, Rick and the gang declare war against Majors and his associates, though Rick feels a bit conflicted by the fact that John is Anna's father -- and his daughter is tagging along with her father as he relocates to Alaska. Anna, however, has a rival for Rick's attention, as Jenny (A.J. Cook), a cute ski bum, has shown her interest in him. Out Cold was the first feature film from sibling directorial team Brendan Malloy and Emmett Malloy, who previously worked in television commercials and created several snowboarding videos. \n\nRipped with Autogk.\n\nLength: 1 Hour 30 Minutes\n\nFile Type: AVI\n\nFrame Width: 608\n\nFrame Height: 336\n\nFrame Rate: 59fps\n\nAudio\n\nBit Rate: 114kbps","torrent":{"xt":"urn:btih:8f96d656e9e788cf59f2546f603a430e535b087a","amp;dn":"Out+Cold%282001%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f96d656e9e788cf59f2546f603a430e535b087a","infoHashBuffer":{"type":"Buffer","data":[143,150,214,86,233,231,136,207,89,242,84,111,96,58,67,14,83,91,8,122]},"announce":[],"urlList":[]}}