{"title":"Powder(1995)DVDRip.AC3(ENG)-DROCK","uid":6652360,"size":733315441,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:900db7ceb5c1f8500b11e3c30544984115dc7016&amp;dn=Powder%281995%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1315208527,"description":"This unusual modern-day fable concerns a super-powered teenager who inspires nothing but hostility in the small-minded folk of his hometown. Sean Patrick Flanery stars as Jeremy Reed, nicknamed &quot;Powder&quot; because he is an albino. Powder has been living his entire 16 years in his grandparents' basement, but they have both passed away. The boy is removed from his home and placed in a school. There, science teacher Ripley (Jeff Goldblum) and psychologist Jessie Caldwell (Mary Steenburgen) discover that in addition to being an albino, their new student is the smartest person who ever lived with an IQ off the charts -- and that he is electrically super-charged, which renders him hairless. Powder also has miraculous powers of perception, ESP, and healing, which he uses to ease the death of the terminally ill wife of local Sheriff Barnum (Lance Henriksen) and to give a bigoted redneck hunter (Brandon Smith) a firsthand demonstration of the pain suffered by a deer he's just shot. Powder's gentle nature attracts a pretty coed, Lindsey (Missy Crider), but in spite of his Christ-like demeanor, Powder's abnormalities inspire hatred on the part of many bigoted citizens, especially school bully John Box (Bradford Tatum). \n\nRipped with Handbrake.\n\nLength: 1 Hour 52 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 24fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:900db7ceb5c1f8500b11e3c30544984115dc7016","amp;dn":"Powder%281995%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"900db7ceb5c1f8500b11e3c30544984115dc7016","infoHashBuffer":{"type":"Buffer","data":[144,13,183,206,181,193,248,80,11,17,227,195,5,68,152,65,21,220,112,22]},"announce":[],"urlList":[]}}