{"title":"La storia in giallo 142 - Ottavio Bottecchia [Mp3 Ita] [TNTvilla","uid":6621391,"size":64349123,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:90b2f5af0796c174e0e5214dc8358baf236e6e19&amp;dn=La+storia+in+giallo+142+-+Ottavio+Bottecchia+%5BMp3+Ita%5D+%5BTNTvilla&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"darayava","files":1,"time":1314010143,"description":"La storia in giallo 142 - Ottavio Bottecchia [Mp3 Ita] [TNTvillage]\n\nLA STORIA IN GIALLO\n\nLa Storia in giallo  ÃƒÂ¨ un programma in onda su radio3 scritto e condotto da Antonella Ferrera, con la regia di Francesco Pannofino, regia del dibattito di Manuel de Lucia, musiche originali di Alessandro Molinari, assistenza tecnica di Fiore Liborio, cura di Diana Vinci.\nRedazione: Carlo Dellonte e Roberto Ritondale Paola Veneto\nDa poco ha subito il mutamento nel nome diventando: Cuore di Tenebra\n\nLa storia e le storie di personaggi celebri, le vicende tragiche o misteriose che hanno segnato I loro destini e a volte quelli di molti altri. Uomini della politica o del malaffare, uomini di fede o vissuti nel peccato, personalitÃƒÂ  borderline, mitomani o geni maledetti. Le devianze e I turbamenti di grandi artisti di tutti I tempi che hanno riversato nella loro opera la fatica o la follia del vivere.\nLa Storia in Giallo li racconta come in un film, attraverso le voci dei migliori doppiatori italiani. Dopo lo sceneggiato che catapulta l'ascoltatore al centro di una storia, segue l'intervista ad un personaggio della cultura che ne spiega e racconta dinamiche, curiositÃƒÂ  e risvolti inediti.\n\nLa storia in giallo - in onda il 10/12/2005\n\nOTTAVIO BOTTECCHIA\n\n\nUn campione apparentemente venuto dal nulla, Ottavio Bottecchia, che prima di tagliare i traguardi piÃƒÂ¹ prestigiosi del mondo, ha sofferto la fame e ha vissuto in prima linea la Grande Guerra, conquistandosi anche una meritata medaglia al valore. Scoperto da un talent scout di nome Ganna, ÃƒÂ¨ stato lanciato nella mischia, e sin da subito ha dato del filo da torcere ai piÃƒÂ¹ grandi ciclisti del suo tempo, fra tutti il leggendario Girardengo. Vincitore tra gli isolati, quelli che non avevano una squadra, al Giro d'Italia del 1923, ha trionfato, primo italiano a farlo, al Tour de France del 1924 e del 1925. Diventato straricco, la sua parabola discendente ÃƒÂ¨ stata perÃƒÂ² tanto vertiginosa quanto l'ascesa, culminata il 3 Giugno del 1927 con una morte misteriosa su cui aleggia ancora piÃƒÂ¹ di un'ombra.\nAntonella Ferrera cerca di fare luce su questo giallo in piena regola, e lo fa insieme al giornalista del Tg1 Marco Franzelli.\nLa voce di Ottavio Bottecchia ÃƒÂ¨ quella di Riccardo Rossi.\n\nFile Details\n========================================\nName..........: 2005 - Ottavio Bottecchia.mp3\nFilesize......: 61Mb\n\nAudio Bitrate.: 192Kbps\nAudio Freq....: 44KHz\nAudio Channels: Mono\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:90b2f5af0796c174e0e5214dc8358baf236e6e19","amp;dn":"La+storia+in+giallo+142+-+Ottavio+Bottecchia+%5BMp3+Ita%5D+%5BTNTvilla","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90b2f5af0796c174e0e5214dc8358baf236e6e19","infoHashBuffer":{"type":"Buffer","data":[144,178,245,175,7,150,193,116,224,229,33,77,200,53,139,175,35,110,110,25]},"announce":[],"urlList":[]}}