{"title":"Fischer, Schily - Mein 11. September! (720p h264 AC3).ts","uid":6655480,"size":2068550088,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:9105f7d87111464d5c6591cd33472d6eeb0e46ff&amp;dn=Fischer%2C+Schily+-+Mein+11.+September%21+%28720p+h264+AC3%29.ts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1315310382,"description":"Die ARD-Dokumentation von Stephan Lamby und Michael Wech beschreibt erstmalig diese Phase - der 11. September und die Entscheidungen zu den Kriegen in Afghanistan und Irak - aus der sehr persÃƒÂ¶nlichen Sicht deutscher Regierungsmitglieder.\nBerlin, 11. September 2001, 15.00 Uhr. AuÃƒÅ¸enminister Fischer kommt gerade von einem Mittagessen mit dem jemenitischen Amtskollegen ins BÃƒÂ¼ro. Seine Mitarbeiter haben sich im Vorzimmer vor dem Fernseher versammelt und starren entsetzt auf den Bildschirm. Ein Flugzeug sei in das Word Trade Center gestÃƒÂ¼rzt. Das Telefon klingelt. Der griechische AuÃƒÅ¸enminister will Fischer sprechen. BeilÃƒÂ¤ufig fragt Fischer, ob Papandreou wisse, was in New York los sei. Nein. ZurÃƒÂ¼ck im Vorzimmer sieht Fischer, wie ein zweites Flugzeug in den SÃƒÂ¼dturm kracht. &quot;Da war mir klar, das ist ein Terroranschlag, das ist kein Unfall - und ich sagte: Gebt mir den Bundeskanzler!&quot;\nZur gleichen Zeit erfÃƒÂ¤hrt Innenminister Schily zu Hause von dem Anschlag. &quot;Ich bin sofort ins Auto gestÃƒÂ¼rzt, ins Kanzleramt gefahren.&quot; Gleichzeitig versucht er verzweifelt, seine Tochter zu erreichen: Sie arbeitet unweit des World Trade Centers. Keine Verbindung.\nZusammen mit Uwe-Karsten Heye und Peter Struck finden Fischer und Schily Bundeskanzler SchrÃƒÂ¶der vor, wie er noch immer &quot;fassungslos&quot; vor dem Fernseher sitzt: Aus den brennenden TÃƒÂ¼rmen springen Menschen in den sicheren Tod. Die deutschen Politiker empfinden gleichermaÃƒÅ¸en Entsetzen wie blitzschnell steigenden Druck zu handeln. Aber wie und was? So verwirrend beginnt diese dramatische Zeit deutscher AuÃƒÅ¸enpolitik. Mit bislang unbekannten Details schildern die Autoren, was am Tag des Angriffs und den Monaten danach hinter den Kulissen der Berliner Regierung passierte.\nSchon kurz nach den AnschlÃƒÂ¤gen gruppiert sich ein Krisen-Kabinett um Kanzler SchrÃƒÂ¶der - es sind seine engsten Mitarbeiter. Sie haben Wochen und Monate hÃƒÂ¶chster Anspannung und schlafloser NÃƒÂ¤chte vor sich. Otto Schily und Kanzleramtsminister Frank-Walter Steinmeier fÃƒÂ¼rchten AnschlÃƒÂ¤ge im eigenen Land. Und mÃƒÂ¼ssen sich VorwÃƒÂ¼rfe der Amerikaner gefallen lassen, die Terroristen hÃƒÂ¤tten schlieÃƒÅ¸lich in Hamburg gewohnt. Steinmeier: &quot;Wir bekamen Fragen, unangenehme Fragen&quot;. Joschka Fischer fliegt rastlos zwischen Berlin und den USA hin und her, auch um die Rache-PlÃƒÂ¤ne der Bush-Regierung in Erfahrung zu bringen. Aber es sind nur ungenaue, wenn auch bedrohliche Hinweise, die er mit nach Hause nimmt. Er signalisiert den Amerikanern, dass sich Deutschland an einem Afghanistan-Krieg beteiligen wird. Doch dann dÃƒÂ¤mmert ihm, dass die Regierung von US-PrÃƒÂ¤sident Bush mehr will. &quot;Faktisch wÃƒÂ¼rde es einen Weltkrieg gegen den Terror geben&quot;.\nFischer muss sich permanent mit Kanzler SchrÃƒÂ¶der abstimmen. Doch die Kommunikation ist schwierig: Mal wird das AuswÃƒÂ¤rtige Amt nach einem Bombenalarm gerÃƒÂ¤umt; mal klingelt Kanzler SchrÃƒÂ¶der seinen AuÃƒÅ¸enminister in den USA aus dem Schlaf. Je nÃƒÂ¤her der Angriff auf den Irak rÃƒÂ¼ckt, desto frostiger wird das VerhÃƒÂ¤ltnis zwischen den Regierungen in Berlin und Washington. Fischer ÃƒÂ¼ber Vize-PrÃƒÂ¤sident Richard Cheney: &quot;Uns beiden war klar, wir werden nicht Freunde in diesem Leben.&quot; Bei einem FrÃƒÂ¼hstÃƒÂ¼ck auf der Terrasse des Kanzleramts beschlieÃƒÅ¸en SchrÃƒÂ¶der und Fischer schlieÃƒÅ¸lich: Deutschland wird sich weigern, den Amerikanern beim Angriff auf den Irak zu folgen. Eine Konfrontation mit dem wichtigsten VerbÃƒÂ¼ndeten. Joschka Fischer und sein UNO-Botschafter Gunter Pleuger sehen machtlos mit an, wie die Amerikaner Stimmung gegen den Irak machen. Und sie wissen: Die US-Regierung biegt sich die Wahrheit zurecht, ihre Wahrheit! Einige der Unterlagen, die US-AuÃƒÅ¸enminister Colin Powell im UN-Sicherheitsrat der WeltÃƒÂ¶ffentlichkeit prÃƒÂ¤sentiert, sind falsch - und stammen ausgerechnet vom deutschen Geheimdienst. Gunter Pleuger: &quot;Eine gespenstische Sitzung&quot;. Hinter den Kulissen lÃƒÂ¤uft ein abenteuerliches Spiel um Vertrauen und Verrat, um Krieg und Frieden.\nStephan Lamby und Michael Wech rekonstruieren die dramatischen Monate deutscher Innen- und AuÃƒÅ¸enpolitik. Sie haben dabei nicht nur mit Mitgliedern der damaligen Bundesregierung gesprochen, sondern auch mit Spitzenpolitikern der damaligen US-Regierung.","torrent":{"xt":"urn:btih:9105f7d87111464d5c6591cd33472d6eeb0e46ff","amp;dn":"Fischer%2C+Schily+-+Mein+11.+September%21+%28720p+h264+AC3%29.ts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9105f7d87111464d5c6591cd33472d6eeb0e46ff","infoHashBuffer":{"type":"Buffer","data":[145,5,247,216,113,17,70,77,92,101,145,205,51,71,45,110,235,14,70,255]},"announce":[],"urlList":[]}}