{"title":"Big Anal Booties (2011)","uid":6638673,"size":2926753792,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9132e8c6b7168c10af401d57e5403bfe04eba265&amp;dn=Big+Anal+Booties+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":4,"time":1314662221,"description":"Big Anal Booties (2011)\n &lt;a href=&quot;\nhttp://www.excaliburfilms.com/AdultDVD/3001978D1_Big_Anal_Booties_dvd.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.excaliburfilms.com/AdultDVD/3001978D1_Big_Anal_Booties_dvd.htm&lt;/a&gt;\n\nStudio  Evil Angel \nRelease Date  Aug 24, 2011 \nCategory  All Sex, Anal, Big Butts, P.O.V. - Point of View \nDirector  Mike Adriano \nStarring  Raylene, Aurora Jolie, Sarah Shevon, Briella Bounce, Holly Michaels, Missy Martinez, Alison Tyler, Franceska Jaimes, Mike Adriano \n\n\nAss-To-Mouth Fest! All Anal! POV+!\n\nBriella Bounce Takin' Every Inch Up That Fat Ass!\n\nAnal Love! Tasty Treat! Gape Her Fat Ass! Impaled Assholes!\n\nEvery Inch Must Go In! Double Salad Tossing! ATM, Baby!\n\nAnimal ...    Full Descriptionlust is the not-so-secret ingredient in director Mike Adriano's intimate, POV+ porn. His latest double-disc production, 'Big Anal Booties,' hits all the key notes of the Adriano technique - incredibly sexy women with plump, round asses; close-up rectal penetration; sloppy blow jobs; gaping buttholes; toys and anal speculums; and sick ass-to-mouth perversions. In shocking contrast to these nasty activities, there's the physical beauty of Mike's stunning sluts, matched only by their cheerful willingness to please. Jiggly sweetheart Holly Michaels and juggy Latina Missy Martinez team up on Mike's big cock. From ATM tricks to spit-slathered anal lubricant, Missy does her utmost to improve Holly's ass fucking experience.\n\nFantastically voluptuous Latina Franceska Jaimes gags on Mike's huge pole and has her ass opened wide for a medical-style inspection. Sexy smut veteran Raylene uses her seasoned mouth and big ol' booty to service the director's meat stick. Throat-fucked, slobbering all over her cleavage, Raylene gets butt-banged until her sphincter dilates. Gorgeous brunettes Alison Tyler and Sarah Shevon gets completely nasty in an ass-plundering three-way, with Sarah supplying copious oral lubrication for Alison's anal violation. And cute, cushiony Texas girl Briella Bounce shows off her outrageously phat, soft ass, plants it upon Mike's face, then pleasures his hard dick using her wet mouth and inviting anus.\n\nWe even get a special DVD bonus scene starring rectal diva Aurora Jolie, the light-skinned, spectacularly curvy African American babe. Mike Adriano immerses himself and viewers in 'Big Anal Booties.' ","torrent":{"xt":"urn:btih:9132e8c6b7168c10af401d57e5403bfe04eba265","amp;dn":"Big+Anal+Booties+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9132e8c6b7168c10af401d57e5403bfe04eba265","infoHashBuffer":{"type":"Buffer","data":[145,50,232,198,183,22,140,16,175,64,29,87,229,64,59,254,4,235,162,101]},"announce":[],"urlList":[]}}