{"title":"Reign Over Me(2007)DVDRip.AC3(ENG)-DROCK","uid":6652541,"size":733841872,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:918e23f5a8886494b216febdf7210ca398ef553c&amp;dn=Reign+Over+Me%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1315214903,"description":"A chance run-in with an old college roommate becomes the catalyst for healing in writer/director Mike Binder's tale of friendship and understanding in post-9/11 New York. When the Twin Towers went down on that fateful morning in 2001, Charlie Fineman (Adam Sandler) lost everything that he had to live for. Five years have passed since Charlie lost his family, and now the once-successful and sociable man has become a withdrawn shadow of his former self. When fate brings Charlie and his former college roommate Alan Johnson (Don Cheadle) together once again on a Manhattan street corner, Alan is shocked to see just how far his old friend has fallen. Though on the surface it would appear that Alan has it all, the pressures of his family and career have been weighing heavily on the successful dentist and loving father's shoulders as of late. At that pivotal moment when Charlie and Alan both need a trusted friend to help them work through the seemingly insurmountable challenges they face in life, the restorative power of a rekindled friendship provides just the lifeline needed to move forward into the future with hope and optimism. Jada Pinkett Smith, Liv Tyler, Saffron Burrows, and Donald Sutherland co-star. \n\nRipped with Handbrake.\n\nLength: 2 Hours 4 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 159kbps\n","torrent":{"xt":"urn:btih:918e23f5a8886494b216febdf7210ca398ef553c","amp;dn":"Reign+Over+Me%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"918e23f5a8886494b216febdf7210ca398ef553c","infoHashBuffer":{"type":"Buffer","data":[145,142,35,245,168,136,100,148,178,22,254,189,247,33,12,163,152,239,85,60]},"announce":[],"urlList":[]}}