{"title":"Darkman 1990 [Hyperdrive25]","uid":6520495,"size":717997639,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:91d9818d772322d0bbe7700e2c6145c49fb280fa&amp;dn=Darkman+1990+%5BHyperdrive25%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hyperdrive25","files":-1,"time":1309973194,"description":"          Darkman 1990 + English Subs + Theatical Trailer[Hyperdrive25]\n          =============================================================    \nPeyton Westlake is a scientist who has discovered a way to produce synthetic skin. This could revolutionize skin grafting, except for one minor glitch; the synthetic skin degrades after 100 minutes of exposure to light. \n\nPeyton's girlfriend Julie (Frances McDormand) runs afoul of a corrupt developer called Louis Strack (Colin Friels) who secretly employs a ruthless and sadistic gangster called Robert G. Durant (Larry Drake) to do his dirty work. Julie has found a document which will seriously compromise Strack, if sent to the authorities. In a meeting with Strack, she tells him about the document. Without wasting any time, Strack hires Durant to recover the document believed to be still in Julie's possession. \n\nJulie is living with Peyton, so Durant heads over to Peyton's home. When Durant's and Peyton's paths cross, the result is irreversible. Peyton's life is changed in a\nmatter of minutes and the only hope for him is the very work he has dedicated his life to...\n\nWatch the film to see what happens next!\n\n\nReview by your friendly neighborhood Hyperdrive25\n-------------------------------------------------\nOf all of Sam Raimi's films, this is the one I cherish. Liam Neeson's acting is very realistic. He has a dual personality in this one, that of the scientist and that of the man he is becoming: Darkman. Darkman's character throughout the film is single-minded coupled with bouts of rage. There is an element of horror in this film, bit it is not continuous. Raimi opted for fast paced action thrills which opts over the horror element. The science fiction part of the film is the one that is the backbone of the film. Visual effects are superb and far ahead of the time at which the film was released. Danny Elfman's (Batman, Red Dragon, Army Of Darkness) score is superb as always and comlements the dark atmosphere of the film. The excellent photography is by Bill Pope (Pet Cemetery, Army Of Darkness, The Matrix). \n___________________________________________________________________________________\n\nPlaypack Guide For DVD/CD Player: This file can be played with any DIVX/MP4 compatible DVD/VCD Player. Just burn the files onto a CD using Nero or Ashampoo Buring Studio by making a DATA CD.\n\nPlayback guide for PC: To play this video make sure you have VLC media player \n(VideoLAN) or SMplayer installed on your PC.\n\n\nDownload VLC Media Player: http://www.videolan.org/\n\nDownload SMPlayer: http://smplayer.sf.net/\n\n\n\nAnother Quality Torrent Courtesy of Hyperdrive25. All My torrents are here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Hyperdrive25&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Hyperdrive25&lt;/a&gt;\n\n\nRemember To Keep Seeding. A little seeding goes a long way...\n\n***************************ITS TIME TO GO HYPER!!!*********************************\n\nI love to share,\nI love to care,\nI like to sing,\nSo that I can bring,\nA ray of sunshine in your life.\n\n\nRemember: its YOUR WORLD. I just live in it. :) \n\n          *** A BIG THANK YOU FOR ALL YOU SEEDERS OUT THERE! *** \n                            \n                        KEEP UP THE GOOD WORK!\n\n                            I LOVE U ALL!\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:91d9818d772322d0bbe7700e2c6145c49fb280fa","amp;dn":"Darkman+1990+%5BHyperdrive25%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91d9818d772322d0bbe7700e2c6145c49fb280fa","infoHashBuffer":{"type":"Buffer","data":[145,217,129,141,119,35,34,208,187,231,112,14,44,97,69,196,159,178,128,250]},"announce":[],"urlList":[]}}