{"title":"NoteAbility Pro v 2.466 with [K]","uid":6523137,"size":53472751,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:926c524cd27f23dfb6328c269e68eeeb3c8a5263&amp;dn=NoteAbility+Pro+v+2.466+with+%5BK%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"polisdavid","files":-1,"time":1310065500,"description":"NOTE: I was blown away when I found this app. It a a fantastic composition tool, and offers a Multitude of options.  If you are serious about getting you music to press you need this one.\n\nOfficial Web Site: &lt;a href=&quot; http://debussy.music.ubc.ca/NoteAbility/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://debussy.music.ubc.ca/NoteAbility/&lt;/a&gt;\n\nNoteAbilityPro is a professional music notation package for the Macintosh OS X operating system. Developed by Dr. Keith Hamel at the University of British Columbia, it is easily the most sophisticated music notation software available on any platform. NoteAbility combines both musical intelligence and graphical flexibility in a direct and intuitive graphical user interface.\n\nNotate anything from simple melodies to complex avant garde orchestral music, play the score on your MIDI synthesizer or using Quicktime Musical Instruments and print a publishable copy of your score on any OS X compatible printer.\n\nIf you have been frustrated by the awkwardness and inflexibility of other notation programs, or by the time it takes to learn them, then you definitely should have a look at NoteAbility Pro.\n\nThe demo version of NoteAbilityPro is a complete working copy of the program with some functions disabled. You are not allowed to save files, copy or export in certain formats, and printing is restricted to the first page only. Just follow the simple installation notes, and the OS X Installer application will ensure that all required files are installed into the correct locations.\n\nWHAT'S NEW\n\n* Version 2.466: Release notes were unavailable when this listing was\n  updated.\n\nSystem Requirements:\n\nIntel MAC OX X.4 and above (to OS X.6.8 runs well)\n.6.8 runs weel)\nI tried it on lion (OX.7), and it runs, but I was unable to create a new blank document??\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:926c524cd27f23dfb6328c269e68eeeb3c8a5263","amp;dn":"NoteAbility+Pro+v+2.466+with+%5BK%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"926c524cd27f23dfb6328c269e68eeeb3c8a5263","infoHashBuffer":{"type":"Buffer","data":[146,108,82,76,210,127,35,223,182,50,140,38,158,104,238,235,60,138,82,99]},"announce":[],"urlList":[]}}