{"title":"Wyatt Earp (TV) [2010] PBS","uid":7027798,"size":576418289,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:92fc144cae0dde14ee99fa5f7a595d9a6c66a85a&amp;dn=Wyatt+Earp+%28TV%29+%5B2010%5D+PBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1329126165,"description":" &lt;a href=&quot;http://bayimg.com/nAmBFaADj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/nAmBFaADj&lt;/a&gt;\n\nThe American Experience (TV) \n\nWyatt Earp\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1535859/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1535859/&lt;/a&gt;\n\nWyatt Earp has been portrayed in countless movies and television shows by some of Hollywood's greatest actors, including Henry Fonda, Jimmy Stewart, and more recently, Kevin Costner, but these popular fictions often belie the complexities and flaws of a man whose life is a lens on politics, justice and economic opportunity in the American frontier.\n\nAs a young man, Wyatt Earp was a caricature of the Western lawman. He gained notoriety as the legendary gunman in the shootout at the O.K. Corral in Tombstone, Arizona, but shortly after his death in 1929, distressed Americans down on their luck transformed Wyatt Earp into a folk hero, a central figure in the narrative of how the West was won. Celebrated as a man who took control of his own destiny, Wyatt Earp came to epitomize the town-taming marshal responsible for bringing the forces of law, order and civilization to the Wild West.\n\nWyatt Earp's actual life story, though, was more complicated than the romantic legend. He spent his youth carousing, gambling, and visiting brothels - sometimes just one step ahead of the law. A wanderer and an opportunist, Earp was ever in pursuit of greater fortunes in the next boomtown. He spent most of his life roaming the West, supporting himself with police work, mining, gambling, saloon-keeping, and real estate deals. After the tragic death of his young wife, Earp fell in among prostitutes and gamblers and remained closely connected to this underworld even after becoming a lawman. Soon after settling in the burgeoning silver mining town of Tombstone, Arizona, Wyatt Earp and his brothers became involved in a feud with the local Cowboys which culminated in the notorious 1881 Gunfight at the O.K. Corral.\n\nThough it lasted less than a minute, this infamous gunfight blurred the boundaries of law and criminality, and became a symbol a chapter in the winning of the West. In revenge for his brother's murder Earp took the law into his own hands, killing at least three of the local Cowboys before finally leaving the territory of Arizona for good.\n\nIn his later years, living in a small bungalow in Los Angeles, Wyatt Earp was haunted by his past, and fretted over his legacy. He died before he could witness his redemption as an enduring and admired hero in the American imagination.\n\n","torrent":{"xt":"urn:btih:92fc144cae0dde14ee99fa5f7a595d9a6c66a85a","amp;dn":"Wyatt+Earp+%28TV%29+%5B2010%5D+PBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92fc144cae0dde14ee99fa5f7a595d9a6c66a85a","infoHashBuffer":{"type":"Buffer","data":[146,252,20,76,174,13,222,20,238,153,250,95,122,89,93,154,108,102,168,90]},"announce":[],"urlList":[]}}