{"title":"Rails Across America [PL] [.7z]","uid":6634116,"size":103174980,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:93181f27b30f31809d9cddff869f1bbe8f4271cf&amp;dn=Rails+Across+America+%5BPL%5D+%5B.7z%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hackuss","files":-1,"time":1314481560,"description":"Developer(s).........Flying Lab Software\nPublisher(s).........Strategy First\nPlatform(s)..........Windows\nRelease date(s)......2001\nGenre(s).............Business simulation game\nMode(s)..............Single player / Multiplayer\nMultiplayer..........Lan/internet\nRating(s)............8/10\nMedia/distribution...CDROM\n\nScrenshoots: http://www.gry-online.pl/S055.asp?ID=4431\n\nRails Across America is a railroad simulation game released in late 2001 by developer Flying Lab Software and publisher Strategy First. It received generally positive reviews.[1] Though no official expansions have been released, a rudimentary map-editing tool was made available to the player community.\n\nThe game covers the period 1830 - 2040 in North America (including parts of Canada and Mexico). The game is \\'strategic\\' with emphasis on expansion of rail networks, finance, and competition with other railroads.\n\nRails Across America uses a proprietary 2D engine and 3D-flavored sprites, which are outdated when compared to contemporary games of the time. The game is played in a top-down view with various zoom levels. At the closest zoom, one can see animated trains and industries. At the furthest zoom the map is an abstract of the rail network. The user interface includes many \\'report\\' style screens which allow players to analyze the performance of specific aspects of their railroad, to compare themselves to their competitors, to obtain financing, etc.\n\nThe seamier side of the great age of railroad expansion is represented by a system of \\'influence\\' which is gained by various achievements, and which can be expended in various ways to undermine the competition. Influence is represented by colored \\'cards\\' with number values and some flavor text. The color and numbers are used in contention with opponents and the outcome can affect finances, construction, prestige, etc. Some smaller scenarios do not use the influence system.\n\nSingle-player mode includes multiple scenarios with specific goals, and longer \\'campaign\\' games. Multi-player mode supports up to eight players over LAN or GameSpy. Players who drop out are replaced by AIs.\n\nThe game provides several options which allow players to customize the experience, especially in multi-player mode.\n\n","torrent":{"xt":"urn:btih:93181f27b30f31809d9cddff869f1bbe8f4271cf","amp;dn":"Rails+Across+America+%5BPL%5D+%5B.7z%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93181f27b30f31809d9cddff869f1bbe8f4271cf","infoHashBuffer":{"type":"Buffer","data":[147,24,31,39,179,15,49,128,157,156,221,255,134,159,27,190,143,66,113,207]},"announce":[],"urlList":[]}}