{"title":"Hentai /  Black Gate 1-2 ","uid":6591791,"size":579589502,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:93559cf961e9d3663a47c6ff921e7e9abc6cfed9&amp;dn=Hentai+%2F++Black+Gate+1-2+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jimevjr","files":4,"time":1312862087,"description":"UNCENSORED/DUAL AUDIO/ENG SUBS \n\n\nVOL 1\n\nAs an average student, Kosaka always wondered what it would be like for girls to fight over \nhim. But now his girlfriend Shizuka and his friend Kasumi are fighting over him...with swords. \nHis school has a secret, a black gate that can only be opened by Shizuka and Kasumi, who each \nhave a tattoo over one of their breasts. When Shizuka opens the gate and makes a deal with the \nevil creatures on the other side, Kosaka and all the other girls at his school are thrown into \na deadly fight against evil. \n\n\nVOL 2 \n\nNarifumi Hosokawa prepares for his high school's culture festival with the Kadomori twins, Shizuku \nand Kasumi. While everyone is distracted, Shizuku decides to open a mysterious gate through the use \nof magic and travel to an alternate world. She has broken the oath of her family's heritage, as to \nprotect the Black Gate from those who seek the enormous power that lies within the world. The \nremaining defenders of the Black Gate, consisting of female students and a female teacher, must \ntravel through to the other side and return before any disruptions come to either dimension. \nHowever, Narifumi accompanies the group and Shizuku is waiting for them with some new allies.\n","torrent":{"xt":"urn:btih:93559cf961e9d3663a47c6ff921e7e9abc6cfed9","amp;dn":"Hentai+%2F++Black+Gate+1-2+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93559cf961e9d3663a47c6ff921e7e9abc6cfed9","infoHashBuffer":{"type":"Buffer","data":[147,85,156,249,97,233,211,102,58,71,198,255,146,30,126,154,188,108,254,217]},"announce":[],"urlList":[]}}