{"title":"Outbreak(1995)DVDRip.AC3(ENG)-DROCK","uid":6593237,"size":723304448,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:935894af9aa1b741c1147a2d4292c8fcbdde0b70&amp;dn=Outbreak%281995%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1312913180,"description":"A handful of scientists struggle to prevent the destruction of a small town -- and possibly the entire country -- in this suspense drama. In the mid-1960s, a deadly virus is discovered in Zaire that wipes out an entire village in 24 hours. Government researchers are brought in to investigate, but the military opts to destroy the village rather than risk further infection. Thirty years later, Sam Daniels (Dustin Hoffman), an expert on contagious diseases, is called in when the virus re-emerges in Africa. A monkey carrying the bug is smuggled into the U.S., and a suburban California town soon begins to succumb to the illness. Sam scrambles to find an antidote with the help of his ex-wife Robby (Rene Russo), a Center for Disease Control researcher, and their colleague Casey (Kevin Spacey), while Gen. McClintock (Donald Sutherland) has his own reasons for wanting to use bombs to contain the epidemic, and Army surgeon Gen. Ford (Morgan Freeman) is caught in the middle. Outbreak was produced in the hopes of beating the film version of Richard Preston\\'s bestseller The Hot Zone (about a real-life epidemic) into theaters; script problems shelved The Hot Zone, and Outbreak had the infectious disease market to itself. \n\nRipped with Autogk.\n\nLength: 2 Hours 8 Minutes\n\nFile Type: AVI\n\nFrame Width: 480\n\nFrame Height: 272\n\nFrame Rate: 59fps\n\nAudio\n\nBit Rate: 113kbps","torrent":{"xt":"urn:btih:935894af9aa1b741c1147a2d4292c8fcbdde0b70","amp;dn":"Outbreak%281995%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"935894af9aa1b741c1147a2d4292c8fcbdde0b70","infoHashBuffer":{"type":"Buffer","data":[147,88,148,175,154,161,183,65,193,20,122,45,66,146,200,252,189,222,11,112]},"announce":[],"urlList":[]}}