{"title":"Mafia II Directplay","uid":6615427,"size":6238976732,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:935b3408bff3760076e84c9e970e08bb0e3a4a3e&amp;dn=Mafia+II+Directplay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"amir741","files":3236,"time":1313758954,"description":"The game is set in the 1940-50s era of Empire Bay, a fictional city based on New York City, Chicago, Los Angeles, San Francisco, Boston and Detroit.[7][8] There are 30-40 vehicles in the game (45 with DLC) as well as licensed music from the era.[9]\nMany firearms from the previous return, such as the Thompson submachine gun and Colt 1911, as well as a pump-action shotgun (though it was changed from a Winchester Model 12 to a Remington 870). New WWII-era weapons like the MP 40, the M3 submachine gun, the MG 42 and the Beretta Model 38 also appear in the game.\nInteracting with objects in the environment involves two action buttons- a standard action and a &quot;violent&quot; action (for example, when stealing a car, the player may choose to either pick its lock or break the window glass), used in context-sensitive situations. A map is included as in the original Mafia game. The checkpoint system has been completely overhauled.[10] New controls include a cover system that allows the player to hide behind objects (such as generators, walls and large crates) to shoot enemies, rather than just using a crouch while behind an object.\nIt has been stated by 2K Czech that the game's cutscenes are created by the game engine, in real-time, rather than pre-rendered cutscenes. For example if the player is riding in a car and a cut scene starts, the player will be driving the same car and if the car is damaged, that will appear in the cut scene.[11]\nThe game has three different in game radio stations, Empire Central Radio, Empire Classic Radio and Delta Radio, with licensed music, news, and commercials. The radio stations includes music from different genres including rock and roll, big band, rhythm and blues, doo-wop, among others with licensed songs by Chuck Berry, The Everly Brothers, Dean Martin, Little Richard, Muddy Waters, Buddy Holly &amp; The Crickets, Bing Crosby, Bill Haley &amp; His Comets, The Chordettes, Bo Diddley, Rick Nelson, Eddie Cochran, The Champs, The Drifters, Screamin' Jay Hawkins, The Andrews Sisters, among others.\n\n\n\nCharacters\n\nMain article: List of Mafia characters\nVito Scaletta - The game's main protagonist and the son of a poor Sicilian family that moved to the United States. He turned to a life of crime after his father, an alcoholic, died leaving a debt unpaid. After being arrested for a botched robbery, Vito avoids incarceration by volunteering to join the US army during World War II. The opening chapter of the game revolved around his involvement in the war. He then spent a few more years in service before getting injured and returning to Empire Bay and resuming a life of crime alongside his best friend, Joe Barbaro.\n\n\n\n\nJoe Barbaro - Vito's best friend and accomplice. He was in most ways a polar opposite of Vito, with the latter keeping his friend's wild, rowdy behaviour in check. When Vito returns home on leave from the war, Joe, with the help of his connections to the mob, gives him forged discharge documents to ensure that Vito doesn't have to return. After Vito's father died, Joe helps Vito find work to settle his father's debts before the loan sharks come after his family.\n\n\n\nHenry Tomasino - A soldato in the Clemente crime family. He is the son of a high-ranking member of the Sicilian mafia and was forced to leave his home country in order to escape Benito Mussolini's regime. He helped Vito and Joe get into Empire Bay's criminal underworld.\n\n\n...................................System Requirements.............................\n\nMinimum System Requirements\nOS: Windows XP/Vista/7\nProcessor: Intel Core 2 Duo @ 3.0 GHz / AMD Athlon 64 X2 3600+\nMemory: 1.5 Gb\nHard Drive: 8 Gb free\nVideo Memory: 512 Mb\nVideo Card: nVidia GeForce 8600 / ATI Radeon HD 2600\nSound Card: DirectX Compatible\nKeyboard\nMouse\n\n\nRecommended System Requirements\nOS: Windows XP/Vista/7\nProcessor: Intel Core 2 Quad @ 2.5 Ghz / AMD Phenom X4 @ 2.5 Ghz\nMemory: 2 Gb\nHard Drive: 10 Gb free\nVideo Memory: 1 Gb\nVideo Card: nVidia GeForce 9800 GTX / ATI Radeon HD 3870\nSound Card: DirectX Compatible\nKeyboard\nMouse\n\n.......................................Enjoy.......................................\t\t\n","torrent":{"xt":"urn:btih:935b3408bff3760076e84c9e970e08bb0e3a4a3e","amp;dn":"Mafia+II+Directplay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"935b3408bff3760076e84c9e970e08bb0e3a4a3e","infoHashBuffer":{"type":"Buffer","data":[147,91,52,8,191,243,118,0,118,232,76,158,151,14,8,187,14,58,74,62]},"announce":[],"urlList":[]}}