{"title":"Hentai / Magical Kanan 1-2-3-4 + Summer Special 1-2","uid":6595887,"size":1644798126,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:944884d6fd059ba2bbe7c0f27761e3d538637830&amp;dn=Hentai+%2F+Magical+Kanan+1-2-3-4+%2B+Summer+Special+1-2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jimevjr","files":7,"time":1313011208,"description":"UNCENSORED  English  audio\n\nMagical Kanan - Vol 1(Episode 1)\n\nNatsuki comes to the human world by order of Queen Tsuyuha of the Magical Kingdom of Ever Green to recover \nthe mutagenic Seeds that were stolen. The Seeds possess humans &amp; turn them into demons through their \ndesires. Natsuki, injured on his journey, is saved by Chihaya. After Chihaya learns of the situation, she \nresolves to cooperate with Natsuki in his duty &amp; become a magical warrior!\n\n\nMagical Kanan - Vol 2(Episode 2)\n\nCarmine has been caught in the trap set by Septem. Just in the nick of time, she's saved by the mysterious \n3rd magical warrior, Cerulean Blue. Who coud she be? Chihaya reseolves to power up so that she can catch \nup to her rival, but...in the meantime, danger lurks at Angel Kiss...\n\n\nMagical Kanan - Vol 3(Episode 1)\n\nThese hot little beauties are going into battle again, using there sexual powers to save our planet \nfrom the dark side. More seeds of evil have been stirred up. The dark memories of Sayaka haunt them. \nWill Cerulean be a savior or stand in the way?\n\n\nMagical Kanan - Vol 4(Episode 2)\n\nOur sexy temptresses head out to the amusement park for what they think is a day of leisure. Instead, it \nis a day of intense sexual encounters and battle. All the girls in the amusement park fall prey to the \nhorde of tentacles. (That just means we get to fill more holes at a time in this episode.) In front of \nthe enemy's grand power, Carmine &amp; Cerulean Blue don't stand a chance, but they are saved by Septem. Why \nwas Septem an enemy in the first place? Everything is revealed!?\n\n\nMagical Kanan: Summer Special - Vol 1(Episode 1)\n\nIt was supposed to be a fun campout at the summer beach... Chihaya &amp; friends came to the beach for summer \ncamp. There they meet their classmate Nami Minami. She likes Natsuki, but doesn't have the courage to talk \nto him. As the darkness inside Nami grows, she finds an old mansion where the Netherworld Tree awaits her. \nIt was the start of the incident that would rock the boat...\n\n\nMagical Kanan: Summer Special - Vol 2(Episode 2)\n\nChihaya manages to escape from the slimes, but a possessed Tsuyoshi stands in her way while Natsuki is \nbeing tempted by Nami. Can Nami &amp; Tsuyoshi be saved!? What will happen to Sayaka &amp; the others!? The love \nstory of Chihaya &amp; Natsuki in this incident comes to a dramatic conclusion.","torrent":{"xt":"urn:btih:944884d6fd059ba2bbe7c0f27761e3d538637830","amp;dn":"Hentai+%2F+Magical+Kanan+1-2-3-4+%2B+Summer+Special+1-2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"944884d6fd059ba2bbe7c0f27761e3d538637830","infoHashBuffer":{"type":"Buffer","data":[148,72,132,214,253,5,155,162,187,231,192,242,119,97,227,213,56,99,120,48]},"announce":[],"urlList":[]}}