{"title":"Civilization V Trainer v 4.0.9","uid":6636895,"size":16739,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9758ac458ee5f97e34999c221685d12151a189fc&amp;dn=Civilization+V+Trainer+v+4.0.9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DelphiUniverse","files":-1,"time":1314598457,"description":"Civilization V Trainer v 4.0.9 for Civilization 5 v 1.0.1.348 ..by DelphiUniverse\n\n-------------\n4.0.9 Changes\n-------------\n\n* Changed the way it suspends the civ process\n* Added more necessary privilege flags\n* Automatically removes the privilege-warning\n  dialog at the beginning, will display one time only\n* Coded a more cool about window and put it in a dll\n  because all the strings add up waste to the executable\n\n (See Changelog.txt for all changes since version 4.0)\n\n-------------\nAbout Trainer\n-------------\n\nThis trainer is designed to work with Civilization 5 v 1.0.1.348\nDirectX 9 and DirectX 11.\n\nDo not attempt to use it with earlier or future versions of the game.\nIt will contaminate and corrupt memory if you do.\n\nThis trainer will give you the following:\n\n* Gold\n* Golden Age Progress\n* Golden Age Turns\n* Culture\n* Strategic Resources\n* Luxury Resources\n* Clear spent resource slots\n* Great General\n* Unit Experience\n* Movement\n* Heal units\n* City Modifier\n* Full hotkey support\n* Customizable (See Settings.ini)\n\n------------\nInstallation\n------------\n\n1. Create a new folder anywhere you like.\n2. Extract archive into that folder.\n3. Done.\n\n----------\nHow to use\n----------\n\nStart Trainer or Game in any order you like and always turn off cheat switches before making another turn. If you don't turn off cheats the game can crash or it can lead to that the AI get's the cheat and not you.\n\nWhen you apply a cheat, I highly recommend you click a city to update the display. This trainer has been reported to crash under WOW64, but it works flawlessly under Win32. If you experience problems under WOW64, please report back to me what you did to produce the problem.\n\n---------------\nSwitched Cheats\n---------------\n\n1: MOVEMENT SWITCH:\nThis cheat will give unlimited movement points to units. Activate it and then click any unit, in any number, in any priority and move them around. Always remember to deactivate a switched cheat before making another turn.\n\nSet the initial movement point in the left editbox to set a default initial value for your units. Why would you want to set a initial movement score when the movement is already infinite?\n\nThe reason is simple: Because if you have 1 movement point left, it will cancel if you try to move it more than 1 hex, its pretty annoying. The default initial value is already set so you do not need to worry about it.\n\n2: EXPERIENCE SWITCH:\nThis cheat will give experience to your units. Set a initial experience value in the editbox on the left, then click all your units. You only need to click them once. Then deactivate the cheat when finished.\n\n3: HEALING SWITCH:\nThis cheat will set health points on your units. Set the health point you want in the editbox on the left side (it can be in the range of 0-10 where 0 is no health and 10 is full health) Then click all units you want to set this health value upon. Deactivate the cheat when finished.\n\n4: CITY MODIFIER SWITCH:\nThis is probably the most complex cheat to use. (It's really not that complex). This cheat will set the city modifier value (it is in percentage %).\n\nIt will set the modifier value on 3 things: Production, Science and Gold. To have this cheat work you will need to buy OR sell a building that affects any of these 3 areas. Thats it.\n\nQuick hint: I recommend buying:\nUniversity (to enable modifier for science)\nFactory (to enable production modifier)\nStock Exchange (to enable gold modifier)\n\nYou can also sell buildings that affects these areas, the modifier will update that way too.\n\n-------\nHotkeys\n-------\n\n(CAPS-LOCK-OFF) ALT + F1\t= Movement Cheat\n(CAPS-LOCK-ON)  ALT + F1\t= Movement Cheat with zero points\n\n(CAPS-LOCK-OFF) ALT + F2\t= Give Unit Experience\n(CAPS-LOCK-OFF) ALT + F3\t= Set Health on units\n(CAPS-LOCK-OFF) ALT + F5\t= Set City Modifier (Science,Production and Gold)\n\nALT + BACKSPACE = Turn off all cheat switches\n\n(CAPS-LOCK-OFF) ALT + INSERT\t= Resources (Set value to value found in Settings.ini)\n(CAPS-LOCK-OFF) ALT + HOME\t= Gold (Set value to value found in Settings.ini)\n(CAPS-LOCK-OFF) ALT + PAGEUP\t= Culture (Set value to value found in Settings.ini)\n(CAPS-LOCK-OFF) ALT + DELETE\t= Golden Age Progress (Set value to value found in Settings.ini)\n(CAPS-LOCK-OFF) ALT + END\t= Golden Age Turns (Set value to value found in Settings.ini)\n(CAPS-LOCK-OFF) ALT + PGDOWN\t= Great General Progress (Set value to value found in Settings.ini)\n\n(CAPS-LOCK-ON) ALT + INSERT\t= Zero Resources\n(CAPS-LOCK-ON) ALT + HOME\t= Zero Gold\n(CAPS-LOCK-ON) ALT + PAGEUP\t= Zero Culture\n(CAPS-LOCK-ON) ALT + DELETE\t= Zero Golden Progress\n(CAPS-LOCK-ON) ALT + END\t= Zero Golden Turns\n(CAPS-LOCK-ON) ALT + PGDOWN\t= Zero Great General Progress\n\nALT + LEFT\t= Free all used resource slots\nALT + RIGHT\t= Zero all (Will zero out the following):\n\t\t\t1: Gold\n\t\t\t2: Golden Age Progress\n\t\t\t3: Golden Age Turns\n\t\t\t4: Culture\n\t\t\t5: All Strategic and Luxury Resources\n\t\t\t6: Great General Progress\n\n---------------\nUpDown Controls\n---------------\n\nI have added Up-Down controls to all edit boxes in the program.\nYou may change values in an edit box in many ways:\n\n1: Click a button to choose a predefined value.\n2: Click the edit box and type a custom value.\n3: Click the up-down control buttons to change values.\n4: Use the up-down arrow keys on your keyboard.\n5: Use mouse wheel to change values.\n\n---------------\nTroubleshooting\n---------------\n\nQ1: Trainer doesnt work?\nA1: Use only with Civ 5 version 1.0.1.348. It will not work with other versions.\n\nQ2: Trainer still doesnt work?\nA2: Your firewall/antivirus blocked it or sandboxed it. Unblock it, shut down trainer and restart it again\n\nQ3: Trainer is still not working?\nA3: The 6 primary cheats will only update after you click a city or do a next turn.\n\nQ4: I use WinXP and the trainer runs and quits almost instantly?\nA4: Try to run it using Win98 Compatability mode.\n\n--------\nFeedback\n--------\n\nPlease report new suggestions and bug reports here on CivFanatics or on ThePirateBay.org where you can find me under\nthe name of DelphiUniverse. Send an e-mail to the address found in the .rar archive comment section.\n\n------\nAuthor\n------\n\nCoded by DelphiUniverse using Microsoft Macro Assembly.\n\nMy favorite coding equipment:\n\n* SteelSeries 7G keyboard (Nothing close to it, nothing above it)\n* 26&quot; 2ms screen for coding happiness\n","torrent":{"xt":"urn:btih:9758ac458ee5f97e34999c221685d12151a189fc","amp;dn":"Civilization+V+Trainer+v+4.0.9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9758ac458ee5f97e34999c221685d12151a189fc","infoHashBuffer":{"type":"Buffer","data":[151,88,172,69,142,229,249,126,52,153,156,34,22,133,209,33,81,161,137,252]},"announce":[],"urlList":[]}}