{"title":"Naid - Waking Up 2000","uid":6607174,"size":321539146,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:975ffc4a41ccdccbca340f00865a920d9338e06e&amp;dn=Naid+-+Waking+Up+2000&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"barber9","files":-1,"time":1313446502,"description":"A forum for Swede Martin Landquist, NÃƒÂ¥id regresses to the late '70s/early '80s for melodic, often dreamy techno dance music. Similar to Depeche Mode, Landquist and his guests add relatively soulful vocals to his synths, resulting in an inviting and undoubtedly retro sound almost entirely out of step with the band's 2003 contemporaries. Although the title track was a moderate dancefloor hit, the bulk of the disc is less dance and more trance, with the majority of the second half devoted to ballads. Some, like This Could Be the First Day, have a yearning Howard Jones feel, but NÃƒÂ¥id's sound is more haunting, with ghostly female backing vocals adding an ethereal element. Think Tears for Fears, Pet Shop Boys, or Human League and you're in the ballpark. Paul Weller during his Style Council phase is also an influence, and Landquist's vocal on So Free is eerily reminiscent of the singer/songwriter. Although the techno beats resonate through most of the songs, this is less an album to dance along with than to listen to, preferably with headphones. It exudes a cushy, warm sound that belies its all-electronic composition. Songs don't stand out individually yet meld into each other, creating a disc that is greater than the sum of its parts. Those enamored by old-school European techno will be drawn to NÃƒÂ¥id's charms. Others may find the approach pleasant yet dated and derivative. (Hal Horowitz,\n\n\nNÃƒÂ¥id - Waking Up 2000\n(Stockholm Beverage)\n\n 1. Waking up \n 2. Stars \n 3. Turn on (city lights)  \n 4. Eternal life \n 5. Shout it out \n 6. Icba \n 7. Better day \n 8. This could be our first day \n 9. So free \n10. Yukawa 5 am\n\n\nMartin Landquist (vocals, guitar, piano, keyboards, programming)\nHanne Juul (vocals)\nMagnus Koch (guitar, programming, background vocals)\nPeter Fors (bass).\nDaniel Karlsson (electric piano, Fender Rhodes piano, Clavinet, synthesizer)\nLars Jonasson (drums).\nStockholm Session Strings (strings)\n","torrent":{"xt":"urn:btih:975ffc4a41ccdccbca340f00865a920d9338e06e","amp;dn":"Naid+-+Waking+Up+2000","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"975ffc4a41ccdccbca340f00865a920d9338e06e","infoHashBuffer":{"type":"Buffer","data":[151,95,252,74,65,204,220,203,202,52,15,0,134,90,146,13,147,56,224,110]},"announce":[],"urlList":[]}}