{"title":"Plagues in World History","uid":6647207,"size":1449352,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98c6fe1c722f172ce463363b4df45b5a7916d244&amp;dn=Plagues+in+World+History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bookzilla","files":1,"time":1314991065,"description":"Plagues in World History provides a concise, comparative world history of catastrophic infectious diseases, including plague, smallpox, tuberculosis, cholera, influenza, and AIDS. Geographically, these diseases have spread across the entire globe; temporally, they stretch from the sixth century to the present. John Aberth considers not only the varied impact that disease has had upon human history but also the many ways in which people have been able to influence diseases simply through their cultural attitudes toward them. The author argues that the ability of humans to alter disease, even without the modern wonders of antibiotic drugs and other medical treatments, is an even more crucial lesson to learn now that AIDS, swine flu, multidrug-resistant tuberculosis, and other seemingly incurable illnesses have raged worldwide. Aberth's comparative analysis of how different societies have responded in the past to disease illuminates what cultural approaches have been and may continue to be most effective in combating the plagues of today.\n\nRowman &amp; Littlefield Publishers\n2011\n257 pp","torrent":{"xt":"urn:btih:98c6fe1c722f172ce463363b4df45b5a7916d244","amp;dn":"Plagues+in+World+History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98c6fe1c722f172ce463363b4df45b5a7916d244","infoHashBuffer":{"type":"Buffer","data":[152,198,254,28,114,47,23,44,228,99,54,59,77,244,91,90,121,22,210,68]},"announce":[],"urlList":[]}}