{"title":"Out of the Trees Film Inserts [Monty Python Douglas Adams Graham","uid":6532977,"size":683144037,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:993004fbeeaf790db3b29218ded29210b8691386&amp;dn=Out+of+the+Trees+Film+Inserts+%5BMonty+Python+Douglas+Adams+Graham&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tygerbug","files":4,"time":1310413516,"description":"Here's a real Monty Python rarity - the film inserts from Out of the Trees, a\n 1975 television sketch show pilot written by Graham Chapman, Douglas Adams and\n Bernard McKenna that was broadcast on BBC 2 in 1976. The show shared some of\n the stream-of-consciousness style of Monty Python's Flying Circus, of which\n Chapman was a member. Actors included Mark Wing-Davey and Simon Jones.\n\nThis seventeen-minute reel [of which a lot is black space and leader] includes\n the various filmed inserts for the show, including the entire &quot;peony&quot; sketch\n starring Simon Jones, as well as portions of the Genghis Khan sketch starring\n Graham Chapman [and some stock footage and caption cards]. The peony sketch is\n actually much longer here than it was on the broadcast!\n\nQuality is okay, it has a second generation VHS look with time code.\n\nI've also included the [very low quality] audio for the entire show.\n\nThe entire show does exist as low quality video but has not yet been shared to\n the general public.\n\n\nThe concept of the show was, according to Chapman, to follow the exploits of two\n modern-day linguists who would travel around a Britain gripped in rapid\n decline. The linguists would comment upon the origins of a word or phrase,\n which would then be the genesis of a sketch. Although two scripts were written\n (the second a collaboration between Chapman and David Yallop), only one episode\n was ever filmed. It was broadcast only once by the BBC, with little promotion,\n at 10pm on Saturday 10 January 1976 opposite Match of the Day, and so was seen\n by relatively few people.\n\nThe videotape recording of the show has since been wiped, as used to be common\n for archived BBC shows, due to the relatively high cost of videotape at the\n time. The film segments shot in outdoor locations survive, and consist of a\n sketch titled &quot;Severance of a Peony&quot;, and some inserts intended for an item\n about Genghis Khan. The former was included on the DVD for Adams's 1981 TV\n series adaptation of The Hitchhiker's Guide to the Galaxy, and also appeared,\n rewritten as an anecdote, in Chapman's book A Liar's Autobiography. Rewrites of\n the Ghengis Khan sketch appeared in some editions of Adams's posthumous work\n The Salmon of Doubt as the short story &quot;The Private Life of Genghis Khan&quot;.\n\nIt was reported in 2005, by a representative posting on the forum at the archive\n television website The Mausoleum Club, that a videotape made by Chapman on an\n obsolete format had been handed to the National Film Television and Videotape\n Archive. This was restored and shown at the National Film Theatre on Saturday,\n 2 December 2006 as part of the Missing Believed Wiped event.\n\n\nDirected by\nIan MacNaughton\t \t\n \nWriting credits\n(in alphabetical order)\nDouglas Adams\t \t\nGraham Chapman\t \t\nBernard McKenna\t \t\n\nCast (in alphabetical order)\n\tMaria Aitken\t\t\n\tRoger Brierley\t\t\n\n\tGraham Chapman\t\t\n\tJennifer Guy\t\t\n\tMaggie Henderson\t\t\n\n\tSimon Jones\t\t\n\tMarjie Lawrence\t\t\n\tTim Preece\t\t\n\tMark Wing-Davey\t\t\n\nProduced by\nBernard Thompson\n \nOriginal Music by\nNeil Innes\t \t\n","torrent":{"xt":"urn:btih:993004fbeeaf790db3b29218ded29210b8691386","amp;dn":"Out+of+the+Trees+Film+Inserts+%5BMonty+Python+Douglas+Adams+Graham","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"993004fbeeaf790db3b29218ded29210b8691386","infoHashBuffer":{"type":"Buffer","data":[153,48,4,251,238,175,121,13,179,178,146,24,222,210,146,16,184,105,19,134]},"announce":[],"urlList":[]}}