{"title":"The World Religions Cookbook","uid":6566161,"size":4043360,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:99c37862860545fc103582820d2140020973db19&amp;dn=The+World+Religions+Cookbook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lionzbay","files":1,"time":1311691866,"description":"\nAuthor(s): Arno Schmidt\nPublisher: Greenwood\nDate: 2007-05-30\nFormat: pdf\nLanguage: English\nISBN10: 0313335044\nPages: 296\nISBN13: 9780313335044\n\nProduct Description:\n\nFood is central to daily religious practice and holiday celebrations the world over. For instance, Orthodox Jews keep kosher, Muslims feast after fasting during the holy month of Ramadan, and Hindus leave food offerings in the temple for the dieties. For many, food is seen as nourishment for the body and soul. This cookbook illuminates the food practices of followers of the world's major religions: Judaism, Christianity, Islam, Hinduism, Sikhism, Buddhism, and Shintoism. The narrative and nearly 300 recipes give a flavor of what is often eaten for sacred occasions and why. This volume will be useful for a range of cooks and purposes. It is targeted to middle school age to adults. Those looking for more and different recipes for religion class assignments and International Week Food Festival or even for browsing will be richly rewarded with a one-stop resource.\n\n\nEach chapter covers a religion or two with similar food practices. A brief overview of the religion is followed by a discussion of any dietary restrictions. Then the recipes are organized by holiday or special occasion, featuring from appetizers to desserts. Recipes are culled from a variety of countries and cultures where the religion is practiced. The recipes are contextualized and have clear instructions for the novice cook. A final section in some chapters allows readers to recreate what the religion's founder or major figures might have eaten during their lifetime. A glossary defines what might be unfamiliar cooking terms and food and kitchen items. An introduction, list of recipes, conversion measurements, bibliography, index, and illustrations round out the cookbook.","torrent":{"xt":"urn:btih:99c37862860545fc103582820d2140020973db19","amp;dn":"The+World+Religions+Cookbook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99c37862860545fc103582820d2140020973db19","infoHashBuffer":{"type":"Buffer","data":[153,195,120,98,134,5,69,252,16,53,130,130,13,33,64,2,9,115,219,25]},"announce":[],"urlList":[]}}