{"title":"A Dolls House - (Jane Fonda) DivX  convert  moviesbyrizzo","uid":6509848,"size":869981701,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9b185e6d199e67cbeb7ba7ccdf18c3b0d2be3115&amp;dn=A+Dolls+House+-+%28Jane+Fonda%29+DivX++convert++moviesbyrizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"moviesbyrizzo","files":-1,"time":1309581501,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0069988/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0069988/&lt;/a&gt;\n\nConverted from made in Germany DVD just received from ebay in the UK\n\n720 X 540 video at 997k bitrate 128k English audio \n- no German audio track on this torrent offering (subtitles included\nhowever in SRT format - for the German language equally)\n\n\nThis movie was hard to locate as it is named &quot;Nora&quot; rather than \n&quot;A Dolls House&quot; in the ebay listings and on the DVD\n\nGreat performance by Edward Fox\n\nA Doll's House is the brilliant work of Henrik Ibsen of Norway\nIt is about the fundamantal differences in people in respect of how\nwe are made to differently see all matters across the board and most \ncertainly on such issues as morality and genuine human ideas of true\nlove and care rather than legalistic semantic notions of perfunctory\nadequacy instead.\n\nThe very best rendition of this great work is the Norwegian production\nEt Dukkehjem - currently only available in the boxed set Ibsen pÃƒÂ¥ TV\nfrom Norway http://nrkbutikken.no/produktsok/results/et%20dukkehjem\n(We've spend years looking for it and are purchasing this set to bring\nyou a better version of this movie in respect of video res and audio\nbitrate too from what we have offered before.\n\nThe fact is that it is the very poorest tactical procedure you could\nemploy, to instead make use of the likes of Claire Bloom (in the Anthony\nHopkins version of A Dolls House production for instance)and even Jane\nFonda's to some extent although not nearly as close in the imagination\na degree of error as it were.\n\nThe actual tale is told best in the production of A Dolls House\n(Et Dukkehjem) The truly beautiful Ms. Lise Fjeldstad shows us\njust what a shock it is for the real Irish spirit to be treated to such\nalien notions of better ideas of so-called moral goodness in contrast\nto her own instincts as a competent human being.\n\n\nAll other renditions that have since been produced seek to obfuscate\nthis fact by using actors that bring the character of Torvals and Nora\nmuch too closer together for there to remain an adequate understanding\nof the contrast needed instead to adequately tell what the message of \nthis Play is truly all about meant to be at the core. \n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n","torrent":{"xt":"urn:btih:9b185e6d199e67cbeb7ba7ccdf18c3b0d2be3115","amp;dn":"A+Dolls+House+-+%28Jane+Fonda%29+DivX++convert++moviesbyrizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b185e6d199e67cbeb7ba7ccdf18c3b0d2be3115","infoHashBuffer":{"type":"Buffer","data":[155,24,94,109,25,158,103,203,235,123,167,204,223,24,195,176,210,190,49,21]},"announce":[],"urlList":[]}}