{"title":"Jimi Hendrix - South Saturn Delta (1997) 320 vtwin88cube","uid":6651575,"size":165801878,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9cdd1c127b7679a9901ca6f4615fe4caf085de10&amp;dn=Jimi+Hendrix+-+South+Saturn+Delta+%281997%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1315169351,"description":"Jimi Hendrix\nSouth Saturn Delta (1997)\n\n\n\n\nIn his brief four-year reign as a superstar, Jimi Hendrix expanded the vocabulary of the electric rock guitar more than anyone before or since. Hendrix was a master at coaxing all manner of unforeseen sonics from his instrument, often with innovative amplification experiments that produced astral-quality feedback and roaring distortion. His frequent hurricane blasts of noise and dazzling showmanship -- he could and would play behind his back and with his teeth and set his guitar on fire -- has sometimes obscured his considerable gifts as a songwriter, singer, and master of a gamut of blues, R&amp;B, and rock styles. \n\n\n\n\nFormat:\t\t\tMp3\nBitrate:\t\t320 CBR\nContains:\t\tAlbum Art &amp; ID Tags\n\n\n\n\nShortly after the Hendrix family reacquired the rights to Jimi's catalog, they signed a long-term deal with MCA Records and pulled many of the compilations of unreleased material and rarities off the shelves, with the intent of re-releasing the material in better collections. First Rays of the New Rising Sun, an attempt at assembling Hendrix's uncompleted last album, was the first release from Experience Hendrix LLC, and it was followed months later by South Saturn Delta, a collection of rarities -- all but one of the 15 tracks were never officially released in the U.S. -- that spans his entire career. Its intent is to capture the full range of Hendrix's music through an alternate history, and it works pretty well. Among the highlights are tracks from the War Heroes and Rainbow Bridge Concert albums (&quot;Look Over Yonder,&quot; &quot;Tax Free,&quot; &quot;Midnight,&quot; &quot;Pali Gap,&quot; &quot;Bleeding Heart&quot;), &quot;Sweet Angel&quot; (an early version of &quot;Angel&quot;), an instrumental &quot;Little Wing,&quot; a solo take on &quot;Midnight Lightning,&quot; and a studio version of &quot;Message to the Universe (Message to Love).&quot; There are also alternate mixes of &quot;All Along the Watchtower,&quot; &quot;Power of Soul,&quot; &quot;Drifter's Escape,&quot; &quot;South Saturn Delta,&quot; and &quot;The Stars That Play With Laughing Sam's Dice.&quot; It's an intelligently sequenced, listenable collection of some of the very best outtakes and rarities from Hendrix, and is another sign that Experience Hendrix LLC's restoration of Jimi's catalog will be smart, stylish, and logical. \n\n\n\n\nAudio-Info:\n\n\n01. Look Over Yonder\n02. Little Wing (Angel)\n03. Here He Comes (Lover Man)\n04. South Saturn Delta\n05. Power Of Soul (Alternate Take)\n06. Message To The Universe (Message To Love)\n07. Tax Free\n08. All Along The Watchtower (Alternate Take)\n09. The Stars That Play With Laughing Sam's Dice\n10. Midnight\n11. Sweet Angel (Angel)\n12. Bleeding Heart\n13. Pali Gap\n14. Drifter's Escape (Alternate Take)\n15. Midnight Lightning\n\n\n\n\n\n\n\n\n\n            ****Support The Artists &amp; Buy It If You Like It.****\n\n\n                ****Enjoy &amp; Please Don't Forget To Seed!****\n\n\n\n\n","torrent":{"xt":"urn:btih:9cdd1c127b7679a9901ca6f4615fe4caf085de10","amp;dn":"Jimi+Hendrix+-+South+Saturn+Delta+%281997%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cdd1c127b7679a9901ca6f4615fe4caf085de10","infoHashBuffer":{"type":"Buffer","data":[156,221,28,18,123,118,121,169,144,28,166,244,97,95,228,202,240,133,222,16]},"announce":[],"urlList":[]}}