{"title":"Soulcaster 1 and 2 PC - OUTLAWS","uid":7027116,"size":58447622,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9cebf9e73edb7a240e58bfbf7312fe769c4fe712&amp;dn=Soulcaster+1+and+2+PC+-+OUTLAWS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Tom_Da_Man","files":-1,"time":1329058566,"description":"The game is a neat fusion of dungeon crawling bits, roguelike elements and tower defence with cool retro graphics and a very good soundtrack. You are a wizard, but not just a regular wizard: you're a Soulcaster! Your wizard comes across the spirits of three long dead adventurers, and using your magic you can summon copies of them to protect yourself from the hordes of undead. In layman's terms, you run around the map with a limited number of available units (up to five) and try to keep the enemies from attacking you by blocking off chokepoints and setting up defensive perimeters.\n\nThere are three adventurers, each with their role along with a slew of pros and cons. You have the archer, who fires in a straight line and does the most damage, the warrior, who does low damage but can be used to block hallways, and the bomber, who does area damage but is weaker overall. It's probably a good thing there are only three units, because each one has a ton of conditional elements and weaknesses. The archer cannot fire over obstacles and allies, the warrior dies very quickly when surrounded and the bomber explodes on death, damaging enemies and allies alike. Add in a bunch of colour coded enemies that can counter your units, and you have a simple to learn but deeply sophisticated basis for gameplay.\n\nInstall:\n=======-=\nRun the setup and you're done!\n\nHave Fun!","torrent":{"xt":"urn:btih:9cebf9e73edb7a240e58bfbf7312fe769c4fe712","amp;dn":"Soulcaster+1+and+2+PC+-+OUTLAWS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cebf9e73edb7a240e58bfbf7312fe769c4fe712","infoHashBuffer":{"type":"Buffer","data":[156,235,249,231,62,219,122,36,14,88,191,191,115,18,254,118,156,79,231,18]},"announce":[],"urlList":[]}}