{"title":"System Design for Telecom Gateways{BBS}","uid":6645359,"size":7896863,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d5ea5ce83b0d780538a8299578b4bfd21d2dbda&amp;dn=System+Design+for+Telecom+Gateways%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1314924757,"description":"System Design for Telecommunication Gateways provides a thorough review of designing telecommunication network equipment based on the latest hardware designs and software methods available on the market. Focusing on high-end efficient designs that challenge all aspects of the system architecture, this book helps readers to understand a broader view of the system design, analyze all its most critical components, and select the parts that best fit a particular application. In many cases new technology trends, potential future developments, system flexibility and capability extensions are outlined in preparation for the longevity typical for products in the industry.\n\nKey features:\n\n    * Combines software and hardware aspects of the system design.\n    * Defines components and services supported by open-source and commercial basic and extended software platforms, including operating systems, middleware, security, routing, management layer and more.\n    * Focuses on disruptive technologies.\n    * Provides guidelines for developing software architectures based on multi-threaded, multi-process, multi-instance, multi-core, multi-chip, multi-blade and multi-chassis designs.\n    * Covers a number of advanced high-speed interconnect and fabric interface technologies and their commercial implementations.\n    * Presents different system form factors from compact pizza-box styles to medium and large bladed systems, including IBM BladeCenter, ATCA and microTCA-based chassis. Describes different mezzanine cards, such as PMC, PrPMC, XMC, AMC and others.\n\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 512 pages\n    * Publisher: Wiley; 1 edition (December 28, 2010)\n    * Language: English\n    * ISBN-10: 047074300X\n    * ISBN-13: 978-0470743003","torrent":{"xt":"urn:btih:9d5ea5ce83b0d780538a8299578b4bfd21d2dbda","amp;dn":"System+Design+for+Telecom+Gateways%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d5ea5ce83b0d780538a8299578b4bfd21d2dbda","infoHashBuffer":{"type":"Buffer","data":[157,94,165,206,131,176,215,128,83,138,130,153,87,139,75,253,33,210,219,218]},"announce":[],"urlList":[]}}