{"title":"Family (TV series 1976 - seasons 1 &amp; 2)","uid":7018768,"size":8281016825,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9e4d8fdc017684560e14da4098b2ad1c85ca54ec&amp;dn=Family+%28TV+series+1976+-+seasons+1+%26amp%3B+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rubusdemonoid","files":-1,"time":1328755801,"description":"I no longer have my own internet connection and have to make use of open connections when I can snag one, so PLEASE don\\\\\\'t complain about the slow upload. Please help to seed this torrent when you are completed as I have over 70 torrents that I try to keep alive and seed for you all.\n\n\n\n\nI have never  been able to find this mid 1970\\\\\\'s TV series online, so when I found the season 1 &amp; 2 DVD at the public library, I thought I\\\\\\'d share it with you all. I recall watching this show when I was a little kid, and for the time (1976), it was rather groundbreaking for some of the subject matter it focused on. The mid 70\\\\\\'s was a VERY different mindset than today, so the topics are mild compared to today\\\\\\'s. I hope you enjoy them. I ripped them so all will fit on one dual-layer DVD (8 GB). Enjoy!   :-)\n\nP.S. - seasons 3 - 5 have never been released on DVD yet.  :-(\n\n\nThe trials and tribulations, joyous occasions and heartbreaking moments of the Lawrence family: lawyer father Doug, housewife Kate, married (and quickly divorced) daughter Nancy, teenage son Willie and just-hitting-puberty daughter Buddy. In this critically acclaimed series, we watched various Lawrences fight, fall in love, become ill, graduate school, begin new jobs and, most of all, love each other.\n\nThe show featured Sada Thompson and James Broderick as Kate and Doug Lawrence, a happily married middle-class couple living in Pasadena, California. Doug is an independent lawyer, and Kate was a housewife (she would eventually go back to school herself). They had three children: Nancy (portrayed by Elayne Heilveil in the original mini-series and later by Meredith Baxter Birney), Willie (Gary Frank), and Letitia, nicknamed \\\\\\&quot;Buddy\\\\\\&quot; (Kristy McNichol). (There was another son, Timothy, who had died five years previous to the series\\\\\\' beginning.) The show raised the profile of all of its featured actors during its run and, in particular, catapulted McNichol to stardom.\n\nThe show attempted to depict the \\\\\\&quot;average\\\\\\&quot; family, warts and all. Storylines were very topical, and the show was one of the first to feature shows that have recently been termed as \\\\\\&quot;very special episodes.\\\\\\&quot;\n\n\n\n\n\n\n\n\nMore of my music &amp; movie downloads that you may find of interest are located here: &lt;a href=&quot; http://thepiratebay.se/user/rubusdemonoid/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/rubusdemonoid/&lt;/a&gt;\t\t\n\n","torrent":{"xt":"urn:btih:9e4d8fdc017684560e14da4098b2ad1c85ca54ec","amp;dn":"Family+%28TV+series+1976+-+seasons+1+%26amp%3B+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e4d8fdc017684560e14da4098b2ad1c85ca54ec","infoHashBuffer":{"type":"Buffer","data":[158,77,143,220,1,118,132,86,14,20,218,64,152,178,173,28,133,202,84,236]},"announce":[],"urlList":[]}}