{"title":"Four Corners -- 04-07-11  - Sri Lanka's Killing Fields.mp4","uid":6517492,"size":219103106,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9e530c261a110be91197e0f65e1f189bc10905c6&amp;dn=Four+Corners+--+04-07-11++-+Sri+Lanka%5C%27s+Killing+Fields.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Owen65","files":1,"time":1309876129,"description":"Sri Lanka\\\\\\'s Killing Fields\n\nReporter: Channel 4\n\nBroadcast: 04/07/2011\n\nProduced by the Channel 4 in Britain, the program forensically investigates allegations that up to 40,000 Tamil civilians were killed as Sri Lankan Government forces moved in to destroy the Tamil Tiger army. The program provides evidence that while the \\\\\\'Tigers\\\\\\' used civilians as human shields, the Government forces repeatedly shelled civilians who had been offered sanctuary in \\\\\\&quot;no fire zones\\\\\\&quot;. The Government of Sri Lanka denies this, questioning the numbers killed and the authenticity of the visual evidence. You can judge for yourself.\n\nThe program contains disturbing descriptions and footage of executions, atrocities and the shelling of civilians. It includes devastating new video evidence of war crimes. Some of this material was shot on video cameras; other scenes are taken from mobile phones used by Sri Lankan soldiers as trophy vision. Put together it creates one of the most confronting stories of war and conflict ever seen on Australian television.\n\nThe film goes to air as United Nations Secretary-General Ban Ki-moon faces growing criticism for refusing to launch a full independent investigation into \\\\\\&quot;credible allegations\\\\\\&quot; of war crimes and crimes against humanity.\n\nIn June 2010, the UN chief asked a panel of experts to advise him on the evidence available relating to the conduct by both sides in the closing months of the war. In a report published in April this year, the panel of experts concluded that there was credible evidence that up to 40,000 people were killed in the final months of the civil war between the Tamil Tigers and Government forces.\n\nThe report called for the creation of an international mechanism to investigate alleged violations of international humanitarian and international human rights laws committed by Sri Lankan Government forces and the Liberation Tigers of Tamil Eelam.\n\nThis film provides powerful evidence that will lend new urgency to the panel\\\\\\'s call for an international inquiry, including harrowing interviews with eye-witnesses, new photographic stills, official Sri Lankan Army video footage, and satellite imagery.\n\nWhile the program clearly shows the brutality of Government forces, the film\\\\\\'s producers also detail the horrific atrocities carried out by the Tamil Tigers, who used civilians as human shields. In one case, a Tamil Tiger suicide bomber detonates an explosive charge while standing in the middle of a \\\\\\&quot;safe haven\\\\\\&quot; area for other Tamils.\n\nAs one international legal expert explains, the behaviour of the \\\\\\'Tigers\\\\\\' cannot be ignored:\n\n\\\\\\&quot;Crimes by one side do not begin to give a kind of carte blanche to the other side to break the rules as well.\\\\\\&quot;\n\nHowever, in the end \\\\\\&quot;Sri Lanka\\\\\\'s Killing Fields\\\\\\&quot; presents a damning account of the actions of Sri Lankan Government forces, in a war that the Government still insists was conducted with a policy of \\\\\\&quot;Zero Civilian Casualties\\\\\\&quot;. ","torrent":{"xt":"urn:btih:9e530c261a110be91197e0f65e1f189bc10905c6","amp;dn":"Four+Corners+--+04-07-11++-+Sri+Lanka%5C%27s+Killing+Fields.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e530c261a110be91197e0f65e1f189bc10905c6","infoHashBuffer":{"type":"Buffer","data":[158,83,12,38,26,17,11,233,17,151,224,246,94,31,24,155,193,9,5,198]},"announce":[],"urlList":[]}}