{"title":"The Messengers(2007)DVDRip.AC3(ENG)-DROCK","uid":6566129,"size":732884361,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9e60a0a5579493363686a5b78b65a420be0cb705&amp;dn=The+Messengers%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1311689705,"description":"Hong Kong horror specialists Danny and Oxide Pang (The Eye, Bangkok Haunted) ponder the paranormal sensitivities of young innocents in this tale of an unsuspecting family who falls prey to a malevolent entity after moving to into a haunted sunflower farm. Roy (Dylan McDermott) and Denise Solomon (Penelope Ann Miller) have decided to give up life in Chicago and relocate their family to secluded North Dakota sunflower farm. While the tranquil sway of the lush yellow fields at first offers a welcomed reprieve from the hustle and bustle of the big city, the family soon begins to suspect that they are not alone on the farm when teenage daughter Jess (Kristen Stewart) and her three-year-old brother, Ben (Evan Turner), begin to see a series of menacing apparitions that are apparently invisible to adult eyes. As Jess and Ben's encounters with the malevolent spirits grow increasingly violent, the parents of the tormented teen soon begin to question their daughter's sanity. Soon, the dark history of the family that once lived in the remote farm and the troubled past of the frightened Jess begin to merge as she struggles to warn her parents about the terrifying confrontation with the supernatural that is about to unfold. John Corbett, Jodelle Ferland, and Brent Briscoe co-star in a rural tale of terror from Ghosthouse Pictures and producer Sam Raimi. \n\nRipped with Handbrake.\n\nLength: 1 Hour 30 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 384\n\nFrame Rate: 24fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:9e60a0a5579493363686a5b78b65a420be0cb705","amp;dn":"The+Messengers%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e60a0a5579493363686a5b78b65a420be0cb705","infoHashBuffer":{"type":"Buffer","data":[158,96,160,165,87,148,147,54,54,134,165,183,139,101,164,32,190,12,183,5]},"announce":[],"urlList":[]}}