{"title":"Operacion Jaque 1x02 Final DVB Spanish by tony","uid":6604569,"size":776322408,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9ea6101a9366f4e5e89ddf60b71ea3b94859237f&amp;dn=Operacion+Jaque+1x02+Final+DVB+Spanish+by+tony&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"carambolas","files":3,"time":1313342436,"description":"Si quieres mas series, peliculas, juegos, etc... tanto por descarga directa como por torrent. visitanos:\n   &lt;a href=&quot;\nhttp://www.tonytorrent.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tonytorrent.com&lt;/a&gt;\n\nEl 23 de febrero de 2001, Ingrid Betancourt, candidata a la presidencia de Colombia, fue secuestrada por las FARC durante un viaje en plena campaÃƒÂ±a electoral. Su amiga y jefa de campaÃƒÂ±a, Clara Rojas, estaba con ella y le siguiÃƒÂ³ en el cautiverio.\n\nSeis aÃƒÂ±os durÃƒÂ³ el secuestro en la selva, durante los cuales Ingrid Betancourt experimentÃƒÂ³ el dolor al enterarse de la muerte de su padre, la desesperaciÃƒÂ³n de no ver crecer a sus hijos, la pÃƒÂ©rdida de su amistad con Clara, la emociÃƒÂ³n del embarazo y parto de ÃƒÂ©sta en plena selva y el amor y la amistad que sintiÃƒÂ³ por otro secuestrado, el senador Luis Eladio PÃƒÂ©rez.\n\nSeis aÃƒÂ±os que concluyeron con su rescate por parte del EjÃƒÂ©rcito de Colombia, que engaÃƒÂ±ÃƒÂ³ a los terroristas haciÃƒÂ©ndose pasar por un grupo en misiÃƒÂ³n humanitaria.\n\nInspirada en una historia real y protagonizada por Marcela Mar, Luis Fernando Montoya, Cristina Campuzano y JuliÃƒÂ¡n Arango, &quot;OperaciÃƒÂ³n Jaque&quot; muestra las duras condiciones de la vida de Ingrid durante su secuestro en la selva donde, junto a la crueldad de los terroristas y la agonÃƒÂ­a de los secuestrados, hubo tiempo para la ternura, la amistad e incluso la pasiÃƒÂ³n; la lucha de la madre de Ingrid por su hija y su enfrentamiento al gobierno de Colombia, asÃƒÂ­ como el valiente y desinteresado sacrificio de los hombres el EjÃƒÂ©rcito de Colombia, que arriesgaron su vida en una de las misiones de rescate mÃƒÂ¡s peligrosas y espectaculares de todos los tiempos.","torrent":{"xt":"urn:btih:9ea6101a9366f4e5e89ddf60b71ea3b94859237f","amp;dn":"Operacion+Jaque+1x02+Final+DVB+Spanish+by+tony","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ea6101a9366f4e5e89ddf60b71ea3b94859237f","infoHashBuffer":{"type":"Buffer","data":[158,166,16,26,147,102,244,229,232,157,223,96,183,30,163,185,72,89,35,127]},"announce":[],"urlList":[]}}