{"title":"Knights Of Honor (FIXED AND FRESH) - POTP","uid":7022781,"size":1351955394,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9f078f88433a6122be0298752dc1a37f514bc1d5&amp;dn=Knights+Of+Honor+%28FIXED+AND+FRESH%29+-+POTP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PowerOfThePoor1992","files":-1,"time":1328900564,"description":"Helo and Good Eve everyone!\n\nSo taday i brought you one of my favourite games out there Knights of Honor, a truly amazing strategy game with a feel you do not get from any other.\n\nAs you all know the other torrent those other cunts have made is not providing the information you need to get this game working, if you like me are one of those whom had problems istalling this game and didn't get it working, well no worries i have got it fixed.\n\nJust make sure you follow my instructions i will try my best to help anyone whom doesn't still get it up. \n\nBut before we go anyfurther, i want to tell you stop downloading the other knights of honor torrents since they either contain virus or is corrupted or the jackass uploader don't know shit about how to get the game working or even know if the game is playable.\n\nAnd also please leave a comment of appreciation and do fucking seed please!!! :)\n\n------------------------------------------------------------------\n\nFirst step is to install the game \n\n\n1. Unrar\n2. Mount with Deamon tools or Alcohol 120%\n3. Install\n4. Put all files from the crack folder in your game folder\n5. Now patch the game with the patch in the folder &quot;Patch 1.05&quot;\n6. now the game is playable!!!\n\nThou the resolution is not great, and to fix that you have to do the followings.\n\n\n1. go to ( c:\\Users\\&lt;my name&gt;\\AppData\\Roaming\\Black Sea Studios\\Knights Of Honor )  There is a file in the KOH install directory called KOH.in2\n\n2. Now you open it with wordpad\n\n\n3. Find the section called Video.\n\n\n4. Now here you will have to expereiment with the mode value to get the right resolution.\n\nand if you know your own resolution set the Width: value to that number\n\nand height: to it's correct number\n   \n\nHere's what mine looks like:\n\n[video]\n\nfullscreen = 1\nmode = 137\nwidth = 1920\nheight = 1080\nfreq = 60\n\nYou may have to experiment with the mode= value.\n\nI came across this while re-adjusting the game. When you run KOH for the first time, it gives you the option to pick the video resolution from a drop-down list. It gave me a list of six options, but only 2 of the options were unique values. The others were just repeats. (1024x768 at 50hz, and 1024x768 at 60hz). I picked item number 4, which was the first 1024x768 at 60hz option. This resulted in the mode=137 value.\n\n\nI edited the KOH.in2 file by hand, and put in 1366x768 as my resolution, which my laptop supports. However, KOH does not recognize this value. This caused the select video option to reappear when I ran the game again, just like when I first installed KOH. That is when I picked the 1024x768 at 60hz option, resulting in the settings I listed above.\n\nKOH now fills up the whole 14-inch screen on my stand and lapptop, instead of the &quot;letterbox&quot; display I had before.\n\nI hope this explanation makes some sense.\n\n5. And so thats it now enjoy!!!\n\n------------------------------------------------------------------------------------\n\n\n\nThis game is brought to you by POTP! PLEASE SEED AND LEAVE A COMMENT OF APPRICIATION. :)\n","torrent":{"xt":"urn:btih:9f078f88433a6122be0298752dc1a37f514bc1d5","amp;dn":"Knights+Of+Honor+%28FIXED+AND+FRESH%29+-+POTP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f078f88433a6122be0298752dc1a37f514bc1d5","infoHashBuffer":{"type":"Buffer","data":[159,7,143,136,67,58,97,34,190,2,152,117,45,193,163,127,81,75,193,213]},"announce":[],"urlList":[]}}