{"title":"The Wind Carpet","uid":6880512,"size":732798976,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9f590857dee1587225eb09b3b13c9e93ba7ad58e&amp;dn=The+Wind+Carpet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1323637604,"description":"Japan and Iran are not in close relationship. More than 4 centuries ago, however, Persian carpets were used in the festival of Takayama, a historic city in mountainous area of Honsyu. A man planned to resume the carpet in the festival, and asked Kinue, a Persian carpet designer, to design it. Kinue\\\\\\'s husband, Makoto, is a carpet importer. They send the design to Iran to weave the carpet. But just before Makoto goes to Iran to receive the carpet, Kinue dies of a traffic accident.\n\nA month before the festival, Makoto went to Isphahan, Iran, to receive the carpet. He brings his daughter Sakura, who does not open her heart after she lost her mother. To surprise, the carpet production has not even started. It will take 3 months from the start. For Makoto it means he betrays not only the festival planners but also his late wife.\n\nThey understand how special the carpet is. They work on three shift to weave the carpet within 20 days. During the production, there are some episodes. Makoto\\\\\\'s daughter Sakura, who never open her mind to other people. Always recalling her mother. A boy who has to work instead of his ill father. Boy\\\\\\'s puppy love to Sakura. Iranian couple without children. The wife loves Sakura. She takes care of children of the carpet weavers. An old woman who manages the whole project with strong will. Their prayer to produce perfect carpet.\n\nWith the culture of two historical countries as warp thread, people\\\\\\'s love and warmness are woven.","torrent":{"xt":"urn:btih:9f590857dee1587225eb09b3b13c9e93ba7ad58e","amp;dn":"The+Wind+Carpet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f590857dee1587225eb09b3b13c9e93ba7ad58e","infoHashBuffer":{"type":"Buffer","data":[159,89,8,87,222,225,88,114,37,235,9,179,177,60,158,147,186,122,213,142]},"announce":[],"urlList":[]}}