{"title":"Argent - Encore: Live In Concert (1999) 320 vtwin88cube","uid":6648042,"size":189216194,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a0ed7b539ae322f00e85d173decb5f98be97c114&amp;dn=Argent+-+Encore%3A+Live+In+Concert+%281999%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1315022168,"description":"Argent\nEncore: Live In Concert (1999)\n\n\n\n\nAfter the Zombies broke up, keyboardist/songwriter Rod Argent formed his own band in 1969, which incorporated more classical, jazz, and art rock influences in accordance with Argent's musical training. The group's other members were guitarist/songwriter Russ Ballard, bassist Jim Rodford, and drummer Bob Henrit. Argent's first two albums, Argent and Ring of Hands, received a fair amount of critical acclaim, but their real breakthrough came with 1972's All Together Now, which contained the Top Five smash &quot;Hold Your Head Up&quot;; In Deep produced a minor hit in &quot;God Gave Rock 'N' Roll to You,&quot; which was covered by Kiss in 1992. By 1974, Ballard had developed his songwriting talents enough to leave for a solo career (Three Dog Night had a Top Ten single in 1971 with his &quot;Liar,&quot; from Argent), and was replaced by guitarist John Verity and string player John Grimaldi. Without Ballard, the group lost its focus and indulged its tendencies toward extended art rock passages and improvisational solos to somewhat excessive levels. Argent broke up in 1976; Rodford joined the Kinks, while Argent himself recorded several solo albums and became a record producer, working with Tanita Tikaram, among others.\n\n\n\n\nFormat:\t\t\tMp3\nBitrate:\t\t320 CBR\nContains:\t\tAlbum Art &amp; ID Tags\n\n\n\n\nThis album, originally released as a double LP in early 1975, was supposed to buy a little time for Argent as the group worked two new members, John Verity and John Grimaldi, into its lineup in the wake of the departure of co-founder Russ Ballard. As a result, it showcased a band that had already evolved out of the sound represented here, which must have seemed a pity for the fans who bought it. The sound captured on this album combines equal measures of progressive rock and hard-driving pop/rock into a whole that never lost its sight on rock &amp; roll, as on &quot;Thunder and Lightning&quot; and &quot;Music of the Spheres,&quot; or the more traditional sound of &quot;Keep on Rollin'.&quot; With Ballard's guitar and the rhythm section of Jim Rodford (bass) and Bob Henrit (drums), the band could only stray so far from rock, and they and keyboardist Rod Argent, pulling in those opposite directions, ended up creating a scintillating whole on much of this record. Even the extended jams are focused and always maintain some serious forward momentum, though the opener, &quot;The Coming of Kohoutek,&quot; comes dangerously close to fatal digression -- one can only quote Berlioz so far before the piece it's in loses its purpose as rock &amp; roll. The 11-minute jam of &quot;Hold Your Head Up&quot; seemed a little excessive at the time -- a reaction probably caused, in part, by the substandard pressings by which the vinyl version of this release was seemingly universally represented -- but it holds up well today. And the band encored with &quot;Time of the Season,&quot; a selection with which no one could possibly take serious issue -- they dress it up in some heavily ornamented drumming and guitar, but it's the song everyone knows and loves, done about as well as anyone who was not Colin Blunstone could ever handle it. The Collectables CD reissue boasts about the best sound ever heard on this set, and there's some pretty good annotation by Mark Marymount. \n\n\n\n\nAudio-Info:\n\n\n01. The Coming Of Kohoutek\n02. It's Only Money, Pt. 1\n03. It's Only Money, Pt. 2\n04. God Gave Rock And Roll To You\n05. Thunder And Lightning\n06. Music From The Spheres\n07. I Don't Believe In Miracles\n08. I Am The Dance Of The Ages\n09. Keep On Rollin'\n10. Hold Your Head Up\n11. Time Of The Season\n\n\n\n\n\n\n\n\n\n             ****Support The Artists &amp; Buy It If You Like It.****\n\n\n                 ****Enjoy &amp; Please Don't Forget To Seed!****\n\n\n\n\n","torrent":{"xt":"urn:btih:a0ed7b539ae322f00e85d173decb5f98be97c114","amp;dn":"Argent+-+Encore%3A+Live+In+Concert+%281999%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0ed7b539ae322f00e85d173decb5f98be97c114","infoHashBuffer":{"type":"Buffer","data":[160,237,123,83,154,227,34,240,14,133,209,115,222,203,95,152,190,151,193,20]},"announce":[],"urlList":[]}}