{"title":"BF3 Ultimate Utility (for Battlefield 3) iphone.ipad","uid":7020848,"size":14798818,"categoryP":"applications","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:a11dbf4b0abca26908a9f675bf7f1bd166c903b2&amp;dn=BF3+Ultimate+Utility+%28for+Battlefield+3%29+iphone.ipad&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cad40","files":1,"time":1328833288,"description":"Description\nThe Ultimate Utility for BF3 is here! \n\nAre you tired of all the poor quality $.99 game guides that leave you regretting your purchase later? Me too! That's why I started the \nUltimate Utility brand over a year ago! \nSo if you are looking for the best app for BF3, it's time to trade up from your current game guide to the Ultimate Utility brand of apps! \n\n\n\n- FEATURES - \n\nCOMPLETE &amp; IN DEPTH REFERENCE GUIDE: \nGet the most in depth information available about the weapons, specializations, attachments, vehicles, maps, and more! \n\nEXPERT SAMPLE CLASSES\nCheck out sample classes that will help you improve your scores!\n\nUNLOCKABLES CHECKLIST: \nKeep track of everything you have unlocked - including guns and achievements! \n\nPWN BOX (with Friends List): \nLive chat with other gamers! No registration or sign up - just enter a user name and ask your question! There are always people online to talk to! \n\nFRIENDS LIST: \nQuickly and easily send out invites to all your friends in order to organize a team to play online! \n\nMAPS: \nGet overhead images of the map layouts.\n\nADVANCED STATS CALCULATOR: \nThis ain't no simple dividing calculator. Always know your K/D and wins ratio, plus how many more kills/wins you need to improve your ratio! You can also log your past entries to see if you are improving or not. \n\nPLAYERCARD: \nCheck your live, in-game stats in real time right from the app! \n\nHD VIDEOS: \nOver 100 helpful HD videos are already uploaded, with more added each week! There are also 6 customizable channel slots, so you can save your favorite YouTube gaming channels right to the app! \n\nBRAG TO YOUR FRIENDS: \nSend e-mails to your friends with your K/D ratio or the number of achievements/trophies that you have unlocked! \n\nNEWS: \nKeep up to date with the latest news from the community.\n\nUSER POLLS: \nSee what other players think about topics such as what is the best Assault Rifle or most useful specialization. Polls are updated every week! \n\nYou just won't find this level of detail and quality in any other BF3 app! \n\n\nUltimate Utility for BF3 is an unofficial guide designed for use with Battlefield 3. Battlefield 3 is a registered trademark of Electronic Arts, Inc. Brass Monkeigh Apps, LLC is not affiliated with Electronic Arts, Inc. \n\nFor more information about Brass Monkeigh Apps, check out: \n\n\nwww.BrassMonkeigh.com\nWhat's new in Version 1.1\nNEW IN VERSION 1.1\n- Improved weapon statistics\n- Improvements to Let's Play\n- Fixed several typos\n\nMore to come!\n","torrent":{"xt":"urn:btih:a11dbf4b0abca26908a9f675bf7f1bd166c903b2","amp;dn":"BF3+Ultimate+Utility+%28for+Battlefield+3%29+iphone.ipad","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a11dbf4b0abca26908a9f675bf7f1bd166c903b2","infoHashBuffer":{"type":"Buffer","data":[161,29,191,75,10,188,162,105,8,169,246,117,191,127,27,209,102,201,3,178]},"announce":[],"urlList":[]}}