{"title":"The Ringer(2005)DVDRip.AC3(ENG)-DROCK","uid":6659554,"size":733564250,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a20f614ec65b10f34af1ab842b8cd4281f8a3ca8&amp;dn=The+Ringer%282005%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1315465410,"description":"A guy trying to do the right thing ends up taking part in one of the most morally dubious con games in history in this comedy. Steve Barker (Johnny Knoxville) is an office drone who wants to move up the corporate ladder, but when he asks his boss for a promotion, it comes with a condition -- Steve has to fire Stavi (Luis Avalos), who has been the firm's janitor for years. Steve decides to soften the blow by hiring Stavi to do his lawn and garden work. However, an accident robs Stavi of several of his fingers, and since he doesn't have medical insurance, Steve needs to find a way to pay for his surgery. Steve's uncle Gary (Brian Cox), a sleazy type who will bet on anything, also needs some fast cash, and comes up with a get-rich-quick scheme -- Steve was a track star in high school, and with the Special Olympics Championships coming up, all Steve has to do is pretend to be mentally challenged, enter the competition, and win the running events against six-time medalist Jimmy (Leonard Flowers). Gary will bet big on Steve, and the odds will allow them to clean up. Steve is appalled by the idea, but he needs the money badly enough to go along. However, Steve discovers that Jimmy is fast enough that he has little chance of beating him. However, Jimmy's colossal ego has made him many enemies among his fellow Special Olympians, and they're eager enough to see him taken down a peg that they help Steve train for the big event. Matters become all the more complicated when Steve becomes infatuated with Lynn (Katherine Heigl), a beautiful woman who has volunteered to help the challenged athletes, and would doubtless be furious if she found out what Steve was really doing. Produced by Peter Farrelly and Bobby Farrelly, The Ringer was the first fiction directorial credit for Barry W. Blaustein; the story also parallels a 2004 episode of the animated television series South Park, &quot;Up the Down Steroid.&quot; \n\nRipped with Handbrake.\n\nLength: 1 Hour 34 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:a20f614ec65b10f34af1ab842b8cd4281f8a3ca8","amp;dn":"The+Ringer%282005%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a20f614ec65b10f34af1ab842b8cd4281f8a3ca8","infoHashBuffer":{"type":"Buffer","data":[162,15,97,78,198,91,16,243,74,241,171,132,43,140,212,40,31,138,60,168]},"announce":[],"urlList":[]}}