{"title":"The Thin Red Line 1080p [PS3 Compatible]","uid":6531720,"size":14358427780,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:a2371c48a28d654dd2611dd36dacce8254831377&amp;dn=The+Thin+Red+Line+1080p+%5BPS3+Compatible%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DarthPS3","files":22,"time":1310376153,"description":"Terrence Mallick's epic film in 1080p, slightly downgraded in order to play on PS3. The film is broken up into multiple files in order to ensure easy transfer to fat32 drives, and is fully playable on the PS3 system.\n\nComing up next is the final two seasons of Battlestar Galactica.\n\nThank you to everyone that has helped to seed all the files I've uploaded, without you I could not continue to post stuff. I hope that the picks from my collection so far have been satisfactory, and though there have been a few issues along the way I am definitely learning a lot as I go. On the flip side of that, I hope that everyone is enjoying being able to play these files on their PS3's, I know it was always frustrating to me.\n\nAnyways, thanks to all the teams, scenes and other uploaders that have brought so much joy to an otherwise rather painfully dreary existence at a rate that I could actually afford. ;)\n\nAs always, be patient for the initial few days, I am still uploading the last few gigs of my Firefly torrent and then will be doing BSG, but this shouldn't take more than 2-3 days to upload fully from today's date.\n\nFor my other PS3 compatible torrents, just click on my name above, DarthPS3.","torrent":{"xt":"urn:btih:a2371c48a28d654dd2611dd36dacce8254831377","amp;dn":"The+Thin+Red+Line+1080p+%5BPS3+Compatible%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2371c48a28d654dd2611dd36dacce8254831377","infoHashBuffer":{"type":"Buffer","data":[162,55,28,72,162,141,101,77,210,97,29,211,109,172,206,130,84,131,19,119]},"announce":[],"urlList":[]}}