{"title":"Pushpak [1987]","uid":6660661,"size":734932641,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a2bf8ebcc679c8efb503b6e26faca679993930f7&amp;dn=Pushpak+%5B1987%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dudeshubhu","files":1,"time":1315501036,"description":"PLOT\n\nThe film follows an unnamed, almost penniless and unemployed youth (played by Kamal Haasan) whose fortunes change when he stumbles upon a drunk millionaire by the roadside. He takes the millionaire prisoner in his house and assumes his identity to taste the luxury of a five-star hotel (actually shot at Windsor Manor Hotel, Bangalore). In the process, he falls in love with a magician's daughter (Amala). He uses his false identity to enjoy a romantic day with her. Meanwhile, a contract killer is sent after the millionaire who engages in repeated failed attempts to kill Kamal with knives made of ice. Finally, after seeing the millionaire's wife lamenting her missing husband and witnessing other incidents that show him a different perspective on life, Kamal decides to give up his new-found luxury.\n\nIn the much-acclaimed ending, Kamal frees the millionaire and confesses everything to the magician's daughter. She tells him that she still likes him and throws at him a flower and a note (presumably her contact details) from a car. However, a gush of wind blows the note and the rose down a sewage drain, implying the two never unite.And Kamal once again stand in the que for job search.\n\nSCREENSHOTS\n\nClick the image to open in full size.\nClick the image to open in full size.\nClick the image to open in full size.\nClick the image to open in full size.\nClick the image to open in full size.\nClick the image to open in full size.\nClick the image to open in full size. ","torrent":{"xt":"urn:btih:a2bf8ebcc679c8efb503b6e26faca679993930f7","amp;dn":"Pushpak+%5B1987%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2bf8ebcc679c8efb503b6e26faca679993930f7","infoHashBuffer":{"type":"Buffer","data":[162,191,142,188,198,121,200,239,181,3,182,226,111,172,166,121,153,57,48,247]},"announce":[],"urlList":[]}}