{"title":"Deus Ex - Human Revolution (Nordic Edition) [CLONE-DVD]","uid":6631064,"size":7640187584,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a2dcc0cef06c70d2c0c99b4b6c2c8d9070551cb4&amp;dn=Deus+Ex+-+Human+Revolution+%28Nordic+Edition%29+%5BCLONE-DVD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"artylon2","files":-1,"time":1314371591,"description":"STORY\n================================================================================\nYou play Adam Jensen, an ex-SWAT specialist who\\\\\\'s been handpicked to oversee the defensive needs of one of America\\\\\\'s most experimental biotechnology firms. Your job is to safeguard company secrets, but when a black ops team breaks in and kills the very scientists you were hired to protect, everything you thought you knew about your job changes\n\nBadly wounded during the attack, you have no choice but to become mechanically augmented and you soon find yourself chasing down leads all over the world, never knowing who you can trust. At a time when scientific advancements are turning athletes, soldiers and spies into super enhanced beings, someone is working very hard to ensure mankind\\\\\\'s evolution follows a particular path.\n\nYou need to discover where that path lies. Because when all is said and done, the decisions you take, and the choices you make, will be the only things that can change it.\n\n\n\n\n\nFEATURES\n================================================================================\nA divided near-future: discover a time of great technological advancement, but also a time of chaos and conspiracy. Mechanical augmentations of the human body have divided society between those who can afford them, and those who can\\\\\\'t. Opposing forces conspire from the shadow to control the destiny of mankind: a human revolution is coming.\n\nA perfect mix of action and role-play: the game uniquely combines action-packed close-quarter takedowns with intense shooting, offering a vast array of character augmentations and upgrades for the many weapons at your disposal. Unlock new abilities and increase your stealth, social, hacking or combat skills: the game rewards all styles of play and approaches. Determine how you want your character to evolve, based on how you want to play the game.\n\nChoices and consequences: shoot your way through your enemies, sneak up behind them without being traced, hack systems to retrieve crucial information, or use your social skills to extract information from key characters - there are always choices, multiple approaches, multiple paths and multiple tools at your disposal. Choose your playing style and face the consequences of your actions: you decide how the story unfolds.\n\n\n\nSYSTEM REQUIREMENTS\n================================================================================\nMinimum:\n\n    OS: Windows XP, Windows Vista or Windows 7\n    Processor: 2 GHz dual core\n    Memory: 1 GB RAM (Windows XP) / 2 GB (Windows Vista and Windows 7)\n    Graphics: NVIDIA GeForce 8000 series or ATI Radeon HD 2000 series or better\n    DirectXÃ‚Â®: DirectX 9.0c\n    Hard Drive: 8.5 GB\n\n\t\n\nRecommended:\n\n    OS: Windows 7\n    Processor: AMD Phenom II X4 or Intel Core 2 Quad or better\n    Memory: 2 GB\n    Graphics: AMD Radeon HD 5850\n    DirectXÃ‚Â®: DirectX 9.0c\n    Hard Drive: 8.5 GB\n\n================================================================================\n             THIS IS A CLONED DVD AND IT CONTAINS NO CRACK...\n================================================================================","torrent":{"xt":"urn:btih:a2dcc0cef06c70d2c0c99b4b6c2c8d9070551cb4","amp;dn":"Deus+Ex+-+Human+Revolution+%28Nordic+Edition%29+%5BCLONE-DVD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2dcc0cef06c70d2c0c99b4b6c2c8d9070551cb4","infoHashBuffer":{"type":"Buffer","data":[162,220,192,206,240,108,112,210,192,201,155,75,108,44,141,144,112,85,28,180]},"announce":[],"urlList":[]}}