{"title":"The Economist Audio Edition July 02-08 2011","uid":6512538,"size":159684100,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a38697b09d7fda4238947e6c6cef9a900de6c44a&amp;dn=The+Economist+Audio+Edition+July+02-08+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jjbuelvas","files":1,"time":1309693854,"description":"I decided to put it on here since nobody else had so far\n\nfrom wikipedia:\n\n\nThe Economist is an English-language weekly news and international affairs publication owned by The Economist Newspaper Ltd. and edited in offices in the City of Westminster, London, England.[1][2] Continuous publication began under founder James Wilson in September 1843. While The Economist refers to itself as a newspaper, each print edition appears on glossy paper, like a news magazine. In 2009, it reported an average circulation of just over 1.6 million copies per issue,[3] above half of which are sold in North America and English speaking countries.[4]\nThe Economist claims it &quot;is not a chronicle of economics.&quot;[5] Rather, it aims &quot;to take part in a severe contest between intelligence, which presses forward, and an unworthy, timid ignorance obstructing our progress.&quot;[6] It takes an editorial stance which is supportive of free trade and globalisation, along with the expansion of government health and education spending, as well as other, more limited forms of governmental intervention. It targets highly educated readers and claims an audience containing many influential executives and policy-makers.[7]\n","torrent":{"xt":"urn:btih:a38697b09d7fda4238947e6c6cef9a900de6c44a","amp;dn":"The+Economist+Audio+Edition+July+02-08+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a38697b09d7fda4238947e6c6cef9a900de6c44a","infoHashBuffer":{"type":"Buffer","data":[163,134,151,176,157,127,218,66,56,148,126,108,108,239,154,144,13,230,196,74]},"announce":[],"urlList":[]}}