{"title":"Vilse.I.Pannkakan.[1975].DvdRip.XviD-KnÃƒÂ£.avi","uid":6647070,"size":1835044864,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a469c3f7f55c4006aa3cfeba4bb0fe85f52db993&amp;dn=Vilse.I.Pannkakan.%5B1975%5D.DvdRip.XviD-Kn%C3%83%C2%A3.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Jon.Pson","files":10,"time":1314987109,"description":"Vilse i pannkakan may have been loved by some, and these days the show has something of a cult following. However, bring it up in conversation (apropos the 2007 DVD release, for example) and chances are you'll be met with frightened grimaces and squeaks of unease.\n\nTo many 70s kids, including this one, Westerberg's low-low-budget puppet show, was pervaded with a sense of unease and almost dread. The &quot;Big potato&quot; was a domineering and frightening figure with a monstrous wooden head who might appear at any time (sometimes in a painting behind the main protagonist). Feared by all, loved by none, StorpotÃƒÂ¤ten is the stuff that childhood nightmares are made of.\n\nThe pancake world itself is rather depressing, with a raggedy figure desperately trying to fix a boat by a dried out pond, mouse kids watched by a skeleton and rats with names like Lucifer.\n\nOn top of that, the two-dimensional parents might pop up at any time, scorning the kid who was supposed to eat the magical - and increasingly dusty - pancake.\n\nFinally, it was pretty boring. Westerberg had two modes: unease and dullness. Songs went on forever, &quot;funny&quot; phrases were repeated ad nauseam and you never really had the feeling that the show was going anywhere.\n\nDo check it out for reasons of nostalgia and / or curiosity but think twice before exposing your own kids to the pancake world.","torrent":{"xt":"urn:btih:a469c3f7f55c4006aa3cfeba4bb0fe85f52db993","amp;dn":"Vilse.I.Pannkakan.%5B1975%5D.DvdRip.XviD-Kn%C3%83%C2%A3.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a469c3f7f55c4006aa3cfeba4bb0fe85f52db993","infoHashBuffer":{"type":"Buffer","data":[164,105,195,247,245,92,64,6,170,60,254,186,75,176,254,133,245,45,185,147]},"announce":[],"urlList":[]}}