{"title":"The Public Enemy (1931) FULL DVD (ISO)","uid":7026160,"size":4435935232,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a4e699f148875acfe77aa40205fc336165306bcb&amp;dn=The+Public+Enemy+%281931%29+FULL+DVD+%28ISO%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Auge","files":-1,"time":1329010043,"description":"I am providing important films in ISO for the film buff or novice film historian. It is nearly impossible to find torrent files that include all the extras or even important commentaries. These files are from my collection of DVDs that I have made from rented movies over the last seven years or so. Nearly all of them have been put onto a DVD5, so unfortunately I do not have an uncompressed source handy.  That said I can assure you that these look GREAT on larger screens. I chose to make them this size for economy as DVD9s were $3 each when I started this and DVD5s were .25 cents each. Now I am working on putting some of the best ones on a hard drive to be played with my HD TV Media Player and am still thinking economy is the best rule as these are half the size of ripping a DVD9. This is the best quality for the value.\n\nLook for my other torrents of full DVDs . . . I would love some productive feedback.\n\n\nThis is a DVD rip to an ISO so you can watch it on your media player, mount it to a virtual drive or burn it to a DVD.\n\nThis file includes EVERYTHING the original DVD has:\n\n1931\n83 minutes\nBlack and White\n1.37:1\nSpoken Language: English\nSubtitles: English, French, Spanish \n\nAwards\nAcademy Award - Best Writing nominee \n\n*Commentary by Robert Sklar\n*Warner Night at the Movies\n*Beer and Blood: Enemies of the Public\n*1954 Rerelease Forward\n*Theatrical Trailer\n\nSYNOPSIS:  \nCrime doesnt pay, as James Cagney learns in this vintage Warner Brothers gangster movie thats become a much-imitated classic of the genre. Cagney plays hot-headed Tom Powers, whos on the fast track running illegal hooch during Prohibition. Directed by William A. Wellman, the film is famous for its scene where a ticked-off Cagney smashes his breakfast grapefruit in Mae Clarkes face. Jean Harlow and Joan Blondell co-star.\n","torrent":{"xt":"urn:btih:a4e699f148875acfe77aa40205fc336165306bcb","amp;dn":"The+Public+Enemy+%281931%29+FULL+DVD+%28ISO%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4e699f148875acfe77aa40205fc336165306bcb","infoHashBuffer":{"type":"Buffer","data":[164,230,153,241,72,135,90,207,231,122,164,2,5,252,51,97,101,48,107,203]},"announce":[],"urlList":[]}}