{"title":"Kinks - Picture Book - 6CD-BOX 2008","uid":6523658,"size":2914688559,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a5fec3e6b21b1bfe8c4f25ecf9cda097da405617&amp;dn=Kinks+-+Picture+Book+-+6CD-BOX+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"barber9","files":-1,"time":1310082555,"description":"The Kinks were an English rock band formed in Muswell Hill, North London, by brothers Ray and Dave Davies in 1964. Categorized in the United States as a British Invasion band, The Kinks are recognized as one of the most important and influential rock acts of the era. Their music was influenced by a wide range of genres, including rhythm and blues, British music hall, folk, and country. Ray Davies (lead vocals, rhythm guitar) and Dave Davies (lead guitar, vocals) remained members throughout the group's 32-year run. Original members Pete Quaife (bass guitar, vocals) and Mick Avory (drums and percussion) were replaced by John Dalton in 1969 and Bob Henrit in 1984, respectively. Dalton was in turn replaced by Jim Rodford in 1978. Keyboardist Nicky Hopkins accompanied the band during studio sessions in the mid-1960s. Later, various keyboardists, including John Gosling and Ian Gibbons, were full-time members.\n\nThe Kinks first came to prominence in 1964 with their third single, You Really Got Me, written by Ray Davies. It became an international hit, topping the charts in the United Kingdom and reaching the Top 10 in the United States. Between the mid-1960s and early 1970s, the group released a string of commercially and critically successful singles and LPs, and gained a reputation for songs and concept albums reflecting English culture and lifestyle, fuelled by Ray Davies' observational writing style. Albums such as Face to Face, Something Else, The Kinks Are the Village Green Preservation Society, Arthur, Lola Versus Powerman and the Moneygoround, and Muswell Hillbillies, along with their accompanying singles, are considered among the most influential recordings of the period. The Kinks' subsequent theatrical concept albums met with less success, but the band experienced a revival during the late 1970s and early 1980s, groups such as Van Halen, The Jam, The Knack, and The Pretenders covered their songs, helping to boost The Kinks' record sales. In the 1990s, Britpop acts such as Blur and Oasis cited the band as a major influence. The Kinks broke up in 1996, a result of the commercial failures of their last few albums and creative tension between the Davies brothers.\n\nThe Kinks had five Top 10 singles on the US Billboard chart. Nine of their albums charted in the Top 40. In the UK, the group had seventeen Top 20 singles and five Top 10 albums. Four of their albums have been certified gold by the RIAA. Among numerous honours, they received the Ivor Novello Award for Outstanding Service to British Music. In 1990, their first year of eligibility, the original four members of The Kinks were inducted into the Rock &amp; Roll Hall of Fame, as well as the UK Music Hall of Fame in November 2005.\n\n- - -\n\nThe Kinks are recognized as one of the most important and influential rock acts of the 1960s. Stephen Thomas Erlewine called The Kinks one of the most influential bands of the British Invasion, and the Rock and Roll Hall of Fame website states that Ray Davies is almost indisputably rock's most literate, witty and insightful songwriter. Artists influenced by The Kinks include punk rock groups such as the Ramones, The Clash, and The Jam, New Wave and heavy metal acts like The Pretenders and Van Halen, and Britpop groups such as Oasis, Blur, and Pulp. Pete Townshend, guitarist with The Kinks' contemporaries The Who, was particularly influenced by the group's sound: The Kinks were quintessentially English. I always think that Ray Davies should one day be poet laureate. He invented a new kind of poetry and a new kind of language for pop writing that influenced me from the very, very, very beginning. Jon Savage wrote that The Kinks were an influence on late-1960s American psychedelic groups, like the Doors, Love and Jefferson Airplane. Musicologist Joe Harrington has described The Kinks' influence on the development of hard rock and heavy metal: You Really Got Me, All Day and All of the Night and I Need You were predecessors of the whole three-chord genre, the Kinks did a lot to help turn rock 'n' roll (Jerry Lee Lewis) into rock (Led Zeppelin, Black Sabbath, the Stooges).  (wikipedia)\n\n- - -\n\n2008 digitally remastered six CD set, the first ever Kinks box set, chronicling the band's 40 year career over six chronologically-ordered CDs. Each disc deals with a particular chapter in the band's history, from their 1964 breakthrough onwards. Picture Book features well over a hundred tracks - a third of which are previously unreleased or new to CD. These include rare demos, mono versions, alternate mixes, archived BBC Television &amp; session material and live renditions alongside the classic originals. This collection spans the band's entire career from their early '60s beginning right up through their final studio album in 1994. \n\n- - -\n\nKinks - Picture Book 1963-1995\n(London Universal Music Operations)\n\nCD 1\n\n 1. Brian Matthew Introduces The Kinks\n 2. You Really Got Me\n 3. I'm A Hog For You Baby\n 4. I Believed You\n 5. Long Tall Sally\n 6. I Don't Need You Anymore\n 7. Stop Your Sobbing\n 8. I Gotta Move\n 9. Don't Ever Let Me Go (demo)\n10. All Day And All Of The Night\n11. Tired Of Waiting For You\n12. Come On Now Outake\n13. There Is A New World Opening For Me (Kassner Publishing demo)\n14. Everybody's Gonna Be Happy\n15. Who'll Be The Next In Line (demo)\n16. Time Will Tell\n17. Set Me Free\n18. I Need You\n19. See My Friend\n20. Wait Till The Summer Comes Along\n21. I Go To Sleep\n22. Little Bit Of Sunlight (Kassner Publishing demo)\n23. This I Know Demo\n24. Well Respected Man\n25. This Strange Effect\n26. Milk Cow Blue\n27. Ring The Bells\n28. I'm On An Island\n29. Til The End Of The Day\n30. Where Have All The Good Times Gone\n31. All Night Stand (demo)\n32. And I Will Love You\n33. Sittin' On My Sofa\n\nCD 2\n\n 1. Dedicated Follower Of Fashion (alternate stereo take)\n 2. She's Got Everything\n 3. Mr Reporter (Ray vocal)\n 4. Sunny Afternoon\n 5. I'm Not Like Everybody Else\n 6. This Is Where I Belong\n 7. Rosie Won't You Please Come Home\n 8. Too Much On My Mind\n 9. Session Man\n10. End Of The Season\n11. Dead End Street (alternate version early 1966)\n12. Village Green\n13. Two Sisters\n14. David Watts\n15. Mr Pleasant\n16. Waterloo Sunset (mono mix)\n17. Death Of A Clown\n18. Lavender Hill\n19. Good Luck Charm (BBC radio recording)\n20. Autumn Almana\n21. Susannah's Still Alive\n22. Animal Fa\n23. Rosemary Rose\n24. Berkeley Mews\n25. Lincoln County\n26. Picture Book\n27. Days\n28. Misty Water\n\nCD 3\n\n 1. Love Me Til The Sun Shines\n 2. Village Green Preservation Society\n 3. Big Sky\n 4. King Kong\n 5. Drivin\n 6. Some Mother's Son\n 7. Victoria \n 8. Shangri La\n 9. Arthur\n10. Got To Be Free\n11. Lola (mono single version)\n12. Get Back In The Line\n13. Moneygoround\n14. Strangers\n15. Apeman\n16. God's Children\n17. Way Love Used To Be\n18. Moments\n19. Muswell Hillbilly\n20. Oklahoma USA\n21. Twentieth Century Man\n22. Here Come The People In Grey\n\nCD 4\n\n 1. Skin And Bone\n 2. Alcohol (live)\n 3. Celluloid Heroes\n 4. Sitting In My Hotel\n 5. Supersonic Rocket Ship\n 6. You Don't Know My Name\n 7. One Of The Survivors\n 8. Sitting In The Midday Sun\n 9. Sweet Lady Geneviev\n10. Dayligh\n11. Mirror Of Love\n12. Artificial Man\n13. Preservation (US single)\n14. Slum Kids (live)\n15. Holiday Romance\n16. Face In The Crowd\n17. No More Looking Back\n18. Sleepwalker\n19. Poseur\n\nCD 5\n\n 1. Sleepless Night\n 2. Father Christma\n 3. Misfits\n 4. Rock 'N Roll Fantasy\n 5. Little Bit Of Emotion\n 6. Attitude\n 7. Hidden Quality\n 8. Gallon Of Ga\n 9. Catch Me Now I'm Falling\n10. Nuclear Love\n11. Duke\n12. Maybe I Love You\n13. Stolen Away Your Heart\n14. Low Budget\n15. Better Things\n16. Destroyer\n17. Yo Yo\n18. Art Lover\n19. Long Distance\n\nCD 6\n\n 1. Heart Of Gold\n 2. Come Dancing Demo Remix\n 3. State Of Confusion\n 4. Do It Again\n 5. Living On A Thin Line\n 6. Summer's Gone Extended Mix\n 7. How Are You\n 8. Road\n 9. Million Pound Semi Detache\n10. Down All The Days (To 1992)\n11. Informer\n12. Phobia\n13. Only A Dream\n14. Drift Away\n15. Scattered\n16. Do You Remember Walter\n17. To The Bone Demo\n","torrent":{"xt":"urn:btih:a5fec3e6b21b1bfe8c4f25ecf9cda097da405617","amp;dn":"Kinks+-+Picture+Book+-+6CD-BOX+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5fec3e6b21b1bfe8c4f25ecf9cda097da405617","infoHashBuffer":{"type":"Buffer","data":[165,254,195,230,178,27,27,254,140,79,37,236,249,205,160,151,218,64,86,23]},"announce":[],"urlList":[]}}