{"title":"The Skin of Our Teeth (TV) [1983] Blair Brown","uid":6519844,"size":733986212,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a638c40bab466a28fd1148f45c32b803e1db125e&amp;dn=The+Skin+of+Our+Teeth+%28TV%29+%5B1983%5D+Blair+Brown&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"ThorntonWilde","files":-1,"time":1309952050,"description":" &lt;a href=&quot;http://bayimg.com/haIoFAadp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/haIoFAadp&lt;/a&gt;\n\nThe Skin of Our Teeth (TV 1983)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0217052/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0217052/&lt;/a&gt;\n\nThe Skin of Our Teeth is a play by Thornton Wilder which won the Pulitzer Prize for Drama. It opened on October 15, 1942 at the Shubert Theatre in New Haven, Connecticut, before moving to the Plymouth Theatre on Broadway on November 18, 1942. It was produced by Michael Myerberg and directed by Elia Kazan.\n\n  Diana Bellamy  ...  Miss E. Muse / Ivy  \n  Renee Brooks  ...  Miss M. Muse / Showgirl  \n  Blair Brown  ...  Sabina  \n  Bonnie Campbell-Britton  ...  Miss T. Muse / Audio Person  \n  Jeffrey Combs  ...  Henry Antrobus  \n  James Coyle  ...  Conveener  \n  Gary Dontzig  ...  Telegraph Boy / Conveener  \n  Larry Drake  ...  Homer / Conveener  \n  John Eames  ...  Conveener / Fred Bailey  \n  Monique Fowler  ...  Gladys Antrobus  \n  Bill Geisslinger  ...  Doctor / Broadcaster  \n  Harold Gould  ...  Mr. Antrobus  \n  Susan Hegarty  ...  Showgirl  \n  John Houseman  ...  Network Newscaster  \n  Tom Lacy  ...  Newsreel Announcer  \n\nThe leading role of Sabina was originated by Tallulah Bankhead; when she left the production in March 1943, she was replaced by Miriam Hopkins. Hopkins was in turn replaced by Gladys George. For two performances, while George was ill, Lizabeth Scott, who had been Bankhead's understudy, was called in to play the role. Scott then played the role for the production's run in Boston, MA. Originally billed in New York as &quot;Elizabeth Scott&quot;, she dropped the &quot;E&quot; before taking the part in Boston, and it became her breakthrough role.\n\nThe cast of the Old Globe Theater's acclaimed early-'80s revival of Thornton Wilder's Pulitzer Prize-winning classic reunited to re-create their roles for this made-for-TV production, taped for PBS's anthology series American Playhouse. The Skin of Our Teeth follows the often funny and occasionally tragic circumstances of the Antrobus family, who have learned to persevere and even thrive through any number of natural and personal crises, including war, flood, disease, and even a plague of locusts. The distinguished cast of The Skin of Our Teeth includes Blair Brown, Rue McClanahan, Harold Gould, Sada Thompson, Larry Drake, and John Houseman. \n\nWilder was influenced by James Joyce's Finnegans Wake, as many modernist novelists and playwrights were. However, critics charged that The Skin of Our Teeth was little more than an Americanized version of Joyce's work, citing specific examples and intimating that the play was in some way plagiarized. In a letter to The Saturday Review of Literature (which he never sent), Wilder defended his play, saying that his play &quot;moved into its own independent existence through its insistence on being theatre...&quot; Early on in the writing of the play, he said it &quot;fixed its thoughts on the War and the situation of the eternal family under successive catastrophes.&quot;\n\nThough Wilder still won the Pulitzer Prize, Paula Vogel postulates that Wilder may have missed his chance of winning the Nobel Prize due to the accusations and implications that plagiarism or borrowed material may have been at the core of this great work.\n\nDisrupting traditional notions of linear time, Wilder's play tells the story of the twentieth-century American Antrobus family in three acts which recount such epochal events as the onset of the Ice Age, the start of Great Flood, and the end of the Napoleonic Wars. Ending exactly as it began, the play illustrates the cyclical nature of existence, celebrating humanity's resilience, inventiveness, and will to survive. Although the play offers an age-old message, it does so in an untraditional form, rejecting the conventions of naturalistic drama. Not only do the characters appear to be both middle-class Americans and allegorical figures, but they also repeatedly drop out of character and speak directly to the audience, breaking theatrical illusion and reminding viewers that they are watching a play. Combining modern theatrical experiments and timeless human themes, Wilder produced a work that would both challenge and entertain generations of Americans. Along with Our Town (1938), The Skin of Our Teeth is considered Wilder's theatrical masterpiece and an invaluable cornerstone of modern American drama.\n\n","torrent":{"xt":"urn:btih:a638c40bab466a28fd1148f45c32b803e1db125e","amp;dn":"The+Skin+of+Our+Teeth+%28TV%29+%5B1983%5D+Blair+Brown","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a638c40bab466a28fd1148f45c32b803e1db125e","infoHashBuffer":{"type":"Buffer","data":[166,56,196,11,171,70,106,40,253,17,72,244,92,50,184,3,225,219,18,94]},"announce":[],"urlList":[]}}