{"title":"RailWorks - GR Class 143","uid":6563687,"size":16546876,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a864c7d3dd92429fd7d7f15d91378de2064ee6f6&amp;dn=RailWorks+-+GR+Class+143&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MSFLIGHT","files":-1,"time":1311584839,"description":"The Class 143 (originally listed on introduction by the Deutsche Reichsbahn as Class 243) is a general purpose electric locomotive. With over 600 having been produced, the Class 143 is one of the most popular and universal of German electric locomotives.\n\nDesigned and built by VEB Lokomotivbau und Elektrotechnische Werke Hennigsdorf, and introduced in the former East Germany in 1985 by the Deutsche Reichsbahn, the 143/243 had a maximum running speed of 120km/h (75mph) to comply with the maximum line speed across the network. Following the reunification of Germany, the type was used across the former West Germany and designated the Class 143. The 143 operated on many routes including the Schwarzwaldbahn, the HÃƒÂ¶llentalbahn and the Rhein-Ruhr S-Bahn. A number of examples were also retained for use in measuring and experimental operations.\n\nThe Class 112 is a subclass of the 143, based on the same prototype but with a higher running speed of 160km/h (100mph) to take advantage of the upgraded lines to Berlin introduced following German reunification. Production was taken over at this time by AEG GmbH. Their higher speed made them ideal for use on long-distance InterRegio trains.","torrent":{"xt":"urn:btih:a864c7d3dd92429fd7d7f15d91378de2064ee6f6","amp;dn":"RailWorks+-+GR+Class+143","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a864c7d3dd92429fd7d7f15d91378de2064ee6f6","infoHashBuffer":{"type":"Buffer","data":[168,100,199,211,221,146,66,159,215,215,241,93,145,55,141,226,6,78,230,246]},"announce":[],"urlList":[]}}