{"title":"Clinical Pharmacology - Current Topics and Case Studies{BBS}","uid":6656947,"size":47811625,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a8d4d038d73369ea2b163446d9488a427ca86849&amp;dn=Clinical+Pharmacology+-+Current+Topics+and+Case+Studies%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315355852,"description":"Today we witness an eventful time in which the powerful new forces of genomics, information technology and economics are rapidly changing the science and art of medicine. This will require more specialization than ever before. However, there is also an increasing demand for an integrated approach, which is provided by the discipline of Clinical Pharmacology (CP). CP pursues a scientific goal by studying drug action in patients and volunteers, a clinical goal by administering appropriate drug therapy and a regulatory goal by assessing the risk/benefit ratio of drug candidates in drug development and reimbursement. This introduction to current topics of CP covers traditional topics of clinical drug research and trial methodology but also provides insight in current topics like genomics, imaging technology and issues in drug reimbursement. A number of concrete case studies in clinical drug research and development help to give a better understanding of the general principles of CP.\nAbout the Author\nMarkus MÃƒÂ¼ller, MD, born August 23, 1967 is a board certified specialist in Internal Medicine and Clinical Pharmacology. He has been trained in Austria, Sweden and the US and currently serves as tenured, full Professor and Head of the Department of Clinical Pharmacology of the Vienna Medical University at the Vienna General Hospital (AKH). He is responsible for ~ 80 staff members. The Department is specialized on clinical research in a wide variety of therapeutic areas and on the development of novel drugs in close collaboration with the pharmaceutical industry. Prof MÃƒÂ¼ller serves on numerous national and international boards (e.g. council member of the European Association for Clinical Pharmacology and Therapeutics; Chairman of the Pharmacological Expert Committee, Association of Austrian Social Insurance Institutions; European Expert, European Medicines Agency (EMEA), London, UK; adjunct faculty member University of Florida, USA). He has also served as chairman of an FDA workshop and is a delegate of the Standing Committee of the European Medical Research Council. Prof. MÃƒÂ¼ller is (Co) Inventor of 2 patents and has received several awards, e.g. the 2004 Tanabe Award of the American College of Clinical Pharmacology (ACCP) in acknowledgement of innovations in clinical pharmacology trials. He is deputy editor of the International Journal of Clinical Pharmacology and Therapeutics and reviewer for numerous scientific journals. He has published &gt; 170 peer reviewed articles, e.g. in the New England Journal of Medicine, Nature Medicine or the British Medical Journal. \n\n\n\n\n\n# Hardcover: 454 pages\n# Publisher: Springer; 1st Edition. edition (30 July 2010)\n# Language English\n# ISBN-10: 3709101433\n# ISBN-13: 978-3709101438","torrent":{"xt":"urn:btih:a8d4d038d73369ea2b163446d9488a427ca86849","amp;dn":"Clinical+Pharmacology+-+Current+Topics+and+Case+Studies%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8d4d038d73369ea2b163446d9488a427ca86849","infoHashBuffer":{"type":"Buffer","data":[168,212,208,56,215,51,105,234,43,22,52,70,217,72,138,66,124,168,104,73]},"announce":[],"urlList":[]}}