{"title":"Democracy Now - 08 jul 2011","uid":6525520,"size":447664214,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a95343213ac0237574fde16ca3de283ceec65d40&amp;dn=Democracy+Now+-+08+jul+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1310145162,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jul 08, 2011\n\n- Obama, Congressional Leaders Hold &quot;Constructive&quot; Debt Talks\n- Sen. Sanders: Hands Off Social Security in Debt Talks\n- Texas Executes Mexican National Despite Denial of Consular Rights\n- EPA to Probe Air Quality Near Exxon Mobil Spill\n- Afghans Protest Deadly U.S.-Led Air Strike\n- Congress Threatens Palestinians With Aid Cutoff Over Statehood Bid\n- Israel Approves New West Bank Settlement Expansion\n- Israel Prepares to Block Entry of Palestinian Solidarity Activists in &quot;Flytilla&quot;\n- Saleh Makes Public Appearance; UN Warns of Yemen Crisis\n- HRW Criticizes U.S.-Backed Bahraini Crackdown\n- U.S. Returns Small Number of Stolen Iraqi Artifacts\n- Mass Grave Discovered in Iraq\n- Appeals Court Challenges FCC's Easing of Media Ownership Rule\n- Immigrant, Women's Advocates: Don't Abandon DSK Accuser\n- Gunman Kills 7 in Michigan Before Taking Own Life\n- Workers File New Suit Against Wisconsin Anti-Union Law; Prison Labor Could Replace Public Employees\n\n\nSpecial reports\n\n- Media Mogul Rupert Murdoch Shuts Down Flagship UK Newspaper Amidst Scandal Over Illegal Surveillance\n\nRupert Murdoch's media empire is engulfed in a growing scandal after new evidence emerged that his reporters in Britain paid corrupt police officers for story tips and hacked the voicemails of thousands of people, from child murder victims to the families of Britain's war dead. On Thursday, Murdoch shocked the country by shutting down the newspaper at the center of the scandal - the News of the World - Britain's biggest-selling Sunday newspaper. Founded in 1843, the tabloid's final edition will be this weekend. Earlier today, one former reporter for the paper, Andy Coulson, was arrested on corruption and phone hacking charges. Until January, Coulson served as British Prime Minister David Cameron's director of communications. Meanwhile, Murdoch is attempting to pull off a $12 billion takeover of the television network, British Sky Broadcasting. But today, Britain's culture secretary announced its decision on the Sky deal will be delayed because of the ongoing scandal. We speak to Ryan Chittum, who has been writing about the scandal for the Columbia Journalism Review.\n\n\n- Victory for Media Diversity: Court Strikes Down FCC's Attempt to Relax Media Ownership Rules\n\nA federal appeals court has overturned part of a Federal Communications Commission rule that made it easier for a single company, like Rupert Murdoch's News Corp, to own a newspaper and a broadcast outlet in a single market. The ruling marks the second time the appeals court has intervened in the commission's attempts to relax media ownership rules. We speak with Brandy Doyle, policy director for the Prometheus Radio Project, the organization that filed lawsuit, Prometheus v FCC. &quot;Media consolidation has a particularly terrible impact on ownership by those who are historically disenfranchised in the media system like women, people of color, workers, the poor, anyone whose voice is not already represented in our media,&quot; says Doyle.\n\n\n- Egyptians Fill Tahrir Square For Largest Protest Since Fall of President Mubarak\n\nHundreds of thousands of Egyptians have gathered in Cairo's Tahrir Square for what could be the largest demonstration since the uprising that topped former president, Hosni Mubarak. They say there has been little progress on reforms promised in the five months since the uprising. In Suez on Monday, riots were sparked by a court order to release seven policemen charged with killing demonstrators. On Tuesday, the courts acquitted three former government ministers over corruption allegations. We get a live update from Democracy Now! correspondent Sharif Abdel Kouddous in Tahrir Square. &quot;There is a sense the revolution is being stolen from beneath people's feet here,&quot; says Kouddous.\n\n\n- As Debt Talks Threaten Medicare, Social Security, Study Finds U.S. Spending $4 Trillion on War\n\nAs part of ongoing debt negotiations, the White House has proposed slashing more than $4 trillion from annual budget deficits over the next decade - twice what Obama had proposed earlier. While much of the talk in Washington centers on taxes, Social Security and Medicare, far less attention is being paid to the growing cost of the U.S. wars overseas. A new report from Brown University has estimated the true cost of the U.S. wars in Iraq, Afghanistan and Pakistan will end up costing approximately $4 trillion - far more than the Bush or Obama administrations have acknowledged. The authors of the study reveal that because the war has been financed almost entirely by borrowing, $185 billion in interest has already been paid on war spending, and another $1 trillion could accrue in interest alone through 2020. We speak with Neta Crawford, co-director of the Costs of War Project, and a Professor of Political Science at Boston University.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:a95343213ac0237574fde16ca3de283ceec65d40","amp;dn":"Democracy+Now+-+08+jul+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a95343213ac0237574fde16ca3de283ceec65d40","infoHashBuffer":{"type":"Buffer","data":[169,83,67,33,58,192,35,117,116,253,225,108,163,222,40,60,238,198,93,64]},"announce":[],"urlList":[]}}