{"title":"Don Mendo Rock La venganza (2010) [DVDR9][PAL][Spanish]","uid":6522938,"size":5987516416,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a9c5838a5a933f4890a649bc5971c29bc09f3887&amp;dn=Don+Mendo+Rock+La+venganza+%282010%29+%5BDVDR9%5D%5BPAL%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":14,"time":1310057345,"description":"Don Mendo Rock Ã‚Â¿La venganza? (2010) [DVDR9][PAL][Spanish]\n &lt;a href=&quot;\nhttp://www.donmendorock.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.donmendorock.com/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1666767/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1666767/&lt;/a&gt;\n\nEspaÃƒÂ±ol:\n--------\nCalidad: DVD9=&gt;DVD9\nAudio: Castellano\nSubtitulos: NO\nRegion: PAL\nVersion Alquiler\n\nTÃƒÂ­tulo: Don Mendo Rock Ã‚Â¿La venganza?\nTÃƒÂ­tulo original: Don Mendo Rock Ã‚Â¿La venganza?\nGenero: Comedia\nDuracion: 105 Min\nPaÃƒÂ­s: EspaÃƒÂ±a \nEstreno en USA: \nEstreno en EspaÃƒÂ±a: 17/12/2010 \nLanzamiento en DVD (alquiler): 23/06/2011 \nEstreno en DVD (venta): 27/07/2011 \nProductora: JosÃƒÂ© Frade PC \nDirector: Jose Luis GarcÃƒÂ­a SÃƒÂ¡nchez \nGuiÃƒÂ³n: Jose Luis GarcÃƒÂ­a SÃƒÂ¡nchez, JosÃƒÂ© Luis Alonso de Santos &amp; Kiko Veneno \nReparto: Paz Vega, Fele MartÃƒÂ­nez, Antonio Resines, MarÃƒÂ­a Barranco, Juanjo CucalÃƒÂ³n, Elena Furiase, Manuel Bandera\nCalifiaciÃƒÂ³n: Apta para todos los pÃƒÂºblicos\n\n\nSinopsis:\nInÃƒÂ©s (MarÃƒÂ­a Barranco), una asistenta social ingenua y voluntariosa, llega a un pueblo andaluz con la misiÃƒÂ³n de llevar a cabo una actividad bastante especial: ayudar a montar la representaciÃƒÂ³n de &quot;La venganza de don Mendo&quot; que va a dirigir Juan (Antonio Resines), antiguo compaÃƒÂ±ero suyo de Facultad. Se trata de conseguir que la gente del pueblo participe en el montaje para mejorar la convivencia, que deja bastante que desear, sobre todo en la separaciÃƒÂ³n ÃƒÂ©tnica. Se grabarÃƒÂ¡ en una televisiÃƒÂ³n local para que todo el que quiera pueda reÃƒÂ­rse con los estupendos versos de don Pedro MuÃƒÂ±oz Seca. \n\nInÃƒÂ©s cuenta con la ayuda del estupendo Paco CaÃƒÂ±ete (Manuel Bandera), Teniente de la guardia civil, encargado del puesto, y casado con Lola (Paz Vega), una hermosura un tanto casquivana, que se encapricha con la idea de ser la protagonista del evento. MÃƒÂ¡s aÃƒÂºn se ve involucrada la BenemÃƒÂ©rita, porque el elegido por Juan para interpretar a don Mendo es Goyito (Fele MartÃƒÂ­nez), un cabo artista y mÃƒÂºsico, bastante seductor, bipolar y mitÃƒÂ³mano... Y el sargento Perales (Juanjo CucalÃƒÂ³n), casado con una cubana que le hace enfermar de celos... TambiÃƒÂ©n actuarÃƒÂ¡ JazmÃƒÂ­n (Elena Furiase), la hija del Teniente, las chicas del puticlub de la localidad, unos asiÃƒÂ¡ticos... \n\nAdemÃƒÂ¡s de interpretar los papeles, tienen que cantarlos en muchos casos. Entre flamenco y rock, van sacando adelante su empresa. Al fin conseguirÃƒÂ¡n, despuÃƒÂ©s de enfrentamientos y dificultades, grabar su soÃƒÂ±ado espectÃƒÂ¡culo en el que participarÃƒÂ¡n por igual magrebÃƒÂ­es, asiÃƒÂ¡ticos, gitanos y naturalmente, la gente del pueblo de toda la vida. InÃƒÂ©s habrÃƒÂ¡ logrado al mismo tiempo un ÃƒÂ©xito profesional y asomarse al amor, del que estaba bastante alejada.\n\nNotas de ProducciÃƒÂ³n:\n- Libre adaptaciÃƒÂ³n en clave de musical de 'La Venganza de Don Mendo', obra teatral de Pedro MuÃƒÂ±oz Seca estrenada en 1918.\n\n\n\nEnglish:\n--------\nQuality: DVD9 =&gt; DVD9 \nAudio: Castilian \nSubtitles: None \nRegion: PAL \nRental Version \n\nTitle: Don Mendo Rock Ã‚Â¿La venganza? \nOriginal title: Don Mendo Rock Ã‚Â¿La venganza?\nGenre: Comedy \nLength: 105 Min \nCountry: Spain \nUSA release: \nReleased in Spain: 17/12/2010 \nReleased on DVD (rental): 23/06/2011 \nDVD release (sale): 27/07/2011 \nProducer: Jose Frade PC \nDirector: Jose Luis Garcia Sanchez \nScreenplay: Jose Luis Garcia Sanchez, Jose Luis Alonso de Santos &amp; Kiko Veneno \nStarring: Paz Vega, Fele Martinez, Antonio Resines, Maria Barranco, Juanjo CucalÃƒÂ³n, Elena Furiase, Manuel Bandera \nCalifiaciÃƒÂ³n: Suitable for all audiences \n\n\nSynopsis: \nInes (Maria Barranco), a naive and willful social worker, comes to an Andalusian village with the mission to carry out an activity rather special help set up the performance of &quot;Don Mendo's revenge&quot; that will lead Juan (Antonio Resines), former faculty colleague. It's about getting people to the people involved in the assembly to improve coexistence, which leaves much to be desired, especially in ethnic separation. Be recorded on local television for anyone who wants to laugh with great verses of Don Pedro MuÃƒÂ±oz Seca. \n\nAgnes has the help of the great Paco CaÃƒÂ±ete (Manuel Bandera), the Civil Guard Lieutenant in charge of the job, and married to Lola (Paz Vega), a somewhat frivolous beauty who becomes infatuated with the idea of ??being the star of event. Furthermore the Civil Guard is involved because the elected John to play Don Mendo is Goyito (Fele Martinez), an artist and musician out, quite charming, pathological liar and bipolar ... And the sergeant Perales (Juanjo CucalÃƒÂ³n), married to a Cuban woman who makes you sick with jealousy ... Jasmine also act (Elena Fury), the daughter of Lieutenant, the girls in the brothel of the town, some Asian ... \n\nIn addition to playing the roles they have to sing in many cases. Flamenco and rock, being pulled out their business. Finally get it, after clashes and difficulties, record your dream show in which North Africans participate equally, Asians, Gypsies, and of course, the townspeople of a lifetime. Agnes will have achieved both a professional success and look out for love, which was quite far. \n\nProduction notes: \n- Free key musical adaptation of &quot;The Revenge of Don Mendo&quot;, play by Pedro MuÃƒÂ±oz Seca released in 1918.\n\n\n","torrent":{"xt":"urn:btih:a9c5838a5a933f4890a649bc5971c29bc09f3887","amp;dn":"Don+Mendo+Rock+La+venganza+%282010%29+%5BDVDR9%5D%5BPAL%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9c5838a5a933f4890a649bc5971c29bc09f3887","infoHashBuffer":{"type":"Buffer","data":[169,197,131,138,90,147,63,72,144,166,73,188,89,113,194,155,192,159,56,135]},"announce":[],"urlList":[]}}