{"title":"Functional Foods - Cardiovascular Disease and Diabetes{BBS}","uid":6656915,"size":3413028,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa9220a127b93743d931eb74bbf897533c0c630b&amp;dn=Functional+Foods+-+Cardiovascular+Disease+and+Diabetes%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315354013,"description":"Cardiovascular disease and Type II diabetes are a growing problem for the developed world, putting an ever greater strain on healthcare systems. Edited by a leading authority, Functional Foods, Cardiovascular Disease, and Diabetes reviews the role of functional foods in helping to prevent these chronic diseases.\n\nTwo introductory chapters provide a context for the rest of the book by assessing the potential of functional foods to prevent disease and the key issues concerning health claims. Part 1 examines the importance of diet in the prevention of cardiovascular disease and diabetes, with chapters on fat soluble nutrients, antioxidants, and iron intake. Part 2 focuses on the role of phytochemicals in preventing cardiovascular disease, including chapters on isoflavones and plant sterols. Part 3 addresses the role of dietary fat, including the use of polyunsaturated fatty acids and fat replacers. The final part of the book reviews the use of starch and other functional ingredients in controlling cardiovascular disease, with individual chapters on cereal beta-glucans, grain legumes and food fermentation by lactic acid bacteria.\n\nFunctional foods, cardiovascular disease and diabetes will be a standard reference for all those concerned with the role of functional foods in the prevention and control of cardiovascular disease and diabetes.\nProduct Details\n\n    * Hardcover: 488 pages\n    * Publisher: CRC Press; 1 edition (September 22, 2004)\n    * Language: English\n    * ISBN-10: 0849325595\n    * ISBN-13: 978-0849325595","torrent":{"xt":"urn:btih:aa9220a127b93743d931eb74bbf897533c0c630b","amp;dn":"Functional+Foods+-+Cardiovascular+Disease+and+Diabetes%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa9220a127b93743d931eb74bbf897533c0c630b","infoHashBuffer":{"type":"Buffer","data":[170,146,32,161,39,185,55,67,217,49,235,116,187,248,151,83,60,12,99,11]},"announce":[],"urlList":[]}}