{"title":"RailWorks - China Clay for Export","uid":6642183,"size":164142276,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ac3c6bdf4cd6980085ec3cfd37f1ad48ffe29ad6&amp;dn=RailWorks+-+China+Clay+for+Export&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"RailGamer","files":-1,"time":1314750181,"description":"Our first release is a brand new route that is packed with both character and atmosphere. One of the most picturesque countys of England is featured, which will offer a very intensive and interesting railway experience.\n\nThe extraction of China Clay in Cornwall dates back to the 18th Century and remains a valuable resource to this day.\n\nThe chosen route encompasses parts of 3 different routes.\n\nPar to Bugle is a section of the historic former Cornwall Mineral Railway, which has become known locally as the 'Atlantic coast line - and terminates in Newquay.\n\nThe Great Western Mainline between Lostwithiel and Par also features, which carries London - Bristol - Penzance passenger services as well as a wealth of china clay traffic.\n\nOne of the most scenic freight only lines in Britain has to be the journey from Lostwithiel to Fowey docks (Carne Point). Clay from many different parts of Cornwall and Devon are carried by rail to Fowey where it is loaded onto waiting ships from all parts of the globe.\n\nThis is your chance to sign-on at St Blazey depot. Jump aboard your loco for the day and head off to Rocks Dryers to pick up a train of china clay. Can you manage to get this heavy train to Carne Point and return with empties whilst observing all speed limits, along the steep gradients and twisting lines?\n\nOr would you prefer taking control of the local passenger service, calling at all stops, through the delightful Cornish countryside?\n\nThis charming little route of around 20 miles will offer many differing challenges, with the player free to choose a variety of tasks to perform, whilst closely observing railway procedures\n\nÃ‚Â» Please note that the carriage door opening and passenger loading at stations has been disabled on this route.","torrent":{"xt":"urn:btih:ac3c6bdf4cd6980085ec3cfd37f1ad48ffe29ad6","amp;dn":"RailWorks+-+China+Clay+for+Export","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac3c6bdf4cd6980085ec3cfd37f1ad48ffe29ad6","infoHashBuffer":{"type":"Buffer","data":[172,60,107,223,76,214,152,0,133,236,60,253,55,241,173,72,255,226,154,214]},"announce":[],"urlList":[]}}