{"title":"Concepts - Self Titled (Steve of Kingdom of Giants) [JonnyBeans]","uid":6531196,"size":23630299,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:acca87553f70faf2e3e701db9a911a37b249bf75&amp;dn=Concepts+-+Self+Titled+%28Steve+of+Kingdom+of+Giants%29+%5BJonnyBeans%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zombifuzz","files":6,"time":1310358322,"description":"Concepts - Self Titled (2011) Side Project from Steve of Kingdom Of Giants\n\nR&amp;B\n\nvbr\n\nmp3\n\n-----------------\n\n\nFacebook users search Jonny Beans: Music &amp; Promotion on Facebook to keep up with release dates, tour info, confirmed album art/track listing, new label signings and anything else music related.\n\nI will not be uploading major label releases so please do not ask.\n\n-----------------\n\nAll 38 pages of old, major label torrents have been cleaned out to make room for unsigned bands who have submitted their music for me to upload to none other than The Pirate Bay. I have tons of emails waiting for me to download/upload.\n\nI have decided to return to The Pirate Bay but not to illegally share major label releases. I've decided to take file sharing and use it in a positive way by allowing unsigned bands to gain exposure and for their music to be heard by listeners who might not get the chance to ever hear the music the bands have put so much time and effort into.\n\nFile sharing is often referred to as illegal but I can now say, this type of file sharing is far from illegal. The bands are working hard to create something for fans of music to enjoy and some find it hard to get their music out there for people to listen to. I have decided to provide a way for these bands to share their music through this page and The Pirate Bay to gain some attention on what they love to do, create music.\n\nI'm hoping that this will turn out successful and I hope to hear from all the bands that follow this page that are willing to share their music for FREE to fans of the various genres we are all fans of. Music is created for people to hear. I'm here to help in any way possible.\t\t","torrent":{"xt":"urn:btih:acca87553f70faf2e3e701db9a911a37b249bf75","amp;dn":"Concepts+-+Self+Titled+%28Steve+of+Kingdom+of+Giants%29+%5BJonnyBeans%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acca87553f70faf2e3e701db9a911a37b249bf75","infoHashBuffer":{"type":"Buffer","data":[172,202,135,85,63,112,250,242,227,231,1,219,154,145,26,55,178,73,191,117]},"announce":[],"urlList":[]}}