{"title":"Siren.New.Translation.PS3.JAP-NOGRP [BCAS-20047]","uid":6658637,"size":13168326312,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:acd199b1bb6a6601907ebd1caf048c1926b47c8c&amp;dn=Siren.New.Translation.PS3.JAP-NOGRP+%5BBCAS-20047%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hn5","files":90,"time":1315422973,"description":"Siren.New.Translation.PS3.JAP-NOGRP [BCAS-20047]\n\nPublished by: Sony Computer Entertainment\nDeveloped by: SCE Studios Japan\nGenre: Adventure/Survival\n\nRelease Date:\nJapan: July 24, 2008\n\nIGN score 8.4 (Great)\nPlayer score 8.3 (187 Ratings)\n\n\nDescription:\n\nA TV crew from America arrive to research and film an expos  on the urban myth of Hanuda, the Vanished Village,\nwhere human sacrifices are said to have taken place.\n\nHanuda is a dark, eerie world, frozen in the 1970s and surrounded by a red sea. An ancient curse has been set\nupon the town and you, as the visitors, must save the remaining inhabitants including the beautiful Miyako.\nIn order to survive you must defend yourself from the vicious Shibito, or living dead, and other terrifying\nmonsters.\n\nAcross 12 chapters of horror, gamers will confront the mysteries of Hanuda in this new chapter of the the cult\nclassic horror game. Throughout the game you will play each of the visitors to the village.\n\nThe game's unique Sight-Jack System enables you to switch seamlessly between the visions of the hunted and the\nhunters. Blood, guts and gore are super-enhanced by amazing graphic effects, an advanced physics engine and\nshockingly realistic facial animations.\n\n\nFeatures:\n\n* Epic Story - spread across 12 dramatic episodes, Siren: Blood Curse (New Translation) will feature interactive\nscenarios and gripping cut scenes in each episode to keep players on the edge of their seats.\n\n* Enhanced  Sight Jack  System the automatic and seamless sight jack system allows players to see exactly what\ntheir enemies see\n\n* Playable Characters players will control seven playable characters throughout the haunting story\n\n* Fatal Moves - Sneak past the deadly Shibito or take them head on with over 50 kinds of weapons, each with unique\nfatal finishing move animations\n\n* Archive System - lets player unlock a variety of story clues and important background information ","torrent":{"xt":"urn:btih:acd199b1bb6a6601907ebd1caf048c1926b47c8c","amp;dn":"Siren.New.Translation.PS3.JAP-NOGRP+%5BBCAS-20047%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acd199b1bb6a6601907ebd1caf048c1926b47c8c","infoHashBuffer":{"type":"Buffer","data":[172,209,153,177,187,106,102,1,144,126,189,28,175,4,140,25,38,180,124,140]},"announce":[],"urlList":[]}}