{"title":"Democracy Now - 27 jul 2011","uid":6568691,"size":453744920,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:aced73f687b8d48767131c4f056e9d527119f734&amp;dn=Democracy+Now+-+27+jul+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1311849741,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jul 27, 2011\n\n- U.N.: Horn of Africa Hunger Crisis to Worsen\n- Congressional Budget Office Findings Prompt Delay of Republican Budget Vote\n- Environmentalist Tim DeChristopher Sentenced to 2 Years for Disrupting Federal Oil and Gas Auction\n- Gaddafi Regime: End Bombing Before NATO Talks\n- Israel, U.S. Denounce Palestinian Statehood Bid at United Nations\n- Israel Raids Palestinian Children's Theater\n- Democrat Rep. Luis Gutierrez Among 12 Detained in Protest Marking 1 Million Deportations Under Obama\n\n\nSpecial reports\n\n- Norwegian Shooting Suspect's Views Echo Xenophobia of Right-Wing Extremists in U.S., Europe\n\nBefore the deadly attack in Norway that killed 76 people, suspect Anders Behring Breivik left a long trail of material meticulously outlining his political beliefs. His 1,500-page political manifesto, titled &quot;A European Declaration of Independence,&quot; seeks common cause with xenophobic right-wing groups around the world, particularly in the United States. It draws heavily on the writing of prominent anti-Islam American bloggers, as well as Unabomber Ted Kaczynski. His writing reveals he is a right-wing nationalist fueled by a combined hatred of Muslims, Marxists, multiculturalists and feminist women. Even after the massacre in Norway, some right-wing pundits in the United States have come out in defense of Breivik's analysis. We speak with Jeff Sharlet, an author who has written extensively about right-wing movements in the United States, who has read much of Breivik's 1,500-page manifesto. &quot;What struck me most about this document is just how American it is in every way. I mean, a huge amount of it is from American sources,&quot; Sharlet says. &quot;He's a great admirer of America, because he says United States, unlike Europe, has maintained its 'Christian identity.'&quot;\n\n\n- Before Death, Acclaimed &quot;Girl with the Dragon Tattoo&quot; Author Stieg Larsson Lamented Right-Wing Extremism\n\nIn the aftermath of the Norway attacks, we look at the work of Stieg Larsson, an author known less for his extensive research into right-wing extremism in Scandavia and Europe than for his international blockbuster books, published after his death and known as the Millennium Trilogy: &quot;The Girl with the Dragon Tattoo,&quot; &quot;The Girl Who Played with Fire,&quot; and &quot;The Girl Who Kicked the Hornets' Nest.&quot; As part of his passion to &quot;counteract the growth of the extreme right and the white power-culture in schools and among young people,&quot; Larsson founded the Swedish Expo Foundation and edited its magazine, Expo. We go to Stockholm, Sweden, to speak with Larsson's lifelong partner, Eva Gabrielsson, about the research they did together before his death.\n\n\n- Dave Zirin on NFL Players' &quot;Remarkable&quot; Labor Victory and How the Bank Bailout Slam-Dunked the NBA\n\nProfessional football is back in action after the resolution of a labor standoff that brought the National Football League to a halt for 18 weeks. The NFL players' union has voted to unanimously approve an agreement with team owners that makes several changes to promote player health and safety, including limiting of on-field practice time and contact, and increasing the number of off-days for players. Players will also have the opportunity to maintain their healthcare plan for life. These changes came about after a greater awareness of the toll football takes on players' bodies, one of many issues tackled in &quot;Not Just a Game,&quot; a new documentary featuring Dave Zirin, sports columnist for The Nation magazine. Zirin talks about the film, the NFL deal, and the ongoing lockout threatening to derail the NBA's upcoming season. &quot;The owners in these leagues are getting less public subsidies than they thought they would get, because of the economic crisis in 2008 and the trillion-dollar bailouts of the banks,&quot; Zirin says. &quot;They're saying, 'We need to restore profitability and get more salary back from players, because we're getting less tax dollars than we thought we would get. And we will lock the doors and end the games, unless we get more money back.' And that makes it, to me, a much more broader political and social issue, like, oh, we don't even get our sports now, because Goldman Sachs needed a bailout?&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:aced73f687b8d48767131c4f056e9d527119f734","amp;dn":"Democracy+Now+-+27+jul+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aced73f687b8d48767131c4f056e9d527119f734","infoHashBuffer":{"type":"Buffer","data":[172,237,115,246,135,184,212,135,103,19,28,79,5,110,157,82,113,25,247,52]},"announce":[],"urlList":[]}}