{"title":"Democracy Now - 28 jul 2011","uid":6569614,"size":457812744,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:acf12955082b40890e609380d5e33c5e7e732d51&amp;dn=Democracy+Now+-+28+jul+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1311881986,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jul 28, 2011\n\n- United Nations Begins Emergency Aid Airlifts in Somalia\n- House GOP to Force Debt Ceiling Vote\n- IMF: Debt Deal Failure Would Have &quot;Far-Reaching&quot; Consequences\n- Constituents Flood Lawmakers with Concerns on Debt Impasse\n- Afghan Mayor Killed in Suicide Attack\n- U.S. Soldier Convicted in Murder of Afghan Civilian\n- Britain Expels Libyan Diplomats, Recognizes Rebels\n- Double Bombing Kills 12, Wounds 28 in Iraq\n- Reports: Mubarak Refusing Food Ahead of Trial\n- Supporters: California Prisoners Have Ended Hunger Strike\n- Mother of Child Killed in Hit-and-Run Sentenced to Probation\n- U.S. Study Claims No Link Between 9/11 Rubble and Cancer; Treatment Not To Be Covered in Healthcare\n- Attorney: Audiotape of Dominique Strauss-Kahn Accuser Misrepresented\n- Democrat Rep. David Wu Resigns Over Sex Allegations\n\n\nSpecial reports\n\n- Wealth Gap Between Minorities and White Americans Doubles After Housing Crisis, Recession\n\nA new study of U.S. census data reveals that wealth gaps between whites and minorities in the United States have grown to their widest levels since the U.S. government began tracking them a quarter-century ago. White Americans now have on average 20 times the net worth of African Americans and 18 times that of Latinos. According to the Pew Research Center, the gaps were compounded during the housing bust and the subsequent recession, and essentially wiped out much of the economic progress made by people of color over the past 20 years. We discuss the center's study with Roderick Harrison, sociologist and demographer, and former chief of racial statistics at the Census Bureau. &quot;Any hopes or aspirations, particularly based solely on Obama's election, that we had reached some kind of post-racial state were close to delusional,&quot; says Harrison. &quot;This report is pointing to just how much the socioeconomic inequalities have been exacerbated by the recession and poor economy.&quot;\n\n\n- Richard Wolff: Debt Showdown is &quot;Political Theater&quot; Burdening Society's Most Vulnerable\n\nRepublicans have agreed to a vote today on a budget plan they say will cut the deficit $917 billion over 10 years. The move sets the stage for a showdown against unified Democratic opposition in the Senate and threats of a White House veto. To discuss the debt talks and economic austerity worldwide, we're joined by Richard Wolff, Emeritus Professor of Economics at University of Massachusetts Amherst and author of several books, including &quot;Capitalism Hits the Fan: The Global Economic Meltdown and What to Do About It.&quot; &quot;This is political theater in which two parties are posturing for the election coming next year,&quot; says Wolff. &quot;To put it in perspective, the number of times the government has raised the debt ceiling since 1940? Ninety, almost twice a year. This is a normal, automatic procedure. Every president, Republican and Democrat, has asked for it.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:acf12955082b40890e609380d5e33c5e7e732d51","amp;dn":"Democracy+Now+-+28+jul+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acf12955082b40890e609380d5e33c5e7e732d51","infoHashBuffer":{"type":"Buffer","data":[172,241,41,85,8,43,64,137,14,96,147,128,213,227,60,94,126,115,45,81]},"announce":[],"urlList":[]}}