{"title":"Resurrecting The Champ(2006)DVDRip.AC3(ENG)-DROCK","uid":6652490,"size":733371856,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ada1bef5e988bcd747cf1046c3916f1d610a5278&amp;dn=Resurrecting+The+Champ%282006%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1315211237,"description":"Director and co-screenwriter (along with Chris Gerolmo, Allison Burnett, and Michael Bortman) Rod Lurie tells the uplifting tale of a sports writer who almost lost it all before stumbling into the story of a lifetime in this uplifting sports-themed drama starring Josh Hartnett and Samuel L. Jackson. Erik (Hartnett) is a Denver-based sports writer whose prose is dull and whose marriage is failing. Not only is Erik having a difficult time dealing with his stubborn editor Metz (Alan Alda) - who refuses to take the suffering scribe off of the boxing beat - but the pain of being separated from his young son has weighed heavier on Erik's conscience than he could have ever imagined. When Erik sees a local homeless man (Samuel L. Jackson) being violently assaulted by a gang of sadistic street toughs, he instinctively comes to the suffering man's rescue. As fate would have, Erik discovers that the nondescript homeless man is actually the former boxing champion Battling Bob Satterfield, whom many sports fans had assumed dead. Now driven to tell the story that may establish him as a successful sports writer, Erik gradually begins to make the transformation from ordinary man to extraordinary champion - largely by turning inward and by reexamining his relationship with his own son. \n\nRipped with Handbrake.\n\nLength: 1 Hour 51 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:ada1bef5e988bcd747cf1046c3916f1d610a5278","amp;dn":"Resurrecting+The+Champ%282006%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ada1bef5e988bcd747cf1046c3916f1d610a5278","infoHashBuffer":{"type":"Buffer","data":[173,161,190,245,233,136,188,215,71,207,16,70,195,145,111,29,97,10,82,120]},"announce":[],"urlList":[]}}