{"title":"The Apollo Guidance Computer[BBS]","uid":6615903,"size":25290027,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:adda6412d73600490a5351a7f162495615780e93&amp;dn=The+Apollo+Guidance+Computer%5BBBS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1313778567,"description":"Designing a mission for a flight to the Moon requires balancing the demands of a wide array of spacecraft systems, with the details of tending each component generating complex and often contradictory requirements. More than any other system in the Apollo spacecraft, the Apollo Guidance Computer drove the capabilities of the lunar missions. In the 1960's, most computers filled an entire room yet the spacecraft's computer was required to be compact and require little power.  When compared to modern systems, the AGC's design limitations and lack of speed presented formidable challenges. Yet, hardware and software engineers overcame these difficulties, and their creation was able to guide a new and complex spacecraft and its precious human cargo away from the safety of Earth and towards a new world. Although people today find it difficult to accept that it was possible to control a spacecraft using such a 'primitive' computer, it nevertheless had capabilities that are advanced even by today's standards.\n\nThe Apollo Guidance Computer: Architecture and Operation is the first comprehensive description of the Apollo computer, beginning with its internal organization to its user interface and flight software. Particular emphasis is placed on the instruction set, Executive capabilities, the Interpreter and the detailed procedures for mission application software. Launch, landing on the Moon and entry back on Earth are explained in rich detail and show how the computer was an integral part of the spacecraft operation. As a comprehensive account, it spans the disciplines of computer science, aerospace engineering and spacecraft operations. The Apollo Guidance Computer: Architecture and Operation is an essential reference for space historians and engineers, and serves well as a complementary text for computer science courses. \n\n\n\n\n\n# Paperback: 430 pages\n# Publisher: Praxis; 1st Edition. edition (July 12, 2010)\n# Language: English","torrent":{"xt":"urn:btih:adda6412d73600490a5351a7f162495615780e93","amp;dn":"The+Apollo+Guidance+Computer%5BBBS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adda6412d73600490a5351a7f162495615780e93","infoHashBuffer":{"type":"Buffer","data":[173,218,100,18,215,54,0,73,10,83,81,167,241,98,73,86,21,120,14,147]},"announce":[],"urlList":[]}}