{"title":"Naruto Shippuden Ep 1-87 English Dub HD","uid":6512421,"size":28775381432,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:ae04b5d10c6285168f8b32252c3790fecebda84c&amp;dn=Naruto+Shippuden+Ep+1-87+English+Dub+HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thelittlevoices","files":87,"time":1309687084,"description":"iv been scouring the internet for the best version of each episode, preferably uncut, and english dubbed (because reading subtitles takes your attention away from enjoying the animation).\n\nSo here it is, the best quality, most comprehensive, and most up-to-date collection of Naruto Shippuden english dubbed episodes available.\n\nI'd like to try to pay credit where it is due, but being as this has been a year+ long endevour, its pretty hard to remember everyone who contributed to this collection. But the main thanks go out to Cheater71 from thepiratebay and Fidelbd here at demonoid.\n\nDetails:\n-Mixture of .MKV and .MP4 files (my preference is to use GOM player to view them) (i dont know if they work on ps3 or xbox or anything, i dont own them)\n-All English dubbed (no subtitles)\n-Mostly 720p (i think) But even if theyre not, these episodes are pretty much the best quality youll find, anywhere. Aside from buying blu ray.\n-File size varies from 175MB to 564 MB (some double episode files)\n\n\nPlee to you downloaders:\nPlease help me seed this file and keep it alive. A lot of hard work went into keeping the best in this collection, as i constantly found better versions and replaced old ones.\n\nAlso, if anyone finds a better version of any of the episodes in this collection, or can point out an episode that is infact not 'uncut', please let me know, and if possible, point me in the direction of the better version.","torrent":{"xt":"urn:btih:ae04b5d10c6285168f8b32252c3790fecebda84c","amp;dn":"Naruto+Shippuden+Ep+1-87+English+Dub+HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae04b5d10c6285168f8b32252c3790fecebda84c","infoHashBuffer":{"type":"Buffer","data":[174,4,181,209,12,98,133,22,143,139,50,37,44,55,144,254,206,189,168,76]},"announce":[],"urlList":[]}}