{"title":"Democracy Now - 03 aug 2011","uid":6580777,"size":453286041,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:af34444c61e13c07d4c97ca61be7dfa656da36aa&amp;dn=Democracy+Now+-+03+aug+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1312390701,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Aug 03, 2011\n\n- Obama Signs Debt Law Following Senate Passage\n- Mubarak, Sons Make First Court Appearance Since Ouster\n- U.N.: Horn of Africa Crisis Threatens 12.4 Million\n- U.S. to Ease Terror Restrictions to Free Up Somalia Aid\n- Syrian Troops Continue Crackdown in Hama\n- Record-Level Radiation Detected at Stricken Japanese Plant\n- Iraq Authorizes Talks on Prolonging U.S. Occupation\n- NATO: Avoiding Afghan Civilian Casualties &quot;Secondary&quot;\n- U.S., Afghan, Pakistan Officials Hold Trilateral Talks\n- Members of U.S.-Backed Guatemalan Death Squad Convicted for 1982 Massacre\n- Thousands Protest for West Papuan Independence\n- Vets With PTSD Settle Health Benefits Lawsuit\n- Congress Adjourns Without Resolution to FAA Stalemate\n\n\nSpecial reports\n\n- Rep. Donna Edwards on Why She Voted Against Debt Deal: &quot;A Bad Framework for the Future&quot;\n\nPresident Obama has signed legislation to increase the U.S. debt ceiling in time to avoid a national default. The $2.1 trillion deficit-reduction plan cleared its final hurdle in the Senate yesterday, passing with a 74-to-26 vote. Six Democrats and 19 Republicans opposed the measure. Members of the Progressive Caucus and the Congressional Black Caucus rejected the deal because of its massive cuts to domestic spending and a lack of tax increases for the wealthy. Democratic Rep. Donna Edwards of Maryland was among those to vote no, summing up her disappointment on Twitter by writing: &quot;Nada from million/billionaires; corp tax loopholes aplenty; only sacrifice from the poor/middle class? Shared sacrifice, balance? Really?&quot; We speak with Rep. Edwards about why she voted against the plan. [includes rush transcript]\n\n\n- Economist Dean Baker Predicts &quot;Really Bad Deal or No Deal&quot; from Deficit &quot;Super Committee&quot;\n\nPresident Barack Obama welcomed the deficit deal as &quot;an important first step&quot; and urged both parties to work together on a larger plan to cut the deficit. The deal includes no new tax revenue from wealthy Americans and no additional stimulus for the lagging economy. It has a provision to create a joint committee of 12 legislators charged with finding $1.5 trillion in deficit cuts. The committee must hold its first meeting in 45 days and is expected to set in motion a lobbying frenzy. For more, we speak with Democratic Rep. Donna Edwards of Maryland, who voted against the plan, and economist Dean Baker, co-director of the Center for Economic and Policy Research.\n\n\n- Syrian Forces Attack Civilians in Hama As U.N. Security Council Wavers on Condemning Crackdown\n\nSyrian forces are pushing towards the center of the restive city of Hama as they continue an offensive in which an estimated 140 people have been killed. Residents say they saw explosions Wednesday morning and lines of tanks heading into the city. Chairman of the U.S. Joint Chiefs of Staff, Admiral Mike Mullen, called on Tuesday for a rapid end to violence in Syria but said direct U.S. involvement was unlikely. The U.N. Security Council met Tuesday to discuss the crisis, but failed to reach an agreement. With foreign media and observers banned from Syria, we speak with Nadim Houry, the Beirut-based senior researcher on Syria and Lebanon for Human Rights Watch. &quot;We need a strong Security Council resolution at this stage,&quot; Houry says. &quot;[But] there is no support for military action. People inside Syria do not want to see any form of military intervention. They think it will make the situation worse.&quot; Instead, Houry calls on Syria to grant access to independent observers, journalists, and a U.N. fact-finding mission.\n\n\n- Thousands Protest Widening Inequality in Israel, But Calls Ignore Occupation and Palestinian Rights\n\nIn Israel, tens of thousands have joined nationwide protests against high costs of living and growing income inequality. Protesters have set up more than 40 tent encampments scattered across Israel, with as many as 120,000 people turning out to demand lower taxes and increased access to education and housing. In Jerusalem, some 15,000 gathered outside the home of Prime Minister Benjamin Netanyahu. We go to Tel Aviv to speak with Dimi Reider, an Israeli journalist and co-editor of 972 Magazine. &quot;What is happening in Israel is nothing short of revolutionary,&quot; Reider says. &quot;We see left-wingers, right-wingers, Palestinian Israelis, Jewish Israelis, ulta-orthodox, LGBT activists all coming together to protest against certain issues that they have in common... The issue of occupation, however, has been missing from the protests, partly as a strategic choice of the organizers.&quot;\n\n\n- Sharif Abdel Kouddous: Opening of Mubarak Trial is &quot;Defining Moment in Egypt's History&quot;\n\nDemocracy Now! correspondent Sharif Abdel Kouddous was on sight in Cairo today as former Egyptian president, Hosni Mubarak, appeared in court for the first time to face allegations of corruption and the killing of protesters during the uprising that overthrew his rule. The trial has been adjourned until August 15. &quot;This is a defining moment in the revolution and in Egypt's history,&quot; Sharif says.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:af34444c61e13c07d4c97ca61be7dfa656da36aa","amp;dn":"Democracy+Now+-+03+aug+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af34444c61e13c07d4c97ca61be7dfa656da36aa","infoHashBuffer":{"type":"Buffer","data":[175,52,68,76,97,225,60,7,212,201,124,166,27,231,223,166,86,218,54,170]},"announce":[],"urlList":[]}}