{"title":"The Absolute Best Ultimate Party Dance Music Collection","uid":6644979,"size":4879882047,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:af572248cb28b19094bdd2bb95e72c363bf46ffb&amp;dn=The+Absolute+Best+Ultimate+Party+Dance+Music+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mutegrill","files":652,"time":1314910904,"description":"The Definitive Best Absolute Ultimate Party Dance Music Collection - 652 Classics\n\nPLEASE NOTE: MY CONNECTION IS MEDIUM QUALITY, SO PLEASE STAY FOR A WHILE AND HELP SEED AFTER YOU ARE DONE!\n\nYou cannot included all songs ever written, just because they exist. I have carefully chosen the very best of each artist ever had a top of the charts, and not for instance ALL of Micheal Jackson\\'s or Madonna\\'s top of the charts songs. That would impare the quality of this collection, since they have produced so many. All songs by one artist CANNOT be equally as good. You will not find death metal, hard core rap, jazz for nerds and such genres in this collection...\n\nThere is a small selection of the national preference of mine (Sweden), but not as abundant as in other collections (one of those which constists of 2000 songs where about 300 of them where of dutch nationality). Out of the Swedish selections I have at least tried to pick out internationally successfull ones.\n\nI have also - at my best ability - tried to mix different genres; pop, soul, r&amp;b, rock, metal, jazz etc, so there will be enough for everyone.\n\nUnfortunately I do not own a music player that can play at random, therefore I have numbered all songs in order to not play several songs of the same artist in a sequence. But I have attached two free supplementary softwares:\n\n000 - File Renamer Basic.exe\nSo you can remove the numbering\n\n000 - Copy Filenames to Text 3.1.exe\nTo create a playlist of any number of files or the contents of a folder and paste the file names into a text editior.\n\nTHOUGH, be sure to scan ALL files for malign stuff, since I have not. But I always go online in a safe manner, that is why I feel no need for Antivirus software (firewall I do have of course).\n\nPLEASE NOTE: MY CONNECTION IS MEDIUM QUALITY, SO PLEASE STAY FOR A WHILE AND HELP SEED AFTER YOU ARE DONE!\n\nHappy dancing people, and enjoy! I do :-)","torrent":{"xt":"urn:btih:af572248cb28b19094bdd2bb95e72c363bf46ffb","amp;dn":"The+Absolute+Best+Ultimate+Party+Dance+Music+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af572248cb28b19094bdd2bb95e72c363bf46ffb","infoHashBuffer":{"type":"Buffer","data":[175,87,34,72,203,40,177,144,148,189,210,187,149,231,44,54,59,244,111,251]},"announce":[],"urlList":[]}}