{"title":"Siri Karlsson - Gran Fuego 2011","uid":6507632,"size":271424242,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:af7085419976abc7a4cf559fa658577552095f56&amp;dn=Siri+Karlsson+-+Gran+Fuego+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"barber9","files":-1,"time":1309520413,"description":"Siri Karlsson is a Swedish duo consisting of Cecilia Osterholm on nyckelharpa (key fiddle) and Maria Arnqvist on alto saxophone. We play our own instrumental folk/progressive version of Swedish folk music. For our latest album, Gran Fuego (release 27 April 2011), we invited who we believed would be the perfect producer to help us fulfill our vision, Jari Haapalainen. And indeed he did! Together we invited great guest musicians to join. Tomas Hallonsten (organ), Josef Kallerdahl (bass), Pelle Lindroth alias Parken (voc), Simon SvÃƒÂ¤rd (git), Martin SÃƒÂ¶rbom (git, perc) and finally Jari Haapalainen (dr). Live we perform either as duo or with guests.\n\nSiri Karlsson was formed in 2002, starting with a tour in Brazil. In 2005-06 we took off for another adventure, a one month tour in Mali and Burkina Faso in West Africa. We had the pleasure to jam and perform with some of Mali and Burkinas greatest artists such as Toumani Diabate and Solo Dja Kabako. If it werent for already booked gigs in Sweden we would have stayed further, invited by Tiken Jah Fakoly to open for his stadium concert at Stade de Bamako!\n\nIn 2008 we released our debut album Mellan TrÃƒÂ¤den (Tombola Records). For this album we invited two of our favorite musicians, Tuomo Haapala, composer and musical innovator on acoustic bass, and Eric Malmberg on hammond organ, known from Sagor &amp; Swing. (sirikarlsson.com)\n\n- - -\n\nJa, svensk folkmusik spelas av mÃƒÂ¥nga ypperliga musiker och ja, det kommer flera utmÃƒÂ¤rkta skivor varje ÃƒÂ¥r. Men alltfÃƒÂ¶r fÃƒÂ¥ lyckas bli en angelÃƒÂ¤genhet utanfÃƒÂ¶r de egna kretsarna.\n\nOm det finns nÃƒÂ¥gon rÃƒÂ¤ttvisa i vÃƒÂ¤rlden kommer duon Siri Karlsson att bli det. I sitt musikaliska tilltal ÃƒÂ¤r de i en klass fÃƒÂ¶r sig. Deras andra platta Gran Fuego ÃƒÂ¤r kort och gott fantastisk.\n\nMaria Arnqvist (altsaxofon mm) och Cecilia Osterholm (nyckelharpa) har sitt bandnamn efter en riktig Siri Karlsson, en smÃƒÂ¥lÃƒÂ¤ndsk folksÃƒÂ¥ngerska och psalmodikonspelare. Men duon av i dag spÃƒÂ¤nner ÃƒÂ¶ver ett mycket vidare fÃƒÂ¤lt, dÃƒÂ¤r folkmusik, nyprogg och experimentell instrumentalmusik mÃƒÂ¶ts.\n\nDen rika syresÃƒÂ¤ttningen av Arnqvists och Osterholms melodier gÃƒÂ¶r att lÃƒÂ¥tarna riktigt bÃƒÂ¥gnar av innehÃƒÂ¥ll. VÃƒÂ¥gar vi hoppas pÃƒÂ¥ att Gran Fuego innebÃƒÂ¤r bÃƒÂ¶rjan pÃƒÂ¥ en period med folkmusikaliska formexperiment? Inte sedan nittiotalets storhetstid har en folkplatta kÃƒÂ¤nts sÃƒÂ¥ lÃƒÂ¶ftesrik.  (Kalle Tiderman i SvD)\n\n- - - \n\n \nCecilia Osterholm ÃƒÂ¤r en av Sveriges frÃƒÂ¤msta nyckelharpspelare och har samarbetat bl a med Benny Andersson, Hans Holmer och Roland Keijser. Tillsammans med Saxofonisten Maria Arnqvist utgÃƒÂ¶r hon grunden fÃƒÂ¶r Siri Karlsson. FÃƒÂ¶rsta skivan slÃƒÂ¤pptes 2008 och fick ÃƒÂ¶versvallande recensioner i Sverige och utomlands. Siri Karlssons musik ÃƒÂ¤r svÃƒÂ¥r att klassificera men de rÃƒÂ¶r sig i omrÃƒÂ¥det mellan folkmusik, prog, electronica, psychedelia. Kan ses som nÃƒÂ¤rbeslÃƒÂ¤ktade med band som Dungen och Coco Rosie. (ginza)\n\n- - -\n\nSiri Karlsson - Gran Fuego 2011 \nStockholm Flora &amp; faun)\n\n 1. DÃƒÂ¤r allting bÃƒÂ¶rjar\n 2. Sierra Nevada\n 3. Passageraren\n 4. Den gamle\n 5. Lament\n 6. Jakob Grape\n 7. The wild wood\n 8. Du och jag (pastoral)\n 9. Viens quands tu pleure\n10. Sov min kÃƒÂ¤ra\n11. Postludium\n","torrent":{"xt":"urn:btih:af7085419976abc7a4cf559fa658577552095f56","amp;dn":"Siri+Karlsson+-+Gran+Fuego+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af7085419976abc7a4cf559fa658577552095f56","infoHashBuffer":{"type":"Buffer","data":[175,112,133,65,153,118,171,199,164,207,85,159,166,88,87,117,82,9,95,86]},"announce":[],"urlList":[]}}