{"title":"AIDA64 Extreme Edition","uid":6616079,"size":12875054,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b1bbba76cb1968ca16848cc1e69eb67836ddffc0&amp;dn=AIDA64+Extreme+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"slurpy97","files":2,"time":1313785770,"description":"AIDA64 Extreme Edition is a streamlined Windows diagnostic and benchmarking software for home users. AIDA64 Extreme Edition provides a wide range of features to assist in overclocking, hardware error diagnosis, stress testing, and sensor monitoring. It has unique capabilities to assess the performance of the processor, system memory, and disk drives. AIDA64 is compatible with all current 32-bit and 64-bit Microsoft Windows operating systems, including Windows 7 and Windows Server 2008 R2.\n\n\nCPU, memory and disk benchmarks\nAIDA64 implements a set of 64-bit benchmarks to measure how fast the computer performs various data processing tasks and mathematical calculations. Memory and cache benchmarks are available to analyze system RAM bandwidth and latency. Processor benchmarks utilize MMX, 3DNow! and SSE instructions, and scale up to 32 processor cores. For legacy processors all benchmarks are available in 32-bit version as well. AIDA64 Disk Benchmark determines the data transfer speed of hard disk drives, solid-state drives, optical drives, and flash memory based devices.\n\n\nTemperature, voltage and cooling fan monitoring\nAIDA64 supports over 150 various sensor devices to measure temperatures, voltages, fan speeds, and power draw. Measured values can be displayed on System Tray icons, OSD panel, Sidebar Gadget, and Logitech G15/G19 Gaming Keyboard LCD. The values can also be logged to file or exported to external applications such as RivaTuner or Samurai. AIDA64 can also alarm the user when it detects overheating, over-voltage, or cooling fan failure.\n\nHardware diagnostics\nAIDA64 has the most accurate hardware detection capabilities in its class, to provide detailed information on the computer internals without the need to open it up. The hardware detection module is strengthened by an exhaustive hardware database holding over 120,000 entries. Additional modules are available to overview processor frequencies, check CRT and LCD display status, and stress the system to reveal potential hardware failures and thermal issues. \n\n\nSoftware and operating system analysis\nAIDA64 provides over 50 pages of information on installed programs, software licenses, security applications, and Windows settings. List of started processes, services, DLL files, startup programs, and visited web pages is also available.\n\n\nGreetings Realuploads","torrent":{"xt":"urn:btih:b1bbba76cb1968ca16848cc1e69eb67836ddffc0","amp;dn":"AIDA64+Extreme+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1bbba76cb1968ca16848cc1e69eb67836ddffc0","infoHashBuffer":{"type":"Buffer","data":[177,187,186,118,203,25,104,202,22,132,140,193,230,158,182,120,54,221,255,192]},"announce":[],"urlList":[]}}