{"title":"HISTORY OF POP AND ROCK MUSIC - part 313","uid":6585598,"size":587481884,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b290e487be9a6c7eedccddbbf49323756ae88f55&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+313&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zlatkopupovac","files":-1,"time":1312593646,"description":"\n\n                    PART  313 \n\n\n\n         BANANARAMA  -  Venus (1986)\n         THE BANGLES  - - Walk Like An Egyptian (1986)\n         THE BANGLES  -  Hazy Shade Of Winter (1987)\n         THE KLF - Justified And Ancient (Feat Tammy Wynette)  (1991)\n\n\n\n\n     &quot;Venus&quot; is a 1969 song by the Dutch band Shocking Blue which the group took to number one in the U.S. and five countries across Europe in 1970. Notably covered by girl group Bananarama, the song returned to number one in the U.S. and topped the charts in six other countries around the world in 1986.\n     The team's three members, Sara Dallin, Siobhan Fahey, and Keren Woodward, had the idea of turning the song into a dance music tune, but they were met with resistance from their producers at the time, Steve Jolley and Tony Swain.Dallin, Fahey, and Woodward had nearly completed recording their third album, titled &quot;True Confessions&quot;, with Jolley and Swain. Stock, Aitken and Waterman also resisted the idea because they believed that &quot;Venus&quot; would not make a good dance record. After persistence by the women, SAW relented, and the result was a worldwide smash. Bananarama's &quot;Venus&quot; went to number one in the U.S., Canada, Australia, New Zealand, Switzerland, Mexico, and South Africa. It hit number two in Germany and Hong Kong and was a top ten success in Italy, Austria, Belgium, Finland, France, Netherlands, Sweden, Colombia, Norway, Portugal, Spain, and their native UK (#8 on UK Singles Chart). It also went to number one for two weeks on the U.S. Dance chart. The composition has been featured in numerous films, television shows and commercials, and covered dozens of times by artists around the world.\n       \n     &quot;Walk Like an Egyptian&quot; is a number-one hit from the album &quot;Different Light&quot; by The Bangles in 1986. &quot;Walk Like an Egyptian&quot; was released as the third single from &quot;Different Light&quot;. It debuted on the Billboard Hot 100 in September 1986. The song reached a peak of number three on the UK Singles Chart in November 1986 and reached number one in the U.S. on December 20, staying at the top of the Hot 100 for four weeks, carrying it over into January 1987. The song is the first song by an all-female group playing their own instruments to top the Billboard singles chart.     \n\n     &quot;A Hazy Shade of Winter&quot; is a song written by Paul Simon and recorded by Simon &amp; Garfunkel in 1966 for their 1968 album&quot;, Bookends&quot;. In 1987, The Bangles were approached to record a song for the soundtrack of the film Less Than Zero. They chose to record a cover of &quot;A Hazy Shade of Winter,&quot; a song they had been performing since their early days as a band. Their cover, simply titled &quot;Hazy Shade of Winter,&quot; was vastly different from the original, turning it into a harder-edged rock song, and removing most of the bridge section.When released as a single in November 1987, &quot;Hazy Shade of Winter&quot; became a huge hit, surpassing the popularity of the original version, peaking at #2 on the Billboard Hot 100, and #11 in the UK. It was also a hit around Europe.\n\n    &quot;Justified &amp; Ancient&quot; is a song by British band The KLF (Bill Drummond and Jimmy Cauty) which featured on their 1991 album &quot;The White Room&quot; but with origins dating back to the duo's debut album, 1987 (What the Fuck Is Going On?).The song is best known for its remake that was released in November 1991 as a pop-house single subtitled &quot;Stand by The JAMs&quot;, with verses featuring the vocals of American country music singer Tammy Wynette. This version was an international hit, reaching #2 on both the UK Singles Chart, and the U.S. dance charts, #11 on the U.S. Billboard Hot 100, and hitting #1 in 18 countries\n\n\nFrom Wikipedia, the free encyclopedia","torrent":{"xt":"urn:btih:b290e487be9a6c7eedccddbbf49323756ae88f55","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+313","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b290e487be9a6c7eedccddbbf49323756ae88f55","infoHashBuffer":{"type":"Buffer","data":[178,144,228,135,190,154,108,126,237,204,221,187,244,147,35,117,106,232,143,85]},"announce":[],"urlList":[]}}