{"title":"TRIBLER 5.5.11 X32 LINUX-MAC OS X-WINDOWS [p50402]","uid":7025932,"size":70001895,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:b56f36501c0707a7a97da08a1d5b64180fb7acad&amp;dn=TRIBLER+5.5.11+X32+LINUX-MAC+OS+X-WINDOWS+%5Bp50402%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1328999130,"description":"Tribler is an open source BitTorrent-based p2p client that lets you find and share content like video, audio and pictures.\n\nTribler is a social community that facilitates filesharing through a peer-to-peer (p2p) network. When the Tribler application program is started it will automatically start searching other users that have Tribler running on their computer. When a connection is established it starts exchanging information. First it exchanges personal information (such as your avatar picture, your friends list, download history, etc.) and information about files that are available in the network. These files can be personal, shared files, but also files that one has received from another person. \n\nThe information about the discovered files and persons is available in the Tribler program. By browsing through the files and persons each user can find their prefered files and users. The tribler program helps you by giving extra information about each item (whether it is a file or a person) and also shows what other users think about it. When you find a person you like you can add him as a friend. An interesting file can be downloaded and will be available in your library. When you press download your computer will make an inventory of which computers actually have this file (or a part of it) and then will download the parts from the different computers. \n\nWhat makes Tribler different from others? \n\nTribler is developed at the Delft University of Technology and the Vrije Universiteit Amsterdam. Fundamental research to network technology, P2P networks, video streaming, user interaction helps us to integrate state-of-the-art knowhow into our software. We aim for an open source, fully decentralized peer-to-peer network, available for everybody, in every part of the world. \n\nMain features: \n\n* Search box with suggestions \n* Anti-spam features \n* Video-on-demand support \n* Fully distributed","torrent":{"xt":"urn:btih:b56f36501c0707a7a97da08a1d5b64180fb7acad","amp;dn":"TRIBLER+5.5.11+X32+LINUX-MAC+OS+X-WINDOWS+%5Bp50402%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b56f36501c0707a7a97da08a1d5b64180fb7acad","infoHashBuffer":{"type":"Buffer","data":[181,111,54,80,28,7,7,167,169,125,160,138,29,91,100,24,15,183,172,173]},"announce":[],"urlList":[]}}