{"title":"(Blues) Robert Nighthawk &amp; Forest City Joe - Black Angel Blues","uid":6618950,"size":164087251,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b5ca093f1afb569a8adad9638f944076c12c2e94&amp;dn=%28Blues%29+Robert+Nighthawk+%26+Forest+City+Joe+-+Black+Angel+Blues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nightissuchproximity","files":-1,"time":1313913618,"description":"Styles: Acoustic &amp; Electric Chicago Blues, Slide Guitar Blues, Harmonica Blues\nRecorded: 1948/1949/1950/1964\nReleased: 1990\nLabel: Charly\nFile: mp3 @ 320 kbps\nSize: 151.95 MB\nTime: 66:36\nArt: Full\n\n1. My Sweet Lovin' Woman - 2.48 \n2. Down The Line - 2:47\n3. Sweet Black Angel - 3:03\n4. Handsome Lover - 2:54 \n5. She Knows How To Love A Man - 3:05 \n6. Annie Lee Blues - 3:12 \n7. Sugar Papa - 2:50 \n8. Return Mail Blues - 3:15 \n9. Good News - 3:12 \n10. Six Three O - 2:50 \n11. Prison Bound - 2:55 \n12. Jackson Town Gal - 2:50 \n13. Sorry My Angel - 3:3\n14. Someday - 3:00\n15. Memory Of Sonny Boy - 2:47\n16. Special Delivery Man - 2:50\n17. Shady Lane Woman - 2:55\n18. A Woman On Every Street - 2:48\n19. Sawdust Bottom - 2:57\n20. Ash Street Boogie - 2:51\n21. Mean Mistreatin' Woman - 2:49\n22. Lonesome Day Blues - 2:32 \n\nPersonnel: Robert NIGHTHAWK - Guitar, Vocals \nwith\nEthel Mae - Vocals;\nErnest Lane, Pinetop Perkins, Lafayette Leake - Piano;\nWillie Dixon - Bass;\nWalter Horton - Harmonica;\nBuddy Guy - Guitar;\nJack Myers - Bass; Clifton James - Drums\non tr.14-22:\nFOREST CITY JOE - Harmonica, Vocals\nwith J.C. Cole - Guitar\n\n\nRomance and mystery are natural constituents of the blues but few bluesmen embodied restless melancholia better than Robert Lee McCoy (born McCollum). Taught guitar by his cousin Houston Stackhouse, McCoy already played harmonica and would do so on records by Sleepy John Estes and others but not his own. He and Sonny Boy Williamson I made their recording debuts on the same day in May 1937 and accompanied one another at two further sessions. He adopted and refined Tampa Red's slide guitar style to complement his doleful vocal timbre and it's for this that he has been remembered. \nBecause of his postwar sessions, under the name of Robert Nighthawk, were rare, but they were of a consistently high standard. He passed on his slide technique to a teenaged Earl Hooker. Nighthawk played at Muddy Waters's wedding to Mabel Berry in 1932 and it was through Muddy that he cut three sessions for Aristocrat between 1948 and 1950. Thirteen song were recorded, of which four were sung by his companion EthelMae Brown. On 'My Sweet Lovin' Woman' Nighthawk was supported by Sunnyland Slim; Ernest Lane and Pinetop Perkins took over the piano chair for the other sessions. His reinvigorations of two Tampa Red songs 'Sweet Black Angel' and 'Anna Lee', with their pellucid slide accompaniment, became the definitive Nighthawk recordings. 'She Knows How To Love A Man' and Leroy Carr's 'Prison Bound' are played conventionally with a light vibrato on the guitar amp. While his voice and guitar playing were a perfect marriage, Nighthawk's dignified and reticent style already sounded oldfashioned in 1950.\nBlues harpist Forest City Joe (born Joe Bennie Pugh) was heavily influenced by John Lee &quot;Sonny Boy&quot; Williamson. He not only played like him, but sang like him as well. Unlike his idol, however, who was murdered on June 1, 1948, Joe lived long enough to record for the Chess brothers in the early days of their activities, when Chess was known as Aristocrat. Joe was remembered as a &quot;great harp player&quot; by Muddy Waters, who only missed playing at Joe's one major Aristocrat recording session on December 2, 1948, when Joe was only 21. Joe had more of a country sound than most Chicago artists of the period, so it's surprising that the Chess brothers paired him up with J.C. Coles, a jazz guitarist of no seeming special account, who added little to a session but a few barely audible chords.\n\n","torrent":{"xt":"urn:btih:b5ca093f1afb569a8adad9638f944076c12c2e94","amp;dn":"%28Blues%29+Robert+Nighthawk+%26+Forest+City+Joe+-+Black+Angel+Blues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5ca093f1afb569a8adad9638f944076c12c2e94","infoHashBuffer":{"type":"Buffer","data":[181,202,9,63,26,251,86,154,138,218,217,99,143,148,64,118,193,44,46,148]},"announce":[],"urlList":[]}}