{"title":"Democracy Now - 08 aug 2011","uid":6590898,"size":458113898,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b6b2f43fe1aa9b74bb9df3b112a39dccec76a365&amp;dn=Democracy+Now+-+08+aug+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1312821088,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Aug 08, 2011\n\n- 30 Elite U.S. Troops Killed After Helicopter Is Shot Down In Afghanistan\n- Standard &amp; Poor Downgrades U.S. Credit Rating For First Time Ever\n- Share Of Eligible U.S. Population Holding A Job Hits Lowest Level Since 1983\n- 45,000 Verizon Union Workers Enter Second Day Of Strike\n- New Orleans Cops Linked To Post-Katrina Killings Guilty Of Civil Rights Violations, Not Murder\n- Saudi Arabia Recalls Ambassador To Syria As Brutal Crackdown Persists\n- More Than 100 Arrested In London's Second Night of Unrest\n- U.S. Expands Involvement In Mexican Drug War With CIA, DEA Intelligence Post\n- Hundreds of Thousands of Israelis March in Tel Aviv\n- Texas Gov. Rick Perry Leads Controversial Prayer Rally\n- Obama Administration Criticized For Carrying On Controversial Immigration Enforcement Program\n- Japan Honors Hiroshima Victims Amid Ongoing Nuclear Crisis\n\n\nSpecial reports\n\n- &quot;Nickel &amp; Dimed: On (Not) Getting By in America&quot;: Barbara Ehrenreich On The Job Crisis &amp; Wealth Gap\n\nStandard &amp; Poor's announced Friday it has downgraded the U.S. credit rating for the first time in history. The move by S&amp;P, one of three leading credit rating agencies, came just days after Congress approved a $2.1 trillion deficit-reduction plan. &quot;In some ways that is in another world from most Americans and their day to day struggles. What is it going to mean if you have no job now?&quot; says our guest, Barbara Ehrenreich, who has just published the tenth anniversary edition of her book, &quot;Nickel and Dimed: On (Not) Getting By in America.&quot; In the book, Ehrenreich tells the story of life in low-wage America, and tries to earn a living working as a waitress, hotel maid, nursing home aide and Wal-Mart associate. Ten years later, she compares the current situation of low-income U.S. workers to &quot;third world levels of poverty.&quot;\n\n\n- The Battle For Egypt's Media: Video Report On Press Freedom After The Revolution\n\nThe Egyptian revolution can count a number of huge successes: most notably, ousting former president, Hosni Mubarak, from power and putting him on public trial. But the revolution is far from over. The struggle for governmental reform, civil liberties and economic and social justice is being waged everyday. And there is one issue that affects all others: the media. Whether it is newspapers, television, radio or the Internet, the media is a central component of the revolution in Egypt. And while the press has opened up in a number of ways in the wake of the revolution, it is still very much an uphill battle. Journalists still face government repression and state media still largely acts as a government mouthpiece. Democracy Now! correspondents Sharif Abdel Kouddous and Nicole Salazar have been looking at the issue of media reform in Egypt. They filed this video report from Cairo.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b6b2f43fe1aa9b74bb9df3b112a39dccec76a365","amp;dn":"Democracy+Now+-+08+aug+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6b2f43fe1aa9b74bb9df3b112a39dccec76a365","infoHashBuffer":{"type":"Buffer","data":[182,178,244,63,225,170,155,116,187,157,243,177,18,163,157,204,236,118,163,101]},"announce":[],"urlList":[]}}