{"title":"Genesis - 2004- x264 AC3 Widescreen [French][Eng subs]","uid":7028318,"size":695904287,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b6eef650f07632b401491460441c580f8693cdf9&amp;dn=Genesis+-+2004-+x264+AC3+Widescreen+%5BFrench%5D%5BEng+subs%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1329145553,"description":"Genesis is a 2004 documentary written and directed by Claude \n\nNuridsany and Marie PÃƒÂ©rennou that explores the origins of earth and \n\nits inhabitants. The film focuses on the life of many animals. It is \n\nnarrated by Sotigui KouyatÃƒÂ©.\nThe film credits also list the natural events, animals and their \n\nsituations as part of the &quot;cast list.&quot;\n\n\nJust like the director did some ago in Microcosmos, this is a \n\nproject in which we can see the advances of film-making, the one \n\nthat can show us images that we had never seen before.\nFrom the crystallization of Vitamin C through and electronic \n\nmicroscope, to the sea horses love dance, from the amazing life of \n\nthe walking fish to the love parakeets, from the beautiful dance of \n\nJellyfish to the lava rivers, every single image is filled with \n\ncolor, life, joy and some kind of mystery.\nBlending humor with seriousness innocence with wisdom an African \n\ngriot uses the evocative language of myth and fable to relate the \n\nbirth of the universe and the stars the fiery beginnings of our \n\nplanet and the appearance of life on earth featuring animals as the \n\nmain players.\nGenesis is one of the most fascinating and relevant documentaries. \n\nIt is an account of the beginning of everything, but focuses most \n\nespecially on the nature of life on our planet.\nThe truths contained in this film and the fashion in which they are \n\nmasterfully woven into a much broader, overall picture are \n\ncompelling, the imagery is mesmerizing, and for anyone who is truly \n\ninterested in the essence and mannerisms of life as we know it, this \n\nfilm is an excellent introduction to a fuller, more complete \n\nunderstanding.\n\n\n\n\nFormat : \n\nFile format .mkv in a 1280 x 720 frame (to retain 16:9 aspect)\nVideo codec : H264 MPEG-4 AVC\nAudio Codec : AC3 (a52)\nChannels : 3F2R / LFE (5.1)\nSample Rate : 48000 Hz\nBitrate : 448 kb/s\n\nLanguage: French\nSubs : English\nRunning time : 77 minutes","torrent":{"xt":"urn:btih:b6eef650f07632b401491460441c580f8693cdf9","amp;dn":"Genesis+-+2004-+x264+AC3+Widescreen+%5BFrench%5D%5BEng+subs%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6eef650f07632b401491460441c580f8693cdf9","infoHashBuffer":{"type":"Buffer","data":[182,238,246,80,240,118,50,180,1,73,20,96,68,28,88,15,134,147,205,249]},"announce":[],"urlList":[]}}