{"title":"RailWorks - BAA/BZA Wagon Pack","uid":6616676,"size":567848100,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b9738133333f295442717b8aa87e8f16fbc38f11&amp;dn=RailWorks+-+BAA%2FBZA+Wagon+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RailGamer","files":-1,"time":1313824186,"description":"Armstrong Powerhouse presents the BAA/BZA wagon pack. Built in the mid 1970s, these wagons have been the staple of transporting steel throughout the UK for over 30 years and can still be seen in revenue-earning to this day. This pack sets a new standard in quality and includes highly detailed representations of these two wagons for RailWorks 2. It features:\n\n- Detailed models of the BAA &amp; BZA wagons - 3 liveries (Maroon/Railfreight/Un-branded)\n- Weathered variants of the Maroon &amp; Railfreight BAAs\n- Coil &amp; ingot loads for the BAA. Coil load for the BZA.\n- Prototypical sounds as heard in our popular Wagon Sound Pack\n- ActivWagon scripting which means a flashing tail lamp will automatically be shown on the rear. The ActivWagon scripting used in the flashing tail lamp is copyright Just Trains Ltd and is used with their permission under licence. www.justtrains.net\nAs well as the excellent wagons, 3 scenarios are included where we have strived for realism in all areas. For example, each scenario uses the timetable of its relevant year to create an as realistic experience as possible. As well as this, most trains have their time of leaving, origin and destination so you can see which train is which!\n\nBasic Scenario Requirements\nPlease note these items are only required if you would like to use the scenarios. If you only want to use the wagon or perhaps use it in your own scenarios instead of the included ones then these items are not required.\nAlso, these requirements are just for one of the scenarios in this pack, APBZA 6V02 18:43 Tees Yard - Margam, for the Newcastle to York route, which has been designed to use as few requirements as possible whilst retaining realism to enable those with few payware add-ons to still have a scenario to use.\n\nBasic Extra Stock \nJust Trains Class 220/221 (Voyager) \nOovee TEA Bogie Tank Wagon Pack \nRS.com Class 66 \nRS.com Class 158 \n\nBonus Scenario Requirements\nThese requirements are for the two other scenarios which are packaged separately in this download for those who have the requirements listed below. These are required on top of what is listed above:\nBonus Extra Stock (Basic extra stock pack listed above not required if you have the requirements to run the two other bonus scenarios)\nTPO NSA Coaches\nJust Trains Newcastle to York (Modern) Route \nWest Coast Main Line \nJust Trains Class 60 \nOovee Class 156 \nRS.com Class 37 \nRS.com Class 67\nRS.com Class 86 \nRS.com Class 390","torrent":{"xt":"urn:btih:b9738133333f295442717b8aa87e8f16fbc38f11","amp;dn":"RailWorks+-+BAA%2FBZA+Wagon+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9738133333f295442717b8aa87e8f16fbc38f11","infoHashBuffer":{"type":"Buffer","data":[185,115,129,51,51,63,41,84,66,113,123,138,168,126,143,22,251,195,143,17]},"announce":[],"urlList":[]}}