{"title":"Anticancer Agents From Natural Products{BBS}","uid":6658234,"size":42251921,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba6a97f0772fd757edaa2c96d96c297db7054587&amp;dn=Anticancer+Agents+From+Natural+Products%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315408149,"description":"Plants, marine organisms, and microorganisms have evolved complex chemical defense and signaling systems that are designed to protect them from predators and provide other biological benefits. These organisms thus produce substances containing novel chemotypes that may have beneficial effects for humans. As collection methods improve and new screening techniques and molecular targets proliferate, natural products are once again taking a central part of modern pharmaceutical research. Anticancer Agents from Natural Products analyzes current clinically-used anticancer agents that are natural products or clearly derived from natural product leads.\n\nThis multi-authored volume provides a historical, biochemical, and chemical rationale to the search for plant, marine, or microbial sources that may provide future templates for drug lead optimization and synthetic drug design. Grouped by source organism, each chapter includes the history of the drug and a discussion of its mechanism in action, medicinal chemistry, and biochemistry. The authors characterize each compound by its structure, genetics, molecular biology, synthesis, and possible derivatives. They also discuss \\approaches to drug discovery and development, including the use of combinatorial biosynthetic techniques, testing methods, and ways to obtain economically viable amounts of the drug. The final chapter covers drug candidates that are in preclinical or clinical development and may be used in the future.\n\nEdited by leading scientists who have contributed enormously to natural product development and potential anticancer natural products, Anticancer Agents from Natural Products is a convenient summary of the current status of research and development of some of the most effective anticancer agents available today. It is an ideal foundation for scientists engaged in developing new and improved drugs based on natural sources.\nProduct Details\n\n    * Hardcover: 600 pages\n    * Publisher: CRC Press; 1 edition (June 13, 2005)\n    * Language: English\n    * ISBN-10: 0849318637\n    * ISBN-13: 978-0849318634","torrent":{"xt":"urn:btih:ba6a97f0772fd757edaa2c96d96c297db7054587","amp;dn":"Anticancer+Agents+From+Natural+Products%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba6a97f0772fd757edaa2c96d96c297db7054587","infoHashBuffer":{"type":"Buffer","data":[186,106,151,240,119,47,215,87,237,170,44,150,217,108,41,125,183,5,69,135]},"announce":[],"urlList":[]}}