{"title":"USB Portable Diagnostics","uid":6522861,"size":2100471074,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bbe9827677d84d7ee12c250f99d389b1f7dfe4be&amp;dn=USB+Portable+Diagnostics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"cad40","files":-1,"time":1310054790,"description":"This torrent includes all that you will ever need to diagnose problems with a computer, and is completely portable &amp; fits right onto a flash drive! Programs include, but aren't limited to: Various antivirus softwares, LockHunter, WinRAR, HDD Backup programs, AIDA64, various activators and key generators (including DAZ's Windows Loader v2.04), Adobe Reader X, Driver Genius Professional, various registry cleaners, various disk defragmentation programs, Enchanted KeyFinder, Passware, and many others. \n\nFor those noobs, because there's always that ONE person who will comment saying, &quot;TROJAN! DO NOT DOWNLOAD!!&quot;, or something to that effect, keep in mind that KEY GENERATORS and CRACKS for programs ALWAYS appear as viruses when you run an antivirus scan. \n\nBOTTOM LINE: IF YOU DON'T TRUST IT, DON'T DOWNLOAD IT! \n\nAll credit for these programs goes to those who made them, I simply put them all together in one package so that the community doesn't have to go looking for them all at once. \n\nPlease seed as much as possible for as long as possible. Don't download the file and run, that just isn't fair to the community. SEED! If there are no seeders, send me a PM and I will begin seeding again.\n\nIf there are missing files, that means your antivirus program detected the keygen's and/or cracks and deleted them. Check the quarantine list in your antivirus program to restore them, or turn your antivirus off while downloading. I know this sounds risky, but like I stated earlier, if you don't trust it - don't download it. Simple as that. \n\nThank you to all those who took the time to make these programs, this wouldn't have been possible without you.\n\nP.S. - One last thing, for some reason the Key Generator in the Malwarebytes Anti-Malware v1.51 file does work, but doesn't produce working keys. I tried to repair it but got nowhere. The Key Generator in the Malwarebytes Anti-Malware v1.50 however does produce valid keys, so use ","torrent":{"xt":"urn:btih:bbe9827677d84d7ee12c250f99d389b1f7dfe4be","amp;dn":"USB+Portable+Diagnostics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbe9827677d84d7ee12c250f99d389b1f7dfe4be","infoHashBuffer":{"type":"Buffer","data":[187,233,130,118,119,216,77,126,225,44,37,15,153,211,137,177,247,223,228,190]},"announce":[],"urlList":[]}}