{"title":"Heroes of Newerth LEGACY DVD 1.1","uid":7031459,"size":4022016000,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bc6ee7180fec7bf911a65ea6566e8c96bd782197&amp;dn=Heroes+of+Newerth+LEGACY+DVD+1.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hclivess","files":1,"time":1329232897,"description":"Heroes of Newerth LEGACY DVD 1.1\n &lt;a href=&quot;\nhttp://img849.imageshack.us/img849/1310/honclient.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img849.imageshack.us/img849/1310/honclient.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img855.imageshack.us/img855/1818/covervx.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img855.imageshack.us/img855/1818/covervx.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img862.imageshack.us/img862/5975/accua.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img862.imageshack.us/img862/5975/accua.jpg&lt;/a&gt;\n\nThis colection of rare collectibles is now available to you, wether you are yet to start playing this brilliant competitive game or you are a seasoned player looking for ways to improve your skills and statistics.\n\nThis pack includes several exclusive features unavailable elsewhere:\n\n* Full version of Heroes of Newerth IGN Academy\nPresented to you by [S2]DivA and [S2]MsPudding, this package is aimed atyour gaming habits. It includes game basics, advanced techniques and strategies used by the acclaimed teams winning every major tournament. It is guaranteed to improve your skill and maximize your potential.  \n\nNEW! * Enhanced sountrack by Thomas-Adam Habuda with bonus tracks\nReleased in February 2012, this soundtrack deliveres the music of one of the most talented current electronic composer, Tomas-Adam Habuda. He succesfully deliveres the most moving and inspirational spotlight and teaser music including those of Amun-Ra and Martyr. All tracks are available full in length.\n\n* Unreleased Heroes of Newerth DVD cover\nIf you ever wanted to put your game in your shelf along with other titles, now you have a possibility. After burning contents of this DVD, you can easily print the cover in PDF format for your DVD case on any printer without any settings or external applications.\n\nNEW! * Things not everybody knows vol. 1-10 (High Definition)\nRecently released by l34Um1, this video series will teach you the most advanced tricks in the game and also expolits of the Heroes of Newerth engine. Every possible counterintuitive feature of the game which 95% of the community do not know is included.\n\n* Regularly updated list of professional streaming players\nMoonMeander, Tralfamadore, AngryTestie, the official Honcast stream. Have them all lined up just one click away. No more laggy HoNTV, no more third-party streaming sites. This is the best it gets for watching the best players in the world competing or stomping pubs.\n\nNEW! * Game art collection\nIn case you want to use concept and other art of Heroes of Newerth, every possible bitmap is included. You can have yourself made a t-shirt with any hero imaginable, create a custom website or use the art for your own purposes.\n\nYou also obtain the latest vanilla game client in this package.\n\n ","torrent":{"xt":"urn:btih:bc6ee7180fec7bf911a65ea6566e8c96bd782197","amp;dn":"Heroes+of+Newerth+LEGACY+DVD+1.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc6ee7180fec7bf911a65ea6566e8c96bd782197","infoHashBuffer":{"type":"Buffer","data":[188,110,231,24,15,236,123,249,17,166,94,166,86,110,140,150,189,120,33,151]},"announce":[],"urlList":[]}}