{"title":"The Rivals of Sherlock Holmes","uid":6586973,"size":7257876527,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bd17141049c035c90790dc319921ed53b53ed084&amp;dn=The+Rivals+of+Sherlock+Holmes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"neil1966hardy","files":16,"time":1312647450,"description":"1...THE MYSTERIOUS DEATH ON THE UNDERGROUND RAILWAY. author/creator Baroness Emma Orczy (Scarlet Pimpernel)\nA poison murder on the London tube leaves a reporter, Polly Burton (Judy Green-'To Sir With Love') to find the killer. But at what risk? Polly's police Sgt. beau, Richard (Richard Beckinsale) is also on the case.\n\n2...FIVE HUNDRED CARATS. author/creator George Griffith\nA 511 carat diamond in 1890 S. Africa causes problems galore-including murder. Insp. Leo Lipinzki (Barry Keegan) must discover much more than the location of the DeBeers diamond, an impossible heist. Not just WHO? but HOW?\n\n3...CELL 13. author/creator Jacques Futrelle (died on the Titanic)\nProfessor Augustus Van Dusen (Douglas Wilmer) is locked away in a high-security jail to attempt to prove he can escape within a week. Grangemoor Prison staff &amp; the warden are set on the Professor's failure.\n\n4...THE SECRET OF THE MAGNIFIQUE. author/creator E. Phillips Oppenheim\nMr. J. T. Laxworthy (Bernard Hepton) hires 2 ex-jailbirds for espionage purposes to take place in Southern France. Laxworthy's proposal to the men is via blackmail. It's off to the French Riviera. What does the French Navy ship 'Magnifique' have to do with this caper?\n\n5...THE ABSENT-MINDED COTERIE. author/creator Robert Barr\nFrench Amateur Det. Eugene Valmont (Charles Gray) is up to his neck in counterfeiting and even a more dastardly plot. it may be the foiled end for Valmont. Oh, mon Dieu! Oh, my dear! An 1895 mystery as thick as the London fog. Humor mixed with mystery.\n\n6...THE SENSIBLE ACTION OF LIEUTENANT HOLST. author/creator Baron Palle Rosenkrantz\nLt. Holst (John Thaw-'Inspector Morse') in this 1905 Copenhagen mystery with a Russian Countess claiming she's targeted for assassination. Holst is assigned the case which holds much more mystery than revolutionary threats and Holst gets caught in the middle.\n\n7...THE SUPERFLUOUS FINGER. author/creator Jacquex Futrelle, same as episode 3\nProf. Van Dusen (Douglas Wilmer) is asked to discover why a Londoner wants her finger cut off. Murder complicates the investigation. Discoveries lead to a loony Baronet uncle, fond of gun use, political crackpot, ex-lawyer...with a history. Van Dusen is the KING of comedy Victorian condescension.\n\n8...ANONYMOUS LETTERS. author/creator Adalbert Goldscheider, pseudonym Baldwin Groller\n1900 Vienna. Dagabert Trostler (Ronald Lewis) Private Eye, searches for the outrageous vulgar obscene letter writer to Countess Tildi Leys (Carolyn Jones). Daring Victorian intimacy is also written to her 'friend'. Scandalous, absolutely scandalous! Exposing a delicate located birthmark leads to something more sinister. This episode contains some Tildi nudity.\n\n9...THE MOABITE CYPHER. author/creator R. Austin Freeman\nDr. Thorndyke (Barry Ingram), forensic forefather, shows up at an accident scene to proclaim the victim dead--kicked by a London police horse. A package dropped by the victim appears to be a bomb. No, it's a pie. The dead man also has a letter, cipher, written in ancient Hebrew, Moabite As typical of this author, the mystery follows the victims death, and a surprise end.\n\n10..THE SECRET OF THE FOXHUNTER. author/creator William Le Queux\nWilliam Drew (Derek Jacobi) enjoys the hunt at an English country estate but not the guests spying on England. There is more targeted for a kill than a fox. Or is there a fox in the hen-house?\n\n11..THE LOOTING OF THE SPECIES ROOM. author/creator C. S. Cutcliffe Hyne aka Weatherby Chesney\n1910. Heading from NYC, a steam ship purser, Mr. Horrocks (Ronald Frazer) is in charge of securing 1/4 million in gold while the ship races for a record transatlantic crossing in 8 days. Horrocks must guard the species room-the gold location. Mrs. Vanrenen (Jean Marsh) and her abundance of luggage is another issue. Asst. Purser Robbins is played by Michael Cashman.\n\n12..THE MYSTERY OF THE AMBER BEADS. author/creator Fergusson Wright Hume (top selling Victorian mystery novelist)\nHagar (Sara Kestelman) rag buyer, London pawnshop inheritor niece gets a pawned necklace with a past. Ex-lawyer tries to claim Hagar's Uncle's estate for himself. Beautiful Gypsy Hagar is involved unwittingly in a murder mystery and more.\n\n13..THE MISSING Q.C.s. author/creator William Arthur Dunkerley\nYoung Charles Dallas (Robin Ellis) looks for 2 missing London colleagues among the Queen's Counsels. It is a mystery as to WHO is on trial. Surgeon &amp; Prof. Dyne (John Phillips) is called as a witness to determine the sanity of the accused. A mysterious triangle in law indeed. Plus a comic/romance of sorts. \n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:bd17141049c035c90790dc319921ed53b53ed084","amp;dn":"The+Rivals+of+Sherlock+Holmes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd17141049c035c90790dc319921ed53b53ed084","infoHashBuffer":{"type":"Buffer","data":[189,23,20,16,73,192,53,201,7,144,220,49,153,33,237,83,181,62,208,132]},"announce":[],"urlList":[]}}