{"title":"The Compass of Pleasure_capu","uid":6505502,"size":1684472942,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:be61e89689199a0c4f08cbe252178671896526f9&amp;dn=The+Compass+of+Pleasure_capu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"anythingless","files":17,"time":1309417002,"description":"By merging an evolutionary perspective with cutting-edge research in neuroscience, Linden, a professor of neuroscience at Johns Hopkins University School of Medicine, addresses provocative questions about the relationship between pleasure and addiction while exploring many of the broader implications of the nexus of the two. &quot;Understanding the biological basis of pleasure leads us to fundamentally rethink the moral and legal aspects of addiction to drugs, food, sex, and gambling and the industries that manipulate these pleasures.&quot; Linden (The Accidental Mind) is admirable at explaining complex scientific concepts for the nonspecialist. He focuses most of his attention on the role played by the small portion of our gray matter known as the medial forebrain pleasure circuit and demonstrates how both behavior and chemistry can activate its neurons. He also discusses the somewhat counterintuitive conclusion that addiction is often associated with decreased pleasure. Linden's conversational style, his abundant use of anecdotes, and his successful coupling of wit with insight makes the book a joy to read. Even the footnotes are sprinkled with hidden gems. ","torrent":{"xt":"urn:btih:be61e89689199a0c4f08cbe252178671896526f9","amp;dn":"The+Compass+of+Pleasure_capu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be61e89689199a0c4f08cbe252178671896526f9","infoHashBuffer":{"type":"Buffer","data":[190,97,232,150,137,25,154,12,79,8,203,226,82,23,134,113,137,101,38,249]},"announce":[],"urlList":[]}}