{"title":"David Fiddimore - Tuesday's War","uid":6511635,"size":467086268,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:be994242d5d1d36e3e510107f2af3aadd1204dd5&amp;dn=David+Fiddimore+-+Tuesday%5C%27s+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mustafa-crap","files":14,"time":1309646374,"description":"This wasn't to be the last time that we left pieces of aeroplane all over Germany, but you remember your first time. It's just like your first kiss. It is 1944 and as their battered Lancaster Bomber limps home to base in thick fog, an RAF crew are horrified to find a second Bomber just moments in front. It is too close for their own pilot to react, but in one skillful move their forerunner swoops out of the way and the crew's lives are saved.\n\nBack on the runway the seven, thankful young men eagerly await their savior's return and are stunned, when the pilot climbs down from the cockpit, to find themselves face to face with female Air Transport Auxiliary pilot Grace Baker. Grace quickly befriends the crew, introducing them to their new Bomber, 'Tuesday's Child' and ensconcing herself in their spare bunk. Then when rear gunner 'Pete the Pole' absconds, the lads don't think twice about asking Grace to secretly take his place in 'Tuesday' as they return to Germany...As radio operator Charlie Bassett regales the reader with the drama of combat during his eight weeks aboard 'Tuesday's Child' in 1944, a funny, authentic and deeply humane tale unfolds. Comparable to Sebastian Faulks' &quot;Birdsong&quot;, &quot;Tuesday's War&quot; races vividly across the page, emotionally entwining the reader in the lives and friendships of its extraordinary characters and awakening us to the heroics and realities of war.","torrent":{"xt":"urn:btih:be994242d5d1d36e3e510107f2af3aadd1204dd5","amp;dn":"David+Fiddimore+-+Tuesday%5C%27s+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be994242d5d1d36e3e510107f2af3aadd1204dd5","infoHashBuffer":{"type":"Buffer","data":[190,153,66,66,213,209,211,110,62,81,1,7,242,175,58,173,209,32,77,213]},"announce":[],"urlList":[]}}