{"title":"Panggilan Arwah SDTVRip","uid":6514016,"size":679447319,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bfeadfff0fd71b4e2f429bbd5bdafbd37917ec3f&amp;dn=Panggilan+Arwah+SDTVRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Zaini711","files":-1,"time":1309752983,"description":"Tayangan : Astro Citra 29 Mei 2011\n\nPelakon : Zizan Nin,Tasha Shila dan turut dibintangi Mahmud Ali Basha, Jazz Rashid, Kuza dan Riezman Khuzaimi\n\n\nMenceritakan kisah Amin (Zizan Nin), seorang graduan perubatan yang baru sahaja menamatkan pengajiannya pulang ke kampung halaman sementara menunggu tawaran berkhidmat sebagai doktor di hospital kerajaan.\n\nKetika berada di kampung, Amin sering bermimpi tentang ibu saudaranya, Sabariah (Tasha Shilla) yang diseksa dalam kubur dan meminta pertolongan daripada Amin.\n\nBingung dengan makna di sebalik mimpi tersebut, Amin cuba mencari kisah silam emak saudaranya daripada ibunya, Maimun (Kuza) tetapi ditegah oleh ayahnya, Badrul (Mahmud Ali Basha).\n\nAmin gagal membezakan mimpi dan realiti dan memaksa dia menyiasat misteri Sabariah seorang diri dan akhirnya ayahnya membongkar rahsia hubungan Sabariah dengannya.\n\nSabariah merupakan ibu kandung kepada Amin namun telah dirahsiakan daripada pengetahuan orang ramai kerana bimbang akan kata-kata orang kampung yang menuduh Sabariah melahirkan anak luar nikah kerana melakukan zina dengan seorang ahli perniagaan dari Kuala Lumpur.\n\nKebenaran yang terbongkar itu mendorong Amin mencari ayah kandungnya yang sebenar dan terjawablah teka-teki yang menghantui dirinya selama ini bahawa dia merupakan anak sah hasil perkahwinan ibunya dengan ayahnya, Ramlan (Riezman Khuzaimi) sebelum bercerai.\n\nNamun Sabariah terus muncul dalam mimpi Amin meminta pertolongan agar membantunya untuk dilepaskan daripada azab kubur akibat dosa silam yang dilakukannya. Kesudahannya bakal terjawab dalam drama penuh pengajaran ini.\n\nPlease donate or visit website for support\n &lt;a href=&quot;\nHTTP://URSHOP.COM.MY&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nHTTP://URSHOP.COM.MY&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:bfeadfff0fd71b4e2f429bbd5bdafbd37917ec3f","amp;dn":"Panggilan+Arwah+SDTVRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfeadfff0fd71b4e2f429bbd5bdafbd37917ec3f","infoHashBuffer":{"type":"Buffer","data":[191,234,223,255,15,215,27,78,47,66,155,189,91,218,251,211,121,23,236,63]},"announce":[],"urlList":[]}}