{"title":"Hard-Fi - Killer Sounds","uid":6635524,"size":82378933,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c00b98458ad4dc321fe655e90a9e2da352ebcde6&amp;dn=Hard-Fi+-+Killer+Sounds&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"speedthunder","files":13,"time":1314543678,"description":"[img]http://ecx.images-amazon.com/images/I/51xkD88%2BKVL._SL500_AA300_.jpg[/img]\n\nHard-Fi have dawdled since 2007's Once Upon a Time in the West, with its slated 'No Cover Art' sleeve overshadowing the fact it reached number one. But they return to stall the supposed demise of rock, showing that, despite Liam's delusions, the state of the genre's health does not rest on Beady Eye's shoulders alone.\n\nThat band's suburban tales of lost youth emerged at a vibrant time for the post-Britpop domestic scene, their debut album going platinum in the UK and spending over 100 weeks on the charts. But unlike The Horrors' recent Skying, said group's own third collection, there are few surprises here. Calling this set Killer Sounds is a brave declaration, then, and one that doesn't wholly hold water.\n\nThe quartet springs out the traps so eagerly that they almost fall on their faces, opener Good for Nothing not quite the anthem they think it is, although its sturdy beats and piano middle-eight do improve with each listen. Killer Sounds is mostly self-produced by singer Richard Archer; but with it currently hard to eat a sandwich without Stuart Price having had some involvement in spreading its filling, he contributes to the jubilant Fire in the House. The track's impossible to listen to without the sense of a jostling crowd stretching to the horizon, and lager being thrown around. If Hard-Fi's goal is to be the British Killers then this number sees them come close, as does the seamless blend of brazen guitars and electronics on Give It Up.\n\nHowever, these sounds aren't all killer: the hollow Feels Good explores the possibilities of the sitar and a rhyming dictionary (&quot;cocaine&quot; with &quot;propane&quot;, anyone?) and enthusiasm masks poor writing on Love Song. Sweat is another example of them working too hard without realising their ambitions, while Excitement should never have made the cut.\n\nThe prevailing lack of invention is frustrating, although the Clash-influenced Stay Alive's radio-friendly rock and Bring It On are convincing arguments for its absence. Following 40 minutes of lyrical vagueness about hearts on fire and cheques you can't cash, the acoustic title-track, about the death of youth, wears its heart touchingly on its sleeve.\n\nKiller Sounds is as assured as third albums should be, and were it a debut album it would be feted as a bright start. However, there is the sense we should be expecting more from Hard-Fi at this point, as the sporadic sparks of brilliance here demonstrate they are capable of it.\n\n[img]http://i896.photobucket.com/albums/ac169/pbf99/tr.gif[/img] \n\n   1. Good For Nothing\n   2. Fire In The House\n   3. Give It Up\n   4. Bring It On\n   5. Feels Good\n   6. Stop\n   7. Stay Alive\n   8. Excitement\n   9. Love Song\n  10. Sweat\n  11. Killer Sounds\n\n[img]http://i896.photobucket.com/albums/ac169/pbf99/ENJOY.gif[/img]","torrent":{"xt":"urn:btih:c00b98458ad4dc321fe655e90a9e2da352ebcde6","amp;dn":"Hard-Fi+-+Killer+Sounds","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c00b98458ad4dc321fe655e90a9e2da352ebcde6","infoHashBuffer":{"type":"Buffer","data":[192,11,152,69,138,212,220,50,31,230,85,233,10,158,45,163,82,235,205,230]},"announce":[],"urlList":[]}}