{"title":"Folder Lock v6.6.5 + Serials [ChattChitto RG]","uid":6576629,"size":6768325,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c0c14ffbad3da6c9a1c284fea95130b0968d9ce7&amp;dn=Folder+Lock+v6.6.5+%2B+Serials+%5BChattChitto+RG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ChattChitto","files":-1,"time":1312225730,"description":"Folder Lock v6.6.5 + Serials\n\n.exe File Format (Setup File - Serials - Instructions)\n\n***********************************************************************************\n\nFolder Lock v6.6.5\n\nHomepage: http://www.newsoftwares.net/folderlock/\n\n\nFolder LockÃ‚Â® - The Fastest Encryption on Earth!\n------------------------------------------------\nFolder Lock is a file encryption software that offers fastest way of encrypting and password protecting files and folders. You can either choose to encrypt important files from techies or lock your files, pictures and private data from casual users. Folder Lock comes with locking, encryption, shredding, stealth mode, hack attempt monitoring, portability, plug &amp; play support, history cleaning, and more than 20 privacy features all tailored to special needs for people wanting privacy and security.\n\nMilitary Standard of securing your files and folders!\n------------------------------------------------------\nFolder Lock - file encryption software uses US military standard 256-bit Advanced Encryption Standard algorithm to protect your valuables. Encryption is on-the-fly and decryption is automatic i.e. content is loaded in memory instead of hard drive. This means your data is unrecoverable without correct password no matter how the protection is tampered and the protection is fast as it does away the hassle of decrypting everything in your hard drive.\n\nYour data moves freely in your pocket without fears!\n-----------------------------------------------------\nFolder Lock is a portable file encryption software offering PC independent password protection of your files and folders. Create a portable Locker in your USB Drive or Memory Stick and Folder Lock will also create an autoplay executable in your USB drive. Automatic plug &amp; plug is also supported making it easy to open protected Lockers on USB drive without the need to install Folder Lock. \n\nYour data is safe no matter what the bad guy think!!\n-----------------------------------------------------\nWith Folder Lock, all your data sits in one location i.e. your secured Locker. Furthermore, this file encryption software supports multi-user interface making it easy for the whole family or your colleagues to use your computer for storing their own Lockers with their own passwords. Never again worry about data loss, theft or privacy breaches. If you share your computer with others or fear hackers and thieves may steal your data, give Folder Lock a try!\n\nWorks on all 32-bit and 64-bit Windows platforms!\n--------------------------------------------------\nFolder Lock is compatible on all 32-bit and 64-bit flavors of Windows 7.0, Windows Vista, Windows XP, Windows 2008, Windows 2003 Server and Windows 2000. The protection is cross-platform compatible and PC independent. Folder Lock offers great features and zero compromise on data security in all versions of Windows.\n\n\nEncrypt:\n=========\n-Fast file encryption software\n-256-bit AES on-the-fly encryption\n-Encrypt files and folders of any type\n-Encrypt data on USB drives as well\n\n\nLock:\n======\n-Easy drag &amp; drop file locking\n-Password protect folders easily\n-Lock files, folders and drives\n-Context Menu in Explorer supported\n\n\nShred:\n=======\n-Shreds original files when encrypted\n-Leaves no traces on your PC\n-Prevents recovery of private data\n-Enable/disable shredding feature\n\n\nPrivacy:\n=========\n-File locking &amp; file encryption software\n-Cleans history automatically on use\n-Protected files are hidden as well\n-All features well suited for privacy\n\nStealth:\n=========\n-No evidence of Folder Lock installed\n-Remove all traces and shortcuts\n-Press hotkey to run Folder Lock\n-Program supports 64-bit based OS\n\nMonitoring:\n============\n-Hack Attempt Monitoring\n-Monitor fake login attempts\n-Shut down / logs off automatically\n-Halts on fake password attempts\n\n\n\nWhat is Folder Lock?\n=====================\n \nFolder LockÃ‚Â® is a fast file locking and file encryption software that can password protect folders, encrypt or lock files, protect USB Drives and lock CDs/DVDs. The program supports all flavors of Windows 7.0, Vista, XP and 2000 including their 64-bit variants.\nFolder Lock creates encrypted storages called 'Lockers'. You can keep as many of your private files &amp; folders in Locker and password protect it with a single click. Lockers are portable, so you can transfer, secure and backup these Lockers or keep them in USB Drives, CDs/DVDs, &amp; notebooks or transfer them over email. These Lockers are undeletable on the computer where Folder Lock is installed.\nYou can create as many Lockers as you want. Different users can create different Lockers with different passwords as well. Folder Lock is two-in-one file locking and file encryption software that lets you choose either to encrypt using 256-bit AES on-the-fly encryption or lock files, folders and drives anywhere on your computer. Each Locker can contain your encrypted files as well as your personal list of your locked items.\nFurthermore, Folder Lock comes with additional features which no other file encryption software offer like hack monitoring, stealth mode, data shredding, auto protection, portable USB autoplay support, history cleaning and virtual keyboard. This can enhance file locking and encryption beyond anything ever achieved. In addition, a Locker can't be renamed, moved or deleted without a correct password to prevent data loss.\nFolder Lock is the most downloaded File Encryption Software in the market with more than 15 million downloads to date. \n\n\nFeatures and Benefits:\n=======================\n \n-256-bit AES encryption. The fastest file encryption software that uses on-the-fly encryption (military standard) for file protection.\n-File Lock, Folder Lock, Drive Lock, File Encryption and Folder Encryption. All in one complete package.\n-Full Portability. Password protect USB Drives, Lock CDs &amp; DVDs and share password with trusted friends.\n-Backup or transfer your password protected Lockers anywhere. All data sits in one place for easy backup.\n-Undeletable Lockers (on the PC where Folder Lock is installed). Deletion requires you to login into Folder Lock.\n-Shred files automatically when data is encrypted. Choose this option if you're obsessed with your data.\n-Stealth Mode feature can efficiently hide all the traces of Folder Lock ever been installed on your PC.\n-Windows History Cleaning. Removes recent history of PC activity automatically when Locker closes.\n-Hack Attempt Monitoring option can monitor fake password attempts and can Shutdown PC automatically.\n-Fastest File Encryption Software! Encrypted data is later decrypted in memory, preventing data recovery &amp; slow processing.\n-Complete Privacy! Whether you're concerned with privacy, data theft, data loss, data leaks or virus attacks. You need Folder Lock!\n\n***********************************************************************************\n\n\nTested And Working...\nScanned (With Kaspersky) And 100% Clean.\n\n(If You Found Something \\&quot;Un-Clean\\&quot; In Any Of My Torrents, Consider That It May Be A False Positive(Alert) And If you Are Sure Please Report It To Me So I Would Remove It)\n\n[Please Leave A Comment Confirming This Pack]","torrent":{"xt":"urn:btih:c0c14ffbad3da6c9a1c284fea95130b0968d9ce7","amp;dn":"Folder+Lock+v6.6.5+%2B+Serials+%5BChattChitto+RG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0c14ffbad3da6c9a1c284fea95130b0968d9ce7","infoHashBuffer":{"type":"Buffer","data":[192,193,79,251,173,61,166,201,161,194,132,254,169,81,48,176,150,141,156,231]},"announce":[],"urlList":[]}}