{"title":"Mr. Brooks(2007)DVDRip.AC3(ENG)-DROCK","uid":6576787,"size":732567429,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c0d6342ab27a0ebff457aa0dbf6280415cff3b7e&amp;dn=Mr.+Brooks%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1312232201,"description":"A hardened detective enters into a tenuous symbiotic relationship with the vicious serial killer she is tracking after earning the respect of the murderous madman in this vicious psychological thriller starring Demi Moore, Kevin Costner, and William Hurt. Earl Brooks (Costner) is a successful businessman, noted philanthropist, and loving father. He's the kind of man whom no one would ever suspect of being a notorious serial killer, but then again history's most dubious psychopaths are often the quiet neighbor whom no one would ever suspect was capable of committing such unspeakable atrocities. Until now, no one has had any reason to link Earl Brooks with the heinous crimes of the dreaded Thumbprint Killer. Even his beautiful wife (Marg Helgenbeger) and teenage daughter (Danielle Panabaker) could never conceive of such an awful truth. But when Mr. Brooks's dark side begins to outshine his sane exterior, an amateur photographer (Dane Cook) captures the killer succumbing to his murderous instinct on film. Now, as Mr. Brooks is pursued by tenacious detective Tracy Atwood (Moore) and forced to bend to the will of an opportunistic bystander, the killer who was once able to keep his murderous alter ego (Hurt) in check finds his control steadily slipping. \n\nRipped with Handbrake\n\nLength: 2 Hours 1 Minute\n\nFile Type: MP4\n\nFrame Width: 1440\n\nFrame Height: 784\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:c0d6342ab27a0ebff457aa0dbf6280415cff3b7e","amp;dn":"Mr.+Brooks%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0d6342ab27a0ebff457aa0dbf6280415cff3b7e","infoHashBuffer":{"type":"Buffer","data":[192,214,52,42,178,122,14,191,244,87,170,13,191,98,128,65,92,255,59,126]},"announce":[],"urlList":[]}}