{"title":"Kiss of the Spider Woman (1985) Documentaries [2008]","uid":6570621,"size":2142160864,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c150ea4101604c4eac04ea5a06c7f30b90cee749&amp;dn=Kiss+of+the+Spider+Woman+%281985%29+Documentaries+%5B2008%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ThorntonWilde","files":-1,"time":1311959832,"description":" &lt;a href=&quot;http://bayimg.com/cAjIhAaDF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/cAjIhAaDF&lt;/a&gt;\n\nKiss of the Spider Woman (Spanish: El beso de la mujer araÃƒÂ±a) is a novel by the Argentine writer Manuel Puig. It is considered his most successful.\n\nThe novel's form is unusual in that there is no traditional narrative voice, one of the primary features of fiction. It is written in large part as dialogue, without any indication of who is speaking, except for a dash (-) to show a change of speaker. There are also parts of stream of consciousness. What is not written as dialogue or stream of consciousness is written as metafictional government documentation. The conversations between the characters, when not focused on the moment at hand, are recountings of films that Molina has seen, which act as a form of escape from their environment. Thus there are a main plot, several subplots, and five additional stories that comprise the novel.\n\nKiss of the Spider Woman (Portuguese: O Beijo da Mulher Aranha) is a 1985 Brazilian-American drama film. It was directed by Argentine-born Brazilian director HÃƒÂ©ctor Babenco, and adapted by Leonard Schrader from the Manuel Puig novel of the same name. William Hurt, RaÃƒÂºl JuliÃƒÂ¡, Sonia Braga, Jose Lewgoy, and Milton Goncalves star in the leading roles.\n\nTangled Web: Making Kiss of the Spider Woman (Video 2008)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1357527/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1357527/&lt;/a&gt;\n\nA strange odyssey from novel to film is chronicled in Tangled Web: Making Kiss of the Spider Woman. Creative team Manuel Puig, William Hurt, Raul Julia, Hector Babenco, Leonard Schrader, David Weisman confess the daunting challenges and profound satisfactions of creating this watershed film - which almost never made it to the big screen. Burt Lancaster's mysterious obsession, director Babenco's epic struggle with author Puig, the birth of today's independent cinema - these are all chapters in the startling saga behind this timeless gem. Filmmaker David Weisman's Tangled Web captures many of the unique and emotionally charged moments that serendipitously turned this courageous movie into a masterpiece.\n\n  Hector Babenco  ...  Himself  \n  Sonia Braga  ...  Herself  \n  William Hurt  ...  Himself  \n  Manuel Puig  ...  Himself (archive footage)  \n  David Weisman  ...  Himself  \n\nKiss of the Spider Woman - Making the Musical (Video 2008)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1441441/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1441441/&lt;/a&gt;\n\nKiss of the Spider Woman is a musical with music by John Kander and Fred Ebb, with the book by Terrence McNally. It is based on the Manuel Puig novel El Beso de la Mujer AraÃƒÂ±a. The musical had runs in the West End (1992) and Broadway (1993) and won the 1993 Tony Award for Best Musical.\n\nThe show opened on Broadway to mixed reviews. Despite a pan by Frank Rich, the musical ran for 904 performances.\n\n  Beverly D'Angelo  ...  Narrator  \n  Fred Ebb  ...  Himself  \n  John Kander  ...  Himself  \n  Terrence McNally  ...  Himself  \n  Harold Prince  ...  Himself  \n  Chita Rivera  ...  Herself  \n\nManuel Puig: The Submissive Woman's Role\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1593736/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1593736/&lt;/a&gt;\n\nManuel Puig (born Juan Manuel Puig Delledonne) (General Villegas, Argentina, December 28, 1932 - Cuernavaca, Mexico, July 22, 1990) was an Argentine author. Among his best known novels are La traiciÃƒÂ³n de Rita Hayworth (1968) (Betrayed by Rita Hayworth), Boquitas pintadas (1969) Heartbreak Tango (English Translation), and El beso de la mujer araÃƒÂ±a (1976).\n\nBeverly D'Angelo  ...  Narrator\nManuel Puig  ...  Himself (archive footage)\n\nKiss of the Spider From Novel to Film\n\nAnalysis of the film by Norman Lavers","torrent":{"xt":"urn:btih:c150ea4101604c4eac04ea5a06c7f30b90cee749","amp;dn":"Kiss+of+the+Spider+Woman+%281985%29+Documentaries+%5B2008%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c150ea4101604c4eac04ea5a06c7f30b90cee749","infoHashBuffer":{"type":"Buffer","data":[193,80,234,65,1,96,76,78,172,4,234,90,6,199,243,11,144,206,231,73]},"announce":[],"urlList":[]}}