{"title":"Titanic (4 Disc Deluxe Collector's Edition) [1997] [DVD]","uid":7020743,"size":27653572608,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c162103ecfeaeee8c7e85dedf1e73707d34bfcab&amp;dn=Titanic+%284+Disc+Deluxe+Collector%5C%27s+Edition%29+%5B1997%5D+%5BDVD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"d_34","files":-1,"time":1328828437,"description":"Actors: Kate Winslet, Leonardo Dicaprio, Billy Zane, Kathy Bates, Bernard Hill\nDirectors: James Cameron\nFormat: Anamorphic, THX, PAL, Special Edition, DTS Surround Sound\nLanguage English\nSubtitles: Danish, Finnish, Greek, Icelandic, Norwegian, Portuguese, Swedish, English\nAspect Ratio: 16:9 - 2.35:1\nNumber of discs: 4\nClassification: 12\nStudio: Fox\nDVD Release Date: 7 Nov 2005\nRun Time: 186 minutes\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0120338/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0120338/&lt;/a&gt;\n\nDescription: When the theatrical release of James Cameron\\\\\\'s Titanic was delayed from July to December of 1997, media pundits speculated that Cameron\\\\\\'s $200 million disaster epic would cause the director\\\\\\'s downfall, signal the end of the blockbuster era and sink Paramount Studios as quickly as the ill-fated luxury liner had sunk on that fateful night of April 14, 1912. Some studio executives were confident, others horrified, but the clarity of hindsight turned Cameron into an Oscar-winning genius, a shrewd businessman and one of the most successful directors in the history of motion pictures. Titanic would surpass the $1 billion mark in global box-office receipts (largely due to multiple viewings, the majority by teenage girls), win 11 Academy Awards including best picture and director, produce the bestselling movie soundtrack of all time and make a global superstar of Leonardo DiCaprio. A bona fide pop-cultural phenomenon, the film has all the ingredients of a blockbuster (romance, passion, luxury, grand scale, a snidely villain and an epic, life-threatening crisis), but Cameron\\\\\\'s alchemy of these ingredients proved more popular than anyone could have predicted. His stroke of genius was to combine absolute authenticity with a pair of fictional lovers whose tragic fate would draw viewers into the heart-wrenching reality of the Titanic disaster. As starving artist Jack Dawson and soon-to-be-married socialite Rose DeWitt Bukater, DiCaprio and Kate Winslet won the hearts of viewers around the world and their brief but never-forgotten love affair provides the humanity that Cameron needed to turn Titanic into an emotional experience. Present-day framing scenes (featuring Gloria Stuart as the 101-year-old Rose) add additional resonance to the story and, although some viewers proved vehemently immune to Cameron\\\\\\'s manipulations, few can deny the production\\\\\\'s impressive achievements. Although some of the computer-generated visual effects look artificial, others--such as the sunset silhouette of Titanic during its first evening at sea, or the climactic splitting of the ship\\\\\\'s sinking hull--are state-of-the-art marvels. In terms of sets and costumes alone, the film is never less than astounding. More than anything else, however, the film\\\\\\'s overwhelming popularity speaks for itself. Titanic is an event film and a monument to Cameron\\\\\\'s risk-taking audacity, blending the tragic irony of the Titanic disaster with just enough narrative invention to give the historical event its fullest and most timeless dramatic impact. Titanic is an epic love story on par with Gone with the Wind, and, like that earlier box-office phenomenon, it\\\\\\'s a film for the ages. --Jeff Shannon","torrent":{"xt":"urn:btih:c162103ecfeaeee8c7e85dedf1e73707d34bfcab","amp;dn":"Titanic+%284+Disc+Deluxe+Collector%5C%27s+Edition%29+%5B1997%5D+%5BDVD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c162103ecfeaeee8c7e85dedf1e73707d34bfcab","infoHashBuffer":{"type":"Buffer","data":[193,98,16,62,207,234,238,232,199,232,93,237,241,231,55,7,211,75,252,171]},"announce":[],"urlList":[]}}