{"title":"Videodrome (1983)","uid":7014182,"size":4510318592,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c1f32ddde8cf7a40b2a11913f052baf248be7b3a&amp;dn=Videodrome+%281983%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Auge","files":-1,"time":1328590957,"description":"I am providing important films in ISO for the film buff or novice film historian. It is nearly impossible to find torrent files that include all the extras or even important commentaries.\nThese files are from my collection of DVDs that I have made from rented movies over the last seven years or so.\nNearly all of them have been put onto a DVD5, so unfortunately I do not have an uncompressed source handy.  That said I can assure you that these look GREAT on larger screens.\nI chose to make them this size for economy as DVD9s were $3 each when I started this and DVD5s were .25 cents each.\nNow I am working on putting some of the best ones on a hard drive to be played with my HD TV Media Player and am still thinking economy is the best rule as these are half the size of ripping a DVD9.\nThis is the best quality for the value.\n\nI would love some productive feedback  . . .   :)\n\nThis is a DVD rip to an ISO so you can watch it on your media player, mount it to a virtual drive or burn it to a DVD.\n\nThis file includes EVERYTHING the original DVD has:\n\n1983\n87 minutes\nColor\n1.85:1\nSpoken Language: English\nSubtitles: English\nTwo audio commentaries: David Cronenberg and director of photography Mark Irwin, and actors James Woods and Deborah Harry\nCamera (2000), a short film starring Videodromes Les Carlson, written and directed by Cronenberg\n\nSYNOPSIS:  \nWhen Max Renn goes looking for edgy new shows for his sleazy cable TV station, he stumbles across the pirate broadcast of a hyperviolent torture show called Videodrome. As he struggles to unearth the origins of the program, he embarks on a hallucinatory journey into a shadow world of right-wing conspiracies, sadomasochistic sex games, and bodily transformation. Starring James Woods and Deborah Harry in one of her first film roles, Videodrome is one of writer/director David Cronenbergs most original and provocative works, fusing social commentary with shocking elements of sex and violence. With groundbreaking special effects makeup by Academy Award winner Rick Baker, Videodrome has come to be regarded as one of the most influential and mind-bending science fiction films of the 1980s.","torrent":{"xt":"urn:btih:c1f32ddde8cf7a40b2a11913f052baf248be7b3a","amp;dn":"Videodrome+%281983%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1f32ddde8cf7a40b2a11913f052baf248be7b3a","infoHashBuffer":{"type":"Buffer","data":[193,243,45,221,232,207,122,64,178,161,25,19,240,82,186,242,72,190,123,58]},"announce":[],"urlList":[]}}