{"title":"No Save Haven (VHS Rip) Dutch Subs","uid":6592936,"size":1539337708,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c20d7468256d0b77ef02187d5e16e253c444cd5f&amp;dn=No+Save+Haven+%28VHS+Rip%29+Dutch+Subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rubberboy37","files":1,"time":1312900505,"description":"AVI\nVHS Rip\nAktie\n90 minuten\n\nStaring: Robert Tessier (The Lost Empire), Robert Aloha, Marina Rice (Dallas) en Branscombe Richmond (Renegade, Hawai FiveÃ‚Â´O, Action Jackson)\n\nBuddy Wayne Harris is een verwoed rugbyspeler en uitgegroeid tot sterspeler van een niet te verslaan team. Omdat hij ook een liefhebber van gokken is, raakt hij verzeild in de wereld van drugs en sex en dit zet abrupt een punt achter zijn rugby carriere. In de drugshandel gelden andere regels en wetten als op het rugbyveld.\n\nHij wordt door de onderwereld als speelbal gebruikt en als hij gedwongen wordt een belangrjk spel opzettelijk te verliezen wil hij opstappen. Maar dit is al te laat, in maffiakringen dulden ze geen ongehoorzaamheid en hun straffen zijn keihard.\n\nBuddy wordt vermoord en ook zijn familie wordt uitgeroeid. BuddyÃ‚Â´s broer, Clint, die in Zuid-Amerika als geheim agent voor de CIA werkt, verneemt de dood van zijn familie en zweert wraak op de moordenaard. Hij keert terug naar Los Angeles en bereidt in zijn eentje, zonder enige medewerking, de wraakaktie voor. Clint heeft in Vietnam gevochten en deze ervaringen gebruikt hij in de strijd tegen de maffie, daardoor lukt het hem bijna om de drugsbende op te heffen.\n\nMaffie-boss, Carlos Hindle, kan ontvluchten en verbergt zich in zijn vesting gelegen in het oerwoud van Bolivia. Clint achtervolgt hem en dit is de laatste etappe van de strijd tegen de moordenaars van zijn familie.\n\n","torrent":{"xt":"urn:btih:c20d7468256d0b77ef02187d5e16e253c444cd5f","amp;dn":"No+Save+Haven+%28VHS+Rip%29+Dutch+Subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c20d7468256d0b77ef02187d5e16e253c444cd5f","infoHashBuffer":{"type":"Buffer","data":[194,13,116,104,37,109,11,119,239,2,24,125,94,22,226,83,196,68,205,95]},"announce":[],"urlList":[]}}