{"title":"Never Back Down(2008)DVDRip.AC3(ENG)-DROCK","uid":6583181,"size":724363264,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c535c874e7fdd9a885af37022fd48089653fc860&amp;dn=Never+Back+Down%282008%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1312502999,"description":"An outsider teen acclimating to a new school finds a home in a reclusive teenaged fight club in this drama from Cry_Wolf director Jeff Wadlow. Jake Tyler (Sean Faris) has just moved with his family to Orlando, FL. While Jake isn't exactly comfortable being the new kid in town, his younger brother, Charlie (Wyatt Smith), is an aspiring professional tennis star who might just have what it takes to break big. But Charlie isn't the only talented athlete in the family, because Jake used to be something of a hotshot on the gridiron -- at least back home. Here in Orlando, Jake is considered something of a hothead thanks to his penchant for brawling. In an attempt to better fit in with his new classmates, Jake accepts flirtatious classmate Baja's (Amber Heard) invitation to a raucous party. There, the short-fused newcomer is lured into a fight and badly beaten by local bully Ryan McCarthy (Cam Gigandet). But a beam of hope shines through the humiliation when a classmate who sees potential in the defeated fighter informs Jake of a local MMA (Mixed Martial Arts) program run by Jean Roqua (Djimon Hounsou). Despite Jake's preconceived notions regarding MMA, he quickly discovers that it's not just another form of street fighting but a rich new art form that he longs to master. As Roqua takes Jake under his tutelage, it soon becomes apparent that in order to become a true MMA champion, Jake will have to learn patience, discipline, willingness, and reason. This isn't just a quest for revenge, but an opportunity for Jake to finally find out what kind of man he truly is. \n\nRipped with Autogk.\n\nLength: 1 Hour 53 Minutes\n\nFile Type: AVI\n\nFrame Width: 592\n\nFrame Height: 256\n\nFrame Rate: 59fps\n\nAudio\n\nBit Rate: 113kbps","torrent":{"xt":"urn:btih:c535c874e7fdd9a885af37022fd48089653fc860","amp;dn":"Never+Back+Down%282008%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c535c874e7fdd9a885af37022fd48089653fc860","infoHashBuffer":{"type":"Buffer","data":[197,53,200,116,231,253,217,168,133,175,55,2,47,212,128,137,101,63,200,96]},"announce":[],"urlList":[]}}