{"title":"EWQL Stormdrum Intakt Library","uid":6652185,"size":3569988208,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:c55a5a4c4de3434b393c4367884ba4a5e4ffdf3d&amp;dn=EWQL+Stormdrum+Intakt+Library&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"is_there_no_one_else","files":36,"time":1315199844,"description":"**\nSTORMDRUM all started when producer NICK PHOENIX decided to go down to the Record Plant in Los Angeles to record some big film grooves for movie trailers he was working on. He hired some the best percussionists in the world (Tal Bergman, Richie Garcia, Michito Sanchez), and filled up Studio A with hundreds of drums. The Record Plant said they had never seen anything like it. After a complex setup, they were ready to roll. Everything was recorded through Neuman mics into an SSL Console to 2 inch analog tape and later transfered to 24 bit, 88.2 digital. Now, after years of recording, editing, and programming, STORMDRUM has arrived!\n\nActually you get 2 libraries when you purchase STORMDRUM. The INTAKT loops and the KOMPAKT multi-samples. There are 2 seperate interfaces, so that each category includes all of the features needed - \n\nKOMPAKT has disk streaming and multi-timbral capability, as well as a host of other multi-sample parameters like auto sample alternation. This is the perfect interface for the multi-sampled kits and percussion.\n\nINTAKT is the ultimate loop manipulation tool, and syncs the loops to the tempo of your sequencer. It has real - time time compression, cool lo-fi effects, and lots of other amazing features like legato looping.\n\nFormat: INTAKT/KOMPAKT\n**\n\n**NOTE: This is a torrent for the INTAKT Library","torrent":{"xt":"urn:btih:c55a5a4c4de3434b393c4367884ba4a5e4ffdf3d","amp;dn":"EWQL+Stormdrum+Intakt+Library","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c55a5a4c4de3434b393c4367884ba4a5e4ffdf3d","infoHashBuffer":{"type":"Buffer","data":[197,90,90,76,77,227,67,75,57,60,67,103,136,75,164,165,228,255,223,61]},"announce":[],"urlList":[]}}