{"title":"Democracy Now - 02 sep 2011","uid":6647049,"size":456861429,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c5b1f4d5b21dbf03394b2a76961ff9875fbeca94&amp;dn=Democracy+Now+-+02+sep+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1314986073,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\n\nHeadlines for Sep 02, 2011\n\n- Gaddafi: &quot;Let Libya Be Engulfed in Flames&quot;\n- World Leaders, Rebels Agree on Unfreezing Libyan Assets\n- Anti-Government Protests Continue in Syria After 7 Killed\n- Turkey Downgrades Israel Ties After U.N. 2010 Flotilla Report\n- Banks to Face Federal Suits Over Mortgage Securities\n- Goldman Sachs Subsidiary Agrees to End &quot;Robo-Signing&quot;\n- Obama Admin Scales Back Economic Growth Projections\n- Earthquake Shifted Nuclear Fuel Casks at Virginia Power Plant\n- Study Finds Link Between 9/11 Debris and Cancer\n- Ohio Sells Prison to Private Firm\n- Guatemala Tests Survivors, Relatives of U.S. Medical Experiments\n- Thousands Denounce Bahraini Monarchy at Funeral for Slain Teen\n- 2 Female Journalists Slain in Mexico\n- WikiLeaks Cable Details U.S. Military Killing of Iraqi Family\n- WikiLeaks Publishes Full, Unredacted Archive of U.S. Cables\n\n\nSpecial reports\n\n- U.S. Wasting Billions While Tripling No-Bid Contracts After Decade of War in Iraq, Afghanistan\n\nAs the war in Afghanistan approaches its 10th anniversary, a pair of new reports reveal how the Pentagon has squandered tens of billions of dollars while tripling the amount of no-bid contracts. The bipartisan Commission on Wartime Contracting concludes that between $31 billion and $60 billion spent on projects in Iraq and Afghanistan over the last 10 years has been lost to waste and fraud. In Afghanistan, the commission found the United States is indirectly funding the Taliban as money diverted from U.S.-backed projects is paid out to militants to ensure safety. Meanwhile, the Pentagon's use of no-bid contracts has tripled since the United States was attacked on 9/11, in spite of promises to reform the controversial practice. A new investigative report from the Center for Public Integrity says no-bid spending has ballooned from $50 billion in 2003 to $140 billion in 2011. We speak with Charles Tiefer, a member of the Commission on Wartime Contracting in Iraq and Afghanistan and a professor of government contracting at the University of Baltimore Law School; and with Sharon Weinberger of the Center for Public Integrity, author of the investigative series &quot;Windfalls of War.&quot; &quot;There are as many contractors in the war zone as there are soldiers. But we haven't adjusted our thinking for it, [and] we haven't adjusted our structure for it,&quot; Tiefer says.\n\n\n- As Turkey Freezes Israel Ties, Critics Decry &quot;Whitewashed&quot; U.N. Report on Gaza Flotilla, Blockade\n\nTurkey has downgraded diplomatic ties with Israel and frozen military co-operation ahead of a long-awaited United Nations report on Israel's deadly attack on a Gaza-bound aid ship in 2010. The report accuses Israel of &quot;excessive and unreasonable&quot; force in its attack on the ship, Mavi Marmara - which killed nine people - and says Israel should issue a statement of regret and compensate the families of the dead as well as wounded passengers. But it also chides passengers aboard the Marmara and the other flotilla ships for what it calls a &quot;reckless&quot; attempt to breach Israel's blockade of the Gaza Strip. In a major development with broader implications, the U.N. report concludes that the Israeli blockade of the Gaza Strip is legal under international law. We speak with Norman Finkelstein, author of several books on the Israel Palestine conflict including, &quot;This Time We Went Too Far: Truth &amp; Consequences of the Gaza Invasion.&quot; We are also joined by Huwaida Arraf, one of the organizers of the Free Gaza movement. Both Arraf and Finkelstein blast the U.N. report, calling it a &quot;whitewash&quot; and &quot;morally debased.&quot;\n\n\n- In Wake of Irene, Rural New Yorkers Turn to Community-run &quot;Watershed Post&quot; Website As Prime News Hub\n\nA growing tropical depression that could drop 15 inches of rain on the Gulf Coast this weekend comes just a week after Hurricane Irene devastated parts of the East Coast. We look at one of the hardest hit areas - the Catskills region of New York. While flood waters have largely receded, the cleanup and rebuilding effort has just begun and will take months. At least 600 homes and 140,000 acres of farmland have been destroyed. State officials estimate 150 major highways need to be partially rebuilt and 22 state bridges have been closed, leaving some sections of the Catskills completely cut off. New York Gov. Andrew Cuomo says that the state faces $1 billion in damages from the powerful tropical storm. We speak with Lissa Harris, an editor of the Watershed Post, a website based in the Catskills that has become one of the region's main sources of news of the disaster.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:c5b1f4d5b21dbf03394b2a76961ff9875fbeca94","amp;dn":"Democracy+Now+-+02+sep+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5b1f4d5b21dbf03394b2a76961ff9875fbeca94","infoHashBuffer":{"type":"Buffer","data":[197,177,244,213,178,29,191,3,57,75,42,118,150,31,249,135,95,190,202,148]},"announce":[],"urlList":[]}}