{"title":"Tiramisu (2008) NL+Eng Subs DD5.1 NL NTSC Retail  TBS","uid":6509203,"size":3991183270,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c62375f1c679938c1f085aa9324c592d75c35a0e&amp;dn=Tiramisu+%282008%29+NL%2BEng+Subs+DD5.1+NL+NTSC+Retail++TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Saggin","files":-1,"time":1309555919,"description":"Tiramisu (2008) NL+Eng Subs DD5.1 NL NTSC Retail\n\n\nNederland\nDrama\n90 minuten\n\ngeregisseerd door Paula van der Oest\nmet Anneke Blok, Jacob Derwig en Olga Zuiderhoek\n\nAnne (Anneke Blok) is een getalenteerd en flamboyant actrice. Ze woont op een woonboot in de binnenhaven van Amsterdam, samen met haar dochter Masja. Ze is een jaar of drie geleden gescheiden van Lex. Iedereen is dol op Anne, haar mede-acteurs zijn in feite haar familie. Na het thuiskomen van een premiÃƒÂ¨re, valt Anne met haar dronken kop van de trap van de kade. De volgende dag wordt ze gewekt door de deurbel. Met bonkend hoofd en een opgezwollen enkel doet ze open en staat tot haar verbazing oog in oog met een keurige, enigszins burgerlijke man met een koffertje in zijn hand. Hij stelt zich voor als Jacob, haar nieuwe boekhouder. Jacob schrikt wanneer hij ontdekt dat Anne het niet zo nauw neemt met haar uitgaven en enorme schulden heeft. Anne lijkt in eerste instantie niet erg onder de indruk, maar wanneer het tot haar doordringt wat er aan de hand is, raakt ze langzaam maar zeker in blinde paniek, ze wil haar geliefde woonboot absoluut niet kwijt.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/40603&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/40603&lt;/a&gt;\n\nNetherlands\ndrama\n90 minutes\n\ndirected by Paula van der Oest\nAnneke Blok, Jacob and Olga Derwig Zuiderhoek\n\nAnne (Anneke Blok) is a talented actress and flamboyant. She lives on a houseboat in the harbor of Amsterdam, with her daughter Masha. She was three years ago, separated from Lex. Everybody loves Anne, her co-actors are in fact her family. After coming home from a premiere, Anne is intoxicated with her head down the stairs from the wharf. The next day she is awakened by the doorbell. With throbbing head and a swollen ankle she does and is open to her surprise face to face with a neat, slightly bourgeois man with a briefcase in his hand. He introduces himself as Jacob, her new accountant. Jacob shocked when he discovers that Anne does not approve of her spending and enormous debt. Anne seems to be not very impressed, but when it penetrates her what was going on, she gets slowly in blind panic, she wants her beloved houseboat really do not.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0875701&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0875701&lt;/a&gt;\n\n\nSpotinformatie\n\nInfo:\nBron             : Retail\nFormaat          : DVD5 \nAudio            : Nederlands DD 5.1\nOndertiteling    : Nederlands, Engels\nBeeldverhouding  : 4:3\nFramerate        : 29,970 fps\nStandaard        : NTSC\nMenu             : Ja\nExtra's          : Ja\nCover            : Nee","torrent":{"xt":"urn:btih:c62375f1c679938c1f085aa9324c592d75c35a0e","amp;dn":"Tiramisu+%282008%29+NL%2BEng+Subs+DD5.1+NL+NTSC+Retail++TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c62375f1c679938c1f085aa9324c592d75c35a0e","infoHashBuffer":{"type":"Buffer","data":[198,35,117,241,198,121,147,140,31,8,90,169,50,76,89,45,117,195,90,14]},"announce":[],"urlList":[]}}