{"title":"Old School(2003)DVDRip.AC3(ENG)-DROCK","uid":6630953,"size":731572895,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c7382e3c598d809f6346957d6a3b3dc958d477a1&amp;dn=Old+School%282003%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1314365993,"description":"Three men relive their carefree college years by killing off as many brain cells as possible in this over-the-top comedy. Mitch (Luke Wilson) returns home from a less-than-pleasant business trip one evening to discover his wife, Heidi (Juliette Lewis), involved in a mÃƒÂ©nage ÃƒÂ  trois with two blindfolded strangers. Feeling less than welcome at home after this, Mitch rents a house near the campus of a nearby college; two of Mitch's old college buddies, Beanie (Vince Vaughn) and Frank (Will Ferrell), stop by to cheer him up. They soon become regular guests at Mitch's place, despite the fact that Frank only recently wed Marissa (Perrey Reeves), while Beanie and his wife, Lara (Leah Remini), are busy with two kids. Beanie decides to throw a housewarming party for Mitch, and since Beanie sells audio equipment for a living, he's able to trick out the big bash with a massive PA system and an appearance by Snoop Dogg. Mitch soon finds he's the not-entirely-willing proprietor of the school's leading party spot, which raises the ire of Pritchard (Jeremy Piven), a dean at the college who was the target of Mitch, Frank, and Beanie's abuse when they were all students. Pritchard arranges to have Mitch's neighborhood zoned into a student housing district, but Beanie and Frank respond by forming a fraternity and making Mitch's home their headquarters. Mitch, however, is not enthusiastic about the idea, especially as he's trying to impress Nicole (Ellen Pompeo), a beautiful divorcee who is less than enchanted with Frank and Beanie's &quot;party hearty&quot; lifestyle. Old School director Todd Phillips knows more than a bit about the seamy side of fraternity life as director of the infamous unreleased documentary Frat House. \n\nRipped with Handbrake.\n\nLength: 1 Hour 32 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:c7382e3c598d809f6346957d6a3b3dc958d477a1","amp;dn":"Old+School%282003%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7382e3c598d809f6346957d6a3b3dc958d477a1","infoHashBuffer":{"type":"Buffer","data":[199,56,46,60,89,141,128,159,99,70,149,125,106,59,61,201,88,212,119,161]},"announce":[],"urlList":[]}}