{"title":"Smart Cameras{BBS}","uid":6656929,"size":12424182,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c7f080d14ad7afde23de6815a18149bfeccae47b&amp;dn=Smart+Cameras%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1315354806,"description":"A smart camera is an integrated machine vision system which, in addition to image capture circuitry, includes a processor, which can extract information from images without need for an external processing unit, and interface devices used to make results available to other devices. This book provides content on smart cameras for an interdisciplinary audience of professionals and students in embedded systems, image processing, and camera technology. It serves as a self-contained, single-source reference for material otherwise found only in sources such as conference proceedings, journal articles, or product data sheets. Coverage includes the 50 year chronology of smart cameras, their technical evolution, the state-of-the art, and numerous applications, such as surveillance and monitoring, robotics, and transportation.\nFrom the Back Cover\n\nSmart Cameras\n\nEdited by: Ahmed Nabil Belbachir\n\nAlthough there are many &quot;definitions&quot; of smart cameras offered by the media, camera manufacturers and developers, still no binding definition exists. For the purpose of this book, a smart camera is defined as a vision system which, in addition to image capture circuitry, is capable of extracting application-specific information from the captured images, along with generating event descriptions or making decisions that are used in an intelligent and automated system. This book provides a single-source reference, with content from several disparate scientific, technological and commercial aspects related to smart cameras: photoreceptors, pixels, signal processing, image sensor architectures, embedded systems, computer vision, sensor networks, applications of smart cameras and market trends. It provides background information, fundamentals, and an overview of the historical evolution, applications and the latest trends in intelligent camera concepts for professionals, researchers and practitioners.\n\n    * Provides information on smart cameras for an interdisciplinary audience (embedded systems; image processing; camera technology) of professionals, practitioners and students;\n\n    * Integrates coverage of hardware electronics, signal processing, embedded computing, computer vision, sensor networks and smart camera applications in surveillance, machine vision and the automotive industry;\n\n    * Includes an analysis of the smart camera market evolution, based on interviews with market leaders.\n\nProduct Details\n\n    * Hardcover: 424 pages\n    * Publisher: Springer; 1 edition (December 2, 2009)\n    * Language: English\n    * ISBN-10: 1441909524\n    * ISBN-13: 978-1441909527","torrent":{"xt":"urn:btih:c7f080d14ad7afde23de6815a18149bfeccae47b","amp;dn":"Smart+Cameras%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7f080d14ad7afde23de6815a18149bfeccae47b","infoHashBuffer":{"type":"Buffer","data":[199,240,128,209,74,215,175,222,35,222,104,21,161,129,73,191,236,202,228,123]},"announce":[],"urlList":[]}}