{"title":"Rush Hour 3 (2007)(IPOD)","uid":6657630,"size":561211790,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:c8ce74e5d719be74a4f3b5d26d9be284b67abce0&amp;dn=Rush+Hour+3+%282007%29%28IPOD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bog23man","files":-1,"time":1315381683,"description":"The Chinese Triads have a secret to keep n Jackie and Tucker sets out to Paris to find what the secret is. This forms the pin-point juncture of the movie surrounding which the plot revolves. Fun Packed, with a large chunk of recycled jokes with too little of Jackie Chan action , thats what I felt of the movie from a totally neutral perspective.But being a Jackie Chan fan that I am , the movie is an entertainer with loads of fun n chicks. Rush hour 3 evolves on predictable lines ,but still entertainment quotient remains pretty high throughout. The on screen chemistry between Jackie Chan and Chris Tucker is simply rocking . But for an avid Jackie fan like me nothing pains more than a movie , with him in the rolls and yet , not having the traditional breathtaking Jackie Stunts. But for a man aged 53 Jackie is still more fast , agile and flexible than most of his much younger co-stars. The last stunt atop the Eiffel tower was a masterstroke with Jackie and Tucker defying height and gravity to put up a creditable show .But yeah, the movie ought to be a disappointment for those who expected a still young, reckless and crazy Jackie running around and kicking arse of the do-no-gooders. There is less of the traditional slap stick comedy that one associates with Jackie Chan movies. On the whole, a must watch for Jackie fans with a very high quotient of entertainment value \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0293564/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0293564/&lt;/a&gt;","torrent":{"xt":"urn:btih:c8ce74e5d719be74a4f3b5d26d9be284b67abce0","amp;dn":"Rush+Hour+3+%282007%29%28IPOD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8ce74e5d719be74a4f3b5d26d9be284b67abce0","infoHashBuffer":{"type":"Buffer","data":[200,206,116,229,215,25,190,116,164,243,181,210,109,155,226,132,182,122,188,224]},"announce":[],"urlList":[]}}