{"title":"canaima-3.0~estable i386.iso","uid":6517673,"size":733325312,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:c9702a8cf5414e104f6c9f02433fb2b5cb5a2f1d&amp;dn=canaima-3.0%7Eestable+i386.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"neocis","files":1,"time":1309884754,"description":"Canaima 3.0 representa fundamentalmente un cambio de paradigma tecnolÃƒÂ³gico destinado mejorar la forma en que los colectivos o comunidades participan en el proceso de creaciÃƒÂ³n de Software Libre. TambiÃƒÂ©n, ÃƒÂ©sta versiÃƒÂ³n incorpora elementos visuales y aplicativos innovadores, software desarrollado por comunidades nacionales, entre muchas de las bondades que podemos mencionar.\n\nCanaima 3.0 representa fundamentalmente un cambio de paradigma tecnolÃƒÂ³gico destinado mejorar la forma en que los colectivos o comunidades participan en el proceso de creaciÃƒÂ³n de Software Libre. TambiÃƒÂ©n, ÃƒÂ©sta versiÃƒÂ³n incorpora elementos visuales y aplicativos innovadores, software desarrollado por comunidades nacionales, entre muchas de las bondades que podemos mencionar brevemente a manera de preÃƒÂ¡mbulo.\n\nCanaima 3.0 tiene las siguientes caracterÃƒÂ­sticas: Nuevas aplicaciones por defecto:\nDeluge: Gestor de descargas torrent ligero basado en Python.\nEmesene: Cliente de MensajerÃƒÂ­a instantÃƒÂ¡nea MSN basado en Python.\nTurpial: Cliente de twitter e identi.ca basado en Python, desarrollado por comunidades venezolanas.\nExaile: Reproductor multimedia integral basado en Python.\nLibreOffice: Suite ofimÃƒÂ¡tica basada en OpenOffice, libre de restricciones corporativas.\nCanaima Notas: AplicaciÃƒÂ³n propia desarrollada para facilitar el reporte de errores por parte de los usuarios. Publica caracterÃƒÂ­sticas de hardware en la plataforma notas.canaima.softwarelibre.gob.ve.\nCunaguaro: Navegador web basado en Iceweasel, adaptado a la plataforma Canaima y con mejoras de rendimiento. Desarrollador por comunidades venezolanas.\nGuÃƒÂ¡charo: Cliente de correo basado en Icedove, adaptado a la plataforma Canaima. Desarrollador por comunidades venezolanas.\nShotwell: Visor de imÃƒÂ¡genes con diversas funcionalidades.\nSimple Scan: Gestor de scÃƒÂ¡neres.\n Otras aplicaciones:\nCanaima Desarrollador: Conjunto de ayudantes y herramientas que asisten en el proceso de creaciÃƒÂ³n de software.\nCanaima Semilla: Herramienta para la creaciÃƒÂ³n de ISO's basadas en sabores de Canaima.\nCanaima ContraseÃƒÂ±a: Asistente de cambio de contraseÃƒÂ±a para los usuarios de las computadoras distribuÃƒÂ­das por los fabricantes (VIT, CANTV, Siragon, etre otros).\nCanaima Restaurar: Permite restaurar el Sistema Operativo a su estado inicial de InstalaciÃƒÂ³n.\nCanaima Curiara: Visor HTML ligero y de alto rendimiento basado en Python-Webkit.\n AgrupaciÃƒÂ³n de paquetes a travÃƒÂ©s de metapaquetes temÃƒÂ¡ticos (canaima-web, canaima-ofimatica, canaima-multimedia, entre otros). CreaciÃƒÂ³n de un nuevo estilo visual:\nNuevo tema GTK para la decoraciÃƒÂ³n de las ventanas.\nNuevo tema Metacity para los bordes de las ventanas.\nNuevo set de ÃƒÂ­conos basados en el tema Faenza Dark.\nIncluÃƒÂ­dos conjunto de 11 wallpapers hechos en comunidad.\nNuevo gestor de inicio Plymouth, con tema adaptado a Canaima.\nNuevo gestor de arranque BURG, con tema adaptado a Canaima.\n Optimizaciones de rendimiento variadas:\nImplementaciÃƒÂ³n de demonios de optimizaciÃƒÂ³n de la experiencia de usuario (prelink, preload, readahead).\nReducciÃƒÂ³n de los demonios que se activan durante el arranque del sistema.\nReducciÃƒÂ³n del factor de swappiness.\nReducciÃƒÂ³n del nÃƒÂºmero de TTY's a 2.\nImplementaciÃƒÂ³n del parche de Lennart Poettering.\nAÃƒÂ±adiendo la opciÃƒÂ³n de noatime a los discos donde sea pertinente en /etc/fstab.\n GeneraciÃƒÂ³n del sabor canaima-primera-base, que es una base mÃƒÂ­nima de canaima, destinado a ser la fuente de los demÃƒÂ¡s sabores. Profunda reestructuraciÃƒÂ³n del sistema de paquetes de canaima, basÃƒÂ¡ndose en la metodologÃƒÂ­a git-buildpackage para la generaciÃƒÂ³n de paquetes binarios a travÃƒÂ©s de paquetes fuente.","torrent":{"xt":"urn:btih:c9702a8cf5414e104f6c9f02433fb2b5cb5a2f1d","amp;dn":"canaima-3.0%7Eestable+i386.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9702a8cf5414e104f6c9f02433fb2b5cb5a2f1d","infoHashBuffer":{"type":"Buffer","data":[201,112,42,140,245,65,78,16,79,108,159,2,67,63,178,181,203,90,47,29]},"announce":[],"urlList":[]}}