{"title":"Deus Ex Human Revolution v2-BlackBox","uid":6646140,"size":3184461159,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c9969a746a700f07440aa0de72c9d5be3dac58ca&amp;dn=Deus+Ex+Human+Revolution+v2-BlackBox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DibyaTPB","files":35,"time":1314955658,"description":"experimental biotechnology firms.\n\nBut when a black ops team uses a plan you designed to break in and kill the scientists you were hired to protect,\neverything you thought you knew about your job changes.\n\n- The long-awaited return of the award winning franchise that blends the best of Action and RPG: the perfect mix\nof combat, stealth, hacking, and social gameplay.\n\n- Play as Adam Jensen, a mechanically augmented agent: customize and upgrade your character with more than 50\nunique augmentations that support your style of play.\n\n- Deadly weapons: Over 20 available weapons, each with their own customizable elements.\n\n- Fight enemies including dangerous thugs, augmented special operations soldiers, advanced robots;\nand engage in epic boss battles.\n\n- Live the reactive and dangerous world: your choices will have consequences in the game's world.\n\n- Play in an open-ended world: there are always multiple solutions to every challenge.\n\n- Engage the unique Cyber Renaissance setting: discover a unique world that blends near future and\nRenaissance elements.\n\n- Travel the world: visit multiple unique locations across the globe each with their own design, story and gameplay elements.\n\n- Become involved in vast global conspiracy: unravel the story - discover who you can really trust.\n\n- Decide humanity's future: the decision you make and the actions you take will lead to an ultimate decision\non mankind's future.\n\nFor the people with low bandwidth, here is my gift to you! :D","torrent":{"xt":"urn:btih:c9969a746a700f07440aa0de72c9d5be3dac58ca","amp;dn":"Deus+Ex+Human+Revolution+v2-BlackBox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9969a746a700f07440aa0de72c9d5be3dac58ca","infoHashBuffer":{"type":"Buffer","data":[201,150,154,116,106,112,15,7,68,10,160,222,114,201,213,190,61,172,88,202]},"announce":[],"urlList":[]}}