{"title":"Zygor Leveling Guides 3.1.2563 (July 28th, 2011)","uid":6570859,"size":3062553,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c9aa236f9b9f350ea82b042218a97ba568cf216b&amp;dn=Zygor+Leveling+Guides+3.1.2563+%28July+28th%2C+2011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"forland91","files":-1,"time":1311965657,"description":"Please help seed!\n\nInstructions:\n-------------------\n1. Download.\n2. Extract.\n3. Copy extracted folders to your WoW/Interface/AddOns folder.\n   - Both Horde and Alliance folders are included, if you don't play both, don't worry, WoW will only load the appropriate guide.\n4. Launch WoW.\n5. Once you are logged in and at your character screen, click the AddOns button and make sure that ZygorGuidesViewer and ZygorTalentAdvisor are checked.\n6. Launch the game and enjoy.\n\nBug Fixes:\n-------------------\nJuly 28th, 2011\n\nAlliance Guides Change Log:\n* Lowered Western Plaguelands minimum level required, so players can be sent there after The Hinterlands\n* Western Plaguelands quests and levels rearranged due to lower Western Plaguelands entry level.\n* Eastern Plaguelands quests and levels rearranged due to lower Western Plaguelands entry level.\n* Badlands quests and levels rearranged due to lower Western Plaguelands entry level.\n* Searing Gorge quests and levels rearranged due to lower Western Plaguelands entry level.\n* Burning Steppes quests and levels rearranged due to lower Western Plaguelands entry level.\n* (not completed) Swamp of Sorrows quests and levels rearranged due to lower Western Plaguelands entry level.\n* (not completed) Winterspring quests and levels rearranged due to lower Western Plaguelands entry level.\n* (not completed) Blasted Lands quests and levels rearranged due to lower Western Plaguelands entry level.\n* Added additional coordinates to step 12 in Eastern Plaguelands guide\n* Added coordinates to step 3 in Badlands guide\n* Added routes and detection to Zangarmarsh quest &quot;The Sporelings' Plight&quot; to make sure if this quest is bugged and player cannot continue, then the guide will help them get their rep up to be able to continue.\n* Various fixes in Eastern Kingdoms 1-60 guide\n* Added Voidwraiths for a mob to be killed for Netherstorm quest &quot;Recipe for Destruction&quot;\n\nHorde Guides Change Log:\n* Added routes and detection to Zangarmarsh quest &quot;The Sporelings' Plight&quot; to make sure if this quest is bugged and player cannot continue, then the guide will help them get their rep up to be able to continue.\n* Added Voidwraiths for a mob to be killed for Netherstorm quest &quot;Recipe for Destruction&quot;\n\nGuides Viewer Change Log:\n* Added a notification that displays when the end of a guide has been reached.\n* Gray guide titles in the guide menu have different meanings: Leveling Guide = Obsolete, All Other Guide Types = Completed\n* Added / Edited NPCs\n\nTalent Advisor Change Log:\n* Added Dual Spec talent build support (assigned to the CURRENT spec only; simply switch spec to assign the other one)\n* Talent Advisor config screen now updates in real-time\n* All pet talent builds are remembered individually, with player's dual spec in mind\n* (Hunters) Warning is issued when selecting a non-Beast Master pet build on a Beast Master hunter (and vice versa). You can still use it like that, though.\n\nOther changes:\nAlliance Dailies Guide:\n* Cleaned up Firelands content a bit\n* Added more new Firelands content\n\nHorde Dailies Guide:\n* Cleaned up Firelands content a bit\n* Added more new Firelands content\n\nJuly 28th, 2011\n\nAlliance Guides Change Log:\nFirelands Dailies:\nTypo fixed.\nfixing WPL 34-40 to reflect the levels it has been adjusted to.\nhad to do some minor re-arranging to the quests done in the guide.\nfixed step 70 in the western plaguelands 34-40 guide.\nWPL guide is now finalized at 34-39\nEPL guide is changed to 39-45 at the moment\nAdded additional coordinates to step 12, EPL 39-45 guide.\nadded up to ding 44 in EPL 39-45 guide\nlevel 34 to 44\nChanged EPL to 39-44 (final)\nadded coordinates to step 3 in badlands guide\nAdded lots of routs and detecters to a bugged quest in Zangarmarsh to make sure if this quest is bugged and customer cannot continue, then they will have routers to help them get their rep up to be able to continue. (quest - The Sporelings' Plight##9739)\nLoch Modan; changed Npc ID to the correct ID (was set to quest ID number).\nDecolace, 30-37; Changed description of location to be more understanding (not going towards Horde Hub Ghost Walker Post, but to the Kodo Graveyard).\nVarious fixes from 1-33\nNetherstorm - Added in Voidwraiths for a mob to be killed for quest &quot;Recipe for Destruction&quot;##10437\n\nHorde Guides Change Log:\nFirelands Dailies:\nTypo fixed.\nAdded lots of routs and detecters to a bugged quest in Zangarmarsh to make sure if this quest is bugged and customer cannot continue, then they will have routers to help them get their rep up to be able to continue. (quest - The Sporelings' Plight##9739)\nChanged Borean Tundra, step 175 added NPC's to kill for quests.\nNetherstorm - Added in Voidwraiths for a mob to be killed for quest &quot;Recipe for Destruction&quot;##10437\n\nTalents Change Log:\n\nGuides Viewer Change Log:\n* Enabled a warning when the end of a guide is reached.\n* Modified guide status display for cases of gray: it's &quot;Obsolete&quot; for leveling guides, &quot;Complete&quot; for others.\n\nTalent Advisor Change Log:\n* Dual-spec support.\n* config screen updates real-time\n* dual character builds are remembered (assigned to the CURRENT spec only; simply switch spec to assign the other one)\n* all pets are remembered individually, with player's dual spec in mind.\n* warning is issued when selecting a non-BM pet build on a BM hunter (and vice versa). You can still use it like that, though.\n\nOther changes:\nNPC:\nAdded tip to Durak in Ashenvale. (in localization) &quot;At the back of this Splintree Mine\n\nZygor Guides Info:\n-------------------\nThe Cataclysm is upon us! Level from 1-85 now with the fastest, most feature rich guide in the world.\n\n    Completely Redesigned Minimalist User Interface. Switch Between Full or Mini View Modes, the choice is yours\n    4 Full 1-60 Guides For Kalimdor &amp; Eastern Kingdoms. 40 Zones Covered, 12 More Than Competing Guides\n    2 Full 60-70 Guides For Outland and Northrend\n    5 Full 80-85 Guides For All Cataclysm Zones\n    Goblin and Worgen Starter Guides Included\n    In-Game Talent Build Advisor For All Skill Trees\n    Built In Waypoint Arrow, No TomTom Or Other Addons Needed\n    NEW! Loremaster Achievement Guide\n    All Dailies Covered for both Cataclysm and Wrath of the Lich King.\n    Covers all Prerequisites Required To Unlock Dailies including full zone guides for Uldum and Deepholm.\n    Speed Gold Runs Make You Over 300 Gold In Just An Hour\n    Includes All 10 Seasonal Events Needed For The What A Long, Strange Trip It's Been Achievement\n    Get Your Crusader Title And Earn Epic &amp; Heirloom Items\t\t","torrent":{"xt":"urn:btih:c9aa236f9b9f350ea82b042218a97ba568cf216b","amp;dn":"Zygor+Leveling+Guides+3.1.2563+%28July+28th%2C+2011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9aa236f9b9f350ea82b042218a97ba568cf216b","infoHashBuffer":{"type":"Buffer","data":[201,170,35,111,155,159,53,14,168,43,4,34,24,169,123,165,104,207,33,107]},"announce":[],"urlList":[]}}