{"title":"Egyptian Mythology A to Z{BBS}","uid":6644745,"size":7676367,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9cd27936f91161b16650c0545eb3b5dbaeff200&amp;dn=Egyptian+Mythology+A+to+Z%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1314903190,"description":"Facts On File has previously published two volumes in the Mythology A to Z series, Norse Mythology A to Z (1991) and Greek and Roman Mythology A to Z (1992). This title, like its predecessors, has more than 400 entries, which are alphabetically arranged. Subjects include beliefs, deities, festivals, places, plants and animals, rituals and ceremonies, rulers and other notable people, symbols, and texts, among other topics. Entries vary in length from one sentence to more than two pages. One of the longest entries, Isis, is more than four pages, with subheadings for different aspects of the goddess's cult. Horoscope calendar includes a day-by-day calendar showing the auspices for the first month of Akhet, or Inundation.Coverage and access can be inconsistent. Although there are entries for Cat, Dog, Horse, and other animals, there is no entry for snakes. Student must rely on the index, where all the various references to snakes are cited. The only way to find information on frankincense and myrrh is to browse through the entry on Incense , because neither of these resins used in the mummification process appears as an entry or as an index term.Bolstering the A-Z entries, a helpful introduction provides a succinct history of Egypt and a brief explanation of how we've come to understand Egypt's mythology. A one-page time line lists dates from the Predynastic Period (5500-3100 B.C.) to the Roman Period (30 B.C.-A.D. 395).A useful teacher resource book that would provide activities for the same audience is Hands-on Culture of Ancient Egypt (Walch, 1997). For the activity titled &quot;Medicine and Magic: Amulets,&quot; students might refer to the entry Amulet in the Facts On File title to learn what they were made of and how they were used. \nAlphabetically arranged definitions present an overview of Egyptian mythology from the Predynastic period through the Roman period. --This text refers to an out of print or unavailable edition of this title.\nProduct Details\n\n    * Reading level: Young Adult\n    * Hardcover: 242 pages\n    * Publisher: Facts on File; 2 Revised edition (September 2006)\n    * Language: English\n    * ISBN-10: 0816063060\n    * ISBN-13: 978-0816063062","torrent":{"xt":"urn:btih:c9cd27936f91161b16650c0545eb3b5dbaeff200","amp;dn":"Egyptian+Mythology+A+to+Z%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9cd27936f91161b16650c0545eb3b5dbaeff200","infoHashBuffer":{"type":"Buffer","data":[201,205,39,147,111,145,22,27,22,101,12,5,69,235,59,93,186,239,242,0]},"announce":[],"urlList":[]}}