{"title":"Forza Italia (documentario 1978) [DVDrip ITA] TNT Village","uid":6610924,"size":714456134,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c9edd18fd325bf259ec5c9b18cfaf79298748a78&amp;dn=Forza+Italia+%28documentario+1978%29+%5BDVDrip+ITA%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"l.diliberto","files":1,"time":1313588255,"description":"Forza Italia (documentario 1978) [DVDrip ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=70673&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=70673&lt;/a&gt;\n\n.: Trama :.\n\nAntesignano del cinema di satira italiano, uscito il 12 gennaio 1978 nelle sale cinematografiche e subito sequestrato, ÃƒÂ¨ un film di montaggio che ripercorre trent'anni di potere democristiano in Italia, dal viaggio di Alcide De Gasperi in USA (1947) al congresso della DC del 1976. Senza commento fuori campo il film, ritratto comico e crudele della lunga egemonia democristiana sulla politica nazionale, conserva generalmente l'integritÃƒÂ  audiovisiva dei documenti scelti; la manipolazione consiste nell'inserire qua e lÃƒÂ  battute, parole, rumori che acquistano dal contesto un significato umoristico, satirico, derisorio. Il risultato ÃƒÂ¨ quello di un pamphlet politico ora lepido ora feroce, talvolta goliardico, una graffiante traversata dell'Italia ufficiale da cui sono esclusi i partiti di opposizione, i sindacati, le masse operaie. Si puÃƒÂ² anche parlare di documentario antropologico perchÃƒÂ© quel che impressiona, e fa riflettere, sono le facce, i movimenti, i gesti dei notabili, dei potenti, dei padroni del Palazzo. R. Faenza ebbe come collaboratori Mario Bocca, Marco Tullio Giordana e i giornalisti Carlo Rossella e Antonio Padellaro.\n\nIl film comprende:\n\nIl viaggio di Alcide De Gasperi in America nel 1947.\nLa cacciata del Partito Comunista Italiano dal governo di unitÃƒÂ  nazionale.\nL'istituzione del Piano Marshall di aiuti economici americani per la ricostruzione dell'Europa, in particolare ÃƒÂ¨ descritta la situazione italiana.\nLe elezioni politiche del 1948, mettendo in evidenza l'utilizzo da parte dei partiti di frasi come: Ã‚Â«Dio ti vede, Stalin noÃ‚Â», i comizi di Padre Lombardi.\nIl festival canoro di Sanremo.\nNunzio Filogamo che presenta in televisione (la RAI, unica TV esistente) &quot;La rassegna del dilettante&quot;.\nLa &quot;Mostra dell'aldilÃƒÂ &quot;, che presentava in modo atroce la situazione economica e sociale dell'Europa di oltrecortina.\nLa sconfitta della Democrazia Cristiana, comandata da De Gasperi,nelle elezioni del 1953.\nLa sciagura provocata dal crollo della diga del Vajont, nel Veneto, 1963.\nL'elezione dell'onorevole Giuseppe Saragat alla presidenza della Repubblica, nel 1964.\nLa strage di Piazza Fontana, a Milano, nel 1969.\nLa contestatissima visita del presidente americano Richard Nixon in Italia, all'epoca della guerra del Vietnam.\nIl Papa Paolo VI (Giovannni Battista Montini) che assiste ad un comizio televisivo di Amintore Fanfani osteggiando il referendum a favore del divorzio.\nViene mostrato il Presidente della Repubblica Giovanni Leone, mentre pubblicamente esegue il gesto scaramantico di Ã‚Â«fare le cornaÃ‚Â».\nPresenta spezzoni di filmati sul congresso della Democrazia Cristiana di Roma del 1976, narrando di come non sembra esserci alcun seguito alla promessa (fatta piÃƒÂ¹ volte nei decenni anteriori) di rinnovare finalmente la DC, rendendola piÃƒÂ¹ Ã‚Â«trasparenteÃ‚Â» nelle sue decisioni, e piÃƒÂ¹ flessibile nell'elezione di nuovi volti dirigenziali, tra questi Aldo Moro.\n\nCuriositÃƒÂ :\n\nIl film esce nelle sale nell'inverno 1977-1978, poco tempo prima del sequestro dell'onorevole Aldo Moro, allora presidente della Democrazia Cristiana. In seguito a questo evento, in base ad una richiesta del Ministero dell'Interno, il film venne ritirato dalle sale, fu praticamente ostracizzato da successive proiezioni sul grande schermo, ed ÃƒÂ¨ molto raro che appaia in qualche palinsesto televisivo.\nA quindici anni di distanza dalla Ã‚Â«scomparsaÃ‚Â» dagli schermi, il film venne trasmesso su Raitre domenica 7 novembre 1993, nell'ambito del programma Italiani brava gente di Giancarlo Santalmassi; il giorno dopo un ufficiale dei carabinieri, su ordine della procura di Palermo, si recÃƒÂ² nella sede RAI di Saxa Rubra per sequestrare una copia del film; pare che in alcuni fotogrammi comparisse, a fianco di persone sospette per mafia, Giulio Andreotti.\nRecente ridistribuzione del film in DVD assieme ad un libro dello stesso autore: nel 2006 la Rizzoli l'ha distribuito nelle librerie assieme ad un libro (interventi di: Roberto Faenza, Marco Tullio Giordana, Antonio Padellaro, Carlo Rossella, Gian Antonio Stella, Paolo Mereghetti, Manuel Gandin), con il titolo : &quot;Forza Italia! Il ritratto piÃƒÂ¹ divertente, spietato, censurato della Prima Repubblica.&quot;\n\n&quot;Un documentario antropologico piÃƒÂ¹ che storico o politico. Per dirla con Pasolini, un viaggio nel tempo all'interno del Palazzo.&quot; (Morando Morandini, Il Giorno)\n\n&quot;Un gioiellino cinematografico... bello, interessante, divertente, intelligente senza essere cervellotico.&quot; (Lotta Continua)\n\n&quot;29 gennaio. Tanto per tirarmi su il morale, vedo il film Viva l'Italia [sic], composto con pezzi di repertorio in una chiave duramente antidemocristiana. E poi ci si accusa di arroganza di potere.&quot; (Giulio Andreotti, Diari 1976-1979)\n\n&quot;E per chi abbia visto Forzo Italia! fa impressione il linguaggio estremamente spregiudicato che i democristiani usano al congresso tra un applauso e l'altro all'onorevole Zaccagnini.&quot; (dal Memoriale di Aldo Moro)\n\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img100.imageshack.us/img100/6547/gallery197271nt.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img100.imageshack.us/img100/6547/gallery197271nt.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nNazionalitÃƒÂ : Italia\nAnno: 1978\nGenere: Documentario satirico\nRegia: Roberto Faenza\nData di uscita: 12 gennaio 1978\nAutori: Mario Bocca\nRoberto Faenza\nMarco Tullio Giordana\nAntonio Padellaro\nCarlo Rossella.\n\n.: Screenshot :.\n\n[img]http://img169.imageshack.us/img169/3707/ndvd0095he.png[/img]\n\n0=============================0\n\n.: Info Ripping :.\n\nFilesize.....: 681 MB (or 697,711 KB or 714,456,134 bytes)\nRuntime......: 01:25:29 (128,220 fr)\nVideo Codec..: XviD\nVideo Bitrate: 975 kb/s\nAudio Codec..: 0x0055(MP3) ID'd as MPEG-1 Layer 3\nAudio Bitrate: 131 kb/s (65/ch, stereo) VBR\nFrame Size...: 480x360 (1.33:1) [=4:3]","torrent":{"xt":"urn:btih:c9edd18fd325bf259ec5c9b18cfaf79298748a78","amp;dn":"Forza+Italia+%28documentario+1978%29+%5BDVDrip+ITA%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9edd18fd325bf259ec5c9b18cfaf79298748a78","infoHashBuffer":{"type":"Buffer","data":[201,237,209,143,211,37,191,37,158,197,201,177,140,250,247,146,152,116,138,120]},"announce":[],"urlList":[]}}