{"title":"Michael Oher","uid":6590274,"size":1129004,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ca1cd99ee0bf192d14314bcf82c2e833b87112d8&amp;dn=Michael+Oher&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":51,"time":1312798669,"description":"Michael Oher is the young man at the center of the true story depicted in The Blind Side movie (and book) that swept up awards and accolades. Though the odds were heavily stacked against him, Michael had a burning desire deep within his soul to break out of the Memphis inner-city ghetto and into a world of opportunity. While many people are now familiar with Oher\\\\\\'s amazing journey, this is the first time he shares his account of his story in his own words, revealing his thoughts and feelings with details that only he knows, and offering his point of view on how anyone can achieve a better life. \n\nLooking back on how he went from being a homeless child in Memphis to playing in the NFL, Michael talks about the goals he had for himself in order to break out of the cycle of poverty, addiction, and hopelessness that trapped his family for so long. He recounts poignant stories growing up in the projects and running from child services and foster care over and over again in search of some familiarity. Eventually he grasped onto football as his ticket out of the madness and worked hard to make his dream into a reality. But Oher also knew he would not be successful alone. With his adoptive family, the Touhys, and other influential people in mind, he describes the absolute necessity of seeking out positive role models and good friends who share the same values to achieve one\\\\\\'s dreams. \n\nSharing untold stories of heartache, determination, courage, and love, I Beat the Odds is an incredibly rousing tale of one young man\\\\\\'s quest to achieve the American dream.","torrent":{"xt":"urn:btih:ca1cd99ee0bf192d14314bcf82c2e833b87112d8","amp;dn":"Michael+Oher","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca1cd99ee0bf192d14314bcf82c2e833b87112d8","infoHashBuffer":{"type":"Buffer","data":[202,28,217,158,224,191,25,45,20,49,75,207,130,194,232,51,184,113,18,216]},"announce":[],"urlList":[]}}