{"title":"New Inventors Videology","uid":6634411,"size":2806481937,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:cb3a877cb725b8a16973a2a2bd17fafde9b70a8d&amp;dn=New+Inventors+Videology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rbourke1","files":28,"time":1314498358,"description":"The New Inventors is an Australian television show, broadcast on ABC1, and hosted by broadcaster and comedian James O'Loghlin. Each episode features three Australian inventions and short video tape packages. IP Australia, a supporter of the program, describes it as a way for Australian inventions to gain publicity and possible entrance into the mass market.[1]\n\nThe 200th episode of the program was broadcast on 29 October 2008.[2]\n\nThe program airs Wednesday nights at 8pm.[3] The grand finale edition for season 7 was broadcast on 23 September 2010 on ABC.\n\nContents [hide]\n1 Episodes\n2 History\n3 References\n4 External links\n \n\n[edit] EpisodesMain article: List of The New Inventors episodes\nEach invention is given time to present its use, economic viability, purpose and niche. The inventors are then queried by a panel of three judges, chosen for each program based on their speciality. The judges include agricultural scientist Chris Russell, CSIRO engineer James Bradfield Moody, designer Alison Page, futurist Mark Pesce, science broadcaster and microbiologist Bernie Hobbs, woodworker Richard Vaughan, designer and inventor Sally Dominguez, materials scientist Veena Sahajwalla, journalist and inventor Christine Kininmonth and inventor and plastic surgeon Dr Fiona Wood.[citation needed]\n\nAt the end of the show the three judges pick a winner, referencing the six criteria of the show: originality, need, safety, design, market and marketability, and manufacture and pricing.[1] The winner of the episode is then in the running to appear in the annual grand final episode, and be named &quot;Inventor of the Year&quot; and join the ranks of the Hills Hoist and the fax machine in Australia's hall of fame of home-grown inventions. The public can vote by SMS or online for their favourite invention, which is then in the running for an annual People's Choice award.\n\n[edit] HistoryIn the 1970s ABC broadcast The Inventors, produced by Beverly Gledhill.[4] The new show is called The New Inventors.\n\n[edit] References","torrent":{"xt":"urn:btih:cb3a877cb725b8a16973a2a2bd17fafde9b70a8d","amp;dn":"New+Inventors+Videology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb3a877cb725b8a16973a2a2bd17fafde9b70a8d","infoHashBuffer":{"type":"Buffer","data":[203,58,135,124,183,37,184,161,105,115,162,162,189,23,250,253,233,183,10,141]},"announce":[],"urlList":[]}}