{"title":"Bosse Broberg - Conspiracy in flat five 2001","uid":6628157,"size":404458912,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cb42941da760785dc718a1872312dca73f51b61a&amp;dn=Bosse+Broberg+-+Conspiracy+in+flat+five+2001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"barber9","files":-1,"time":1314229593,"description":"Bosse Broberg, fÃƒÂ¶dd 1937 i Ludvika, ÃƒÂ¤r en svensk jazztrumpetare, kompositÃƒÂ¶r, musikarrangÃƒÂ¶r och orkesterledare. Han har tidigare varit chef fÃƒÂ¶r jazzavdelningen vid Sveriges Radio.\n\n- - -\n\nRedan under skoltiden framtrÃƒÂ¤dde Broberg som trumpetare i lokala grupper, men startade sin musikaliska bana som dragspelare och lÃƒÂ¤rde sig ÃƒÂ¤ven pianospelandets grunder. Under studier vid Uppsala universitet tog han en fil.kand. med musikvetenskap som huvudÃƒÂ¤mne och bildade dÃƒÂ¤r en egen kvintett som spelade en repertoar inspirerad av Horace Silver och Art Blakeys Jazz Messengers. I det tidiga 60-talet efter en sejour med en kommersiell dansorkester inviterades Broberg att ingÃƒÂ¥ i pianospelande Gugge Hedrenius Stockholmsbaserade bluesorkester.\n\nSom ett tidigt avtryck pÃƒÂ¥ hans arrangÃƒÂ¶rskonst kan nÃƒÂ¤mnas bearbetningen av Tadd Damerons Choose Now, titelspÃƒÂ¥ret pÃƒÂ¥ ett album med Hedrenius grupp som bland annat lanserade trumpetaren Bertil LÃƒÂ¶vgren, altsaxofonisten Christer Boustedt och tenoristen Lennart Aberg. I den amerikanska jazztidskriften Down Beat fick albumet 4,5 poÃƒÂ¤ng av 5 mÃƒÂ¶jliga vilket ansÃƒÂ¥gs som en dÃƒÂ¥ fÃƒÂ¶r tiden ytterst hedersam placering med tanke pÃƒÂ¥ dess utlÃƒÂ¤ndska ursprung.\n\nFram till mitten av 60-talet spelade Broberg regelbundet alternativt med saxofonisterna BÃƒÂ¶rje Fredriksson och Arne Domnerus samt Hedrenius Big Blues Band. 1966 blev han erbjuden att eftertrÃƒÂ¤da Olle Helander som chef fÃƒÂ¶r jazzavdelningen vid Sveriges Radio.\n\n- - -\n\n1967 tog Broberg initiativet till bildandet av den sÃƒÂ¥ kallade Radiojazzgruppen (RJG) som genom ÃƒÂ¥ren kom att framtrÃƒÂ¤da tillsammans med ett antal specialinviterade prominenta jazzprofiler. Mer regelbundet med George Russell, Bob Brookmeyer, Thad Jones, Carla Bley och Palle Mikkelborg, men vid mer enstaka tillfÃƒÂ¤llen ÃƒÂ¤ven Gil Evans, Bill Holman, Mike Westbrook, Kenny Wheeler, Chuck Israels, Michael Gibbs, David Murray, Don Cherry, Anthony Braxton, Chris McGregor, Frank Foster med flera, framfÃƒÂ¶rande deras exklusivt bestÃƒÂ¤llda verk. Dessutom sjÃƒÂ¤lvfallet primÃƒÂ¤rt kompositioner av den inhemska jazzens frÃƒÂ¤msta namn som Jan Johansson, Georg Riedel, Nils Lindberg, Bengt-Arne Wallin, Bengt Hallberg, och Lars Gullin samt yngre kompositÃƒÂ¶rer fÃƒÂ¶r vilka RJG blev plantskola och experimentverkstad i en omgivning som pÃƒÂ¥ den tiden i ÃƒÂ¶vrigt var relativt resursfattig nÃƒÂ¤r det gÃƒÂ¤llde stÃƒÂ¶rre ensembler.\n\n- - -\n\nBroberg upprÃƒÂ¤tthÃƒÂ¶ll befattningen som radiojazzchef i 24 ÃƒÂ¥r. I bÃƒÂ¶rjan av 1990-talet ÃƒÂ¥terknÃƒÂ¶t han sin professionella musikaliska verksamhet bland annat med gamle vÃƒÂ¤nnen och basisten Red Mitchell, med vilken han spelade in albumet West of the Moon, som fick Gyllene Skivan-utmÃƒÂ¤rkelsen som bÃƒÂ¤sta svenska jazzproduktion ÃƒÂ¥r 1994.\n\nFrÃƒÂ¥n och med 1982 var Broberg ocksÃƒÂ¥ medlem i den av Christer Boustedt bildade gruppen CBQ (efter Boustedts dÃƒÂ¶d uttytt Contemporary Bebop Quintet) och speciallanserad i CD:n Blues Ballads and Bebop, en treenighet som ocksÃƒÂ¥ stÃƒÂ¥r som ett slags signum fÃƒÂ¶r Brobergs verksamhet.\n\nSedan 1992 leder Broberg sin egen 15-manna Nogenjagrupp (Non Generation Jazz Soloist Ensemble), vars medlemmar tillhÃƒÂ¶r den svenska jazzeliten och fÃƒÂ¶r vilken han sjÃƒÂ¤lv komponerar och arrangerar allt material. Skivan Regni blev grammisnominerad ÃƒÂ¥r 1995 och Hommage a Maigret fick Orkesterjournalens juryrÃƒÂ¶ster i Gyllene Skivan-omrÃƒÂ¶stningen ÃƒÂ¥r 1997.\n\nSenare albuminspelningar har bland annat gjorts i samarbete med sÃƒÂ¥ngerskan Agneta Baumann (Comes Love och Sentimental Lady). Dessutom finns flera album med Good Morning Blues-gruppen som ÃƒÂ¤r baserad i Uppsala.\n\nI ÃƒÂ¶vrigt finns Broberg pÃƒÂ¥ skiva med bland andra BÃƒÂ¶rje Fredriksson, Gugge Hedrenius Big Blues Band (Blues of Sweden och Blues of Europe) Ove Lind, Arne Domnerus (Mobil), Sandviken Big Band, Ann Kristin Hedmark, Alice Babs, Charlie Norman, Victoria Tolstoy, Berndt Egerbladh, Claes Janson, John HÃƒÂ¶gman, Georg Riedel (Riedaiglia), Tuomo Haapala, Jan Johansson (bland annat dedikationen Trumpeticon), Lennart Aberg (4:an frÃƒÂ¥n albumet 7 pieces), Bengt Hallberg (Spelet om Job).\n\n- - -\n\nKompositioner av Bosse Broberg inkluderar Regni, Hommage a Maigret, S:t George's Bridge, Hej Bej, Chrille, Red Departure, King Valiant, Asfalt Blue, Double Steps, Froggie Woogie, Portrait of Uriah, Sir Gil Ahead, Monkey Serenade och Mister Trickster. Dessutom en svit i ÃƒÂ¥tta fristÃƒÂ¥ende satser, karaktÃƒÂ¤rsmÃƒÂ¥lningar, fÃƒÂ¶r Nogenja-ensemblens saxofon-och rÃƒÂ¶rblÃƒÂ¥ssektion, med titeln A Snake Dream, samt ett stort antal arrangemang och bearbetningar fÃƒÂ¶r samma orkester.\n\n- - -\n\n2005 erhÃƒÂ¶ll Broberg utmÃƒÂ¤rkelsen Master of Jazz inom ramen fÃƒÂ¶r det internationella (lÃƒÂ¤s europeiska) Django d'Or-priset. Bland tidigare mottagare av priset kan nÃƒÂ¤mnas Putte Wickman, Arne Domnerus, Bengt Hallberg, Bernt Rosengren och Monica Zetterlund.\n(wikipedia)\n\n- - -\n\nBosse Broberg &amp; Nogenja Jazz Soloist Ensemble - Conspiracy in flat five 2001\n(Stockholm Caprice)\n\n1. Donna Lee (in flat 5). \n2. Warm valley. \n3. Mountain bridges. \n4. Django. \n5. When I fall in love. \n6. Cubano chant. \n7. Blood count. \n8. Mister Trickster. \n9. Hej Bej\n\n\nBosse Broberg, trumpet, leader\nHans Dyvik, trumpet\nPeter Asplund, trumpet\nJan Allan, trumpet\nThomas Driving, fluegelhorn\nOlle Holmquist, trombone\nBertil Strandberg, trombone\nSven Larsson, bass trombone, tuba\nKrister Andersson, alto &amp; tenor saxophones, clarinet\nLennart Aberg, soprano &amp; tenor saxophones, flute\nDave Wilczewski, tenor saxophone\nJohn HÃƒÂ¶gman, baritone saxophone\nGÃƒÂ¶sta Rundqvist, piano\nHans Andersson, bass\nJohan LÃƒÂ¶fcrantz, drums\n","torrent":{"xt":"urn:btih:cb42941da760785dc718a1872312dca73f51b61a","amp;dn":"Bosse+Broberg+-+Conspiracy+in+flat+five+2001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb42941da760785dc718a1872312dca73f51b61a","infoHashBuffer":{"type":"Buffer","data":[203,66,148,29,167,96,120,93,199,24,161,135,35,18,220,167,63,81,182,26]},"announce":[],"urlList":[]}}