{"title":"Colored Folder Creator v. 1.0(1) pre[K]racked","uid":6628578,"size":37245689,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:cc02c99f4179cfe3eef02215f642a2970615645f&amp;dn=Colored+Folder+Creator+v.+1.0%281%29+pre%5BK%5Dracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"polisdavid","files":-1,"time":1314256654,"description":"Official Web Site: &lt;a href=&quot; http://www.samuco.net/web/colored-folder-creator/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.samuco.net/web/colored-folder-creator/&lt;/a&gt;\n\nProduct Description\nColored Folder Creator is back and bigger than ever. Create exquisite and unique folders for your computer with over 1000 pre-created images. Using the new creator, you'll now be able to easily edit any of the folders we supply. \n\nYou can even create your own stunning folders from scratch with simplicity and ease. The Creator uses PDF technologies to deliver a responsive and powerful interface which is enjoyable to use. We took our original concept (&quot;You do not need to be an artist to be able to create beautiful folders.&quot;) and created an interface which suits both artists and casual users alike. \n\nColored folders are a simplistic, but powerful way to increase your productivity. At some stage, everybody has had a desktop which seems to be bursting at the seams. Finding folders in this sea of files can be a challenge, because they all look exactly the same. Using colored folders (which can be animals, flags, smilies etc), you will be able to find folders at a glance. \n\nWe received many requests from people who wanted to be able to change the icons of existing folders. We have added this option in an easy and accessible way. Simply select the folders in Finder and click on the desired folder in Colored Folder Creator. \n\nArchived folders emailed to friends will still retain the icon generated by Colored Folder Creator. Instead of sending your friends plain folders, send them stunning ones.\n\nSystem Requirements:\n\nIntel Mac OS 10.5 or greater (OS 10.7 ready)\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:cc02c99f4179cfe3eef02215f642a2970615645f","amp;dn":"Colored+Folder+Creator+v.+1.0%281%29+pre%5BK%5Dracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc02c99f4179cfe3eef02215f642a2970615645f","infoHashBuffer":{"type":"Buffer","data":[204,2,201,159,65,121,207,227,238,240,34,21,246,66,162,151,6,21,100,95]},"announce":[],"urlList":[]}}