{"title":"Ford.Street.Racing.pc.eng","uid":6658606,"size":653582979,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cea8ed7be2b4f0729f4948efc9ed5dcad596a139&amp;dn=Ford.Street.Racing.pc.eng&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Bilski","files":-1,"time":1315421883,"description":"Ford Street Racing is a game commissioned by Ford for the Xbox, PC, PlayStation 2. It was also to PSP under the name Ford Bold Moves Street Racing, a name later adopted for all other consoles. It was released September 19, 2006 in the United States. It was developed by Razorworks, published by Empire Interactive, and distributed by Ingram Entertainment.All of the Ford Motor Company's sport cars and trucks (such as Mustang, Probe, GT, GT-40, and F-150 SVT Lightning are included in the game. Tuner vehicles such as the Saleen and Roush are included.\n\n\nFeatures :\n\n-Eighteen officially licensed Ford vehicles, every one an aspirational, high-performance super car. From the 1968 Mustang GT to the 2007 Ford Shelby GT500.\n-Team Racing: Race a team of 3 cars switching between them and issuing commands to gain a positional and tactical advantage.\n-Twenty four richly detailed tracks based around the streets of Los Angeles.\n-Beautifully realistic car models including a damage system.\n-Progress through three increasingly powerful groups of performance cars.\n-Win cash to repair existing cars and purchase higher performance cars.\n-Compete in a single player game structure containing challenges, competitions and leagues as well as split screen multiplayer.","torrent":{"xt":"urn:btih:cea8ed7be2b4f0729f4948efc9ed5dcad596a139","amp;dn":"Ford.Street.Racing.pc.eng","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cea8ed7be2b4f0729f4948efc9ed5dcad596a139","infoHashBuffer":{"type":"Buffer","data":[206,168,237,123,226,180,240,114,159,73,72,239,201,237,93,202,213,150,161,57]},"announce":[],"urlList":[]}}