{"title":"Democracy Now - 09 aug 2011","uid":6593169,"size":455190189,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:cebbf12a90e661a0f269237e9fead962147af830&amp;dn=Democracy+Now+-+09+aug+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1312909863,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Aug 09, 2011\n\n- International Stock Values Plummet After S&amp;P Downgrades U.S. Credit Rating\n- Hundreds Arrested in Britain as Unrest Spreads Across Nation\n- U.N. Makes Historic Aid Delivery To Famine-Stricken Somalia\n- Death Toll in Syria Crackdown Surpasses 2,000\n- U.S. Vows to Stay the Course After Single-Bloodiest Attack in Afghan War; Bars Media From Ceremony\n- Japan Withheld Information Following Nuclear Disaster Placing Residents At Risk of Radiation\n- Court Refuses To Dismiss Torture Lawsuit Against Donald Rumsfeld\n- July Fourth-Warmest Month in U.S. History\n- Wisconsin Voters Head To Polls In Recall Elections\n- White Mississippi Teens Accused In Racially Motivated Murder\n- Catholic Priest Roy Bourgeois Faces Expulsion Over Support of Female Priests\n- Salvadoran Soldiers Arrested In Connection With 1989 Jesuit Priest Murders\n\n\nSpecial reports\n\n- Atomic Cover-Up: The Hidden Story Behind the U.S. Bombing of Hiroshima and Nagasaki\n\nAs radiation readings in Japan reach their highest levels since the Fukushima Daiichi nuclear power plant meltdowns, we look at the beginning of the atomic age. Today is the 66th anniversary of the U.S. atomic bombing of Nagasaki, which killed some 75,000 people and left another 75,000 seriously wounded. It came just three days after the United States dropped an atomic bomb on Hiroshima, killing around 80,000 people and injuring some 70,000. By official Japanese estimates, nearly 300,000 people died from the bombings, including those who lost their lives in the ensuing months and years from related injuries and illnesses. Other researchers estimate a much higher death toll. We play an account of the 1945 atomic bombing of Nagasaki by the pilots who flew the B-29 bomber that dropped that bomb, and feature an interview with the son of Pulitzer Prize-winning journalist George Weller, who was the first reporter to enter Nagasaki. He later summarized his experience with military censors who ordered his story killed, saying, &quot;They won.&quot; Our guest is Greg Mitchell, co-author of &quot;Hiroshima in America: A Half Century of Denial,&quot; with Robert Jay Lifton. His latest book is &quot;Atomic Cover-Up: Two U.S. Soldiers, Hiroshima &amp; Nagasaki and The Greatest Movie Never Made.&quot;\n\n\n- &quot;A Declaration of War on the Poor&quot;: Cornel West and Tavis Smiley on the Debt Ceiling Agreement\n\nThe veteran broadcaster Tavis Smiley, and the author and Princeton University Professor Cornel West, are in the midst of a 15 city, cross-country trek they have dubbed, &quot;The Poverty Tour: A Call to Conscience.&quot; The tour comes on the heels of last week's deficit agreement, which has been widely criticized for excluding a tax hike on the wealthy as well as any measures to tackle high unemployment. &quot;Any legislation that doesn't extend unemployment benefits, doesn't close a single corporate loophole, doesn't not raise one cent in terms of new revenue in terms of taxes on the rich or the lucky, allows corporate America to get away scot-free again, the banks and Wall Street getting away again, and all of these cuts ostensibly on the backs of everyday people,&quot; says Smiley.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:cebbf12a90e661a0f269237e9fead962147af830","amp;dn":"Democracy+Now+-+09+aug+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cebbf12a90e661a0f269237e9fead962147af830","infoHashBuffer":{"type":"Buffer","data":[206,187,241,42,144,230,97,160,242,105,35,126,159,234,217,98,20,122,248,48]},"announce":[],"urlList":[]}}