{"title":"Best of Hal Holbrook in Mark Twain Tonight! [320 mp3]","uid":7016469,"size":179987372,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cfd0aa32f240fbfdda8a41fc46b27609d28b9e16&amp;dn=Best+of+Hal+Holbrook+in+Mark+Twain+Tonight%21+%5B320+mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1328678118,"description":"\n\nThis compilation is made up of selections from the original LPs HAL HOLBROOK IN MARK TWAIN TONIGHT! (1959), MORE OF HAL HOLBROOK IN MARK TWAIN TONIGHT! (1960) and HIGHLIGHTS FROM THE CBS-TV SPECIAL, MARK TWAIN TONIGHT! (1967).\n\nRecorded in 1959, 1960 &amp; 1967. Includes liner notes by Godard Lieberson and Jeffrey Peisch.\n\nSince the mid-'50s, actor Hal Holbrook has been known more for his onstage portrayals of Mark Twain than for anything else. This compilation is taken from three albums that Columbia released of excerpts from his one-man show in which he plays a storytelling Mark Twain, Mark Twain Tonight! All of those LPs were released between 1959 and 1967, the point at which that show was at its most popular. So this likely captures Holbrook and his characterizations at their freshest. Although the running time is a generous 73 minutes, it actually only represents a small portion of his total Twain repertoire, which included more than a dozen hours of material. The loss of visuals does dilute from these rambling narratives' impact, and some may prefer to read Twain on the page than hear Holbrook express the man's thoughts in the guise of a 70-year-old. Also, though it's not too important in a spoken word dramatic recording in which all of the dialogue is easily audible, there are minor sonic imperfections in which the voice levels occasionally vary. It's still an effective distillation of Holbrook's channeling of Twain's persona as a crusty but voluble raconteur, ranging over a wide field of subjects like smoking, reaching 70 years of age, slavery, war, and nationalism. ~ Richie Unterberger\n\nColumbia/Legacy Cat # SK 86228\n\nAll tracks have been digitally remastered.\n\n01 - Introduction\n02 - On Smoking\n03 - Problems of Missionarying\n04 - Congress\n05 - His Grandfather's Old Ram\n06 - Huck Battles His Conscience\n07 - A Helluva Heaven\n08 - The Creator's Pet\n09 - Sunrise on the Mississippi\n10 - How to Be Seventy","torrent":{"xt":"urn:btih:cfd0aa32f240fbfdda8a41fc46b27609d28b9e16","amp;dn":"Best+of+Hal+Holbrook+in+Mark+Twain+Tonight%21+%5B320+mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfd0aa32f240fbfdda8a41fc46b27609d28b9e16","infoHashBuffer":{"type":"Buffer","data":[207,208,170,50,242,64,251,253,218,138,65,252,70,178,118,9,210,139,158,22]},"announce":[],"urlList":[]}}