{"title":"Morning Glory {K Hepburn, D Fairbanks Jr.} [1933]` .avi","uid":7028401,"size":732432384,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d0919393e797ac5b3ef5d2b85bf8c7509c18aa3e&amp;dn=Morning+Glory+%7BK+Hepburn%2C+D+Fairbanks+Jr.%7D+%5B1933%5D%60+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alien99","files":-1,"time":1329148754,"description":"Nothing extra special about this movie one of them cuddle up with wifey/hubby\non the sofa for a good ole movie \n\nGenres:\nDrama | Romance \n\nStoryline\n\nEva Lovelace, would-be actress trying to crash the New York stage, is a wildly optimistic chatterbox full of theatrical mannerisms. Her looks, more than her talent, attract the interest of a paternal actor, a philandering producer, and an earnest playwright. Is she destined for stardom or the &quot;casting couch&quot;? Will she fade after the brief blooming of a &quot;morning glory&quot;? \n\nUser review\n\nIn only her third film, Katharine Hepburn gives a lovely performance as a skinny, aspiring actress coming to New York from a small Vermont town convinced she will become a star. From the opening scenes where she stares admiringly at portraits of famous actors in the theater lobby, and then nervously starts her chatterbox conversation with C. Aubrey Smith in producer Adolphe Menjou's outer office, you are compelled to root for her because of her exuberance. But the climb to stardom is not that easy, she learns, failing in a small role Menjou gives her, taking menial jobs in vaudeville to keep from starving until she can get a break. When she does get the break of a lifetime, replacing the star who quit on opening night when her financial demands were not met, Hepburn is filled with fear of failure once again.\n\nI loved the famous scene where Hepburn gets slightly drunk at a party given by Menjou and recites the &quot;to-be-or-not-to-be&quot; soliloquy from Hamlet and the balcony scene from Romeo and Juliet. So did the guests, who applauded, and Douglas Fairbanks, Jr., who fell in love with her. The supporting cast were all excellent, but I particularly liked Helen Ware playing Hepburn's costumer, who was briefly once a famous star, but faded quickly, like a morning glory.\n","torrent":{"xt":"urn:btih:d0919393e797ac5b3ef5d2b85bf8c7509c18aa3e","amp;dn":"Morning+Glory+%7BK+Hepburn%2C+D+Fairbanks+Jr.%7D+%5B1933%5D%60+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0919393e797ac5b3ef5d2b85bf8c7509c18aa3e","infoHashBuffer":{"type":"Buffer","data":[208,145,147,147,231,151,172,91,62,245,210,184,91,248,199,80,156,24,170,62]},"announce":[],"urlList":[]}}