{"title":"ChainDive (PS2)","uid":7016467,"size":621118517,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:d46c0694e7e1ef9315610c33155e0cc44f3ac3cc&amp;dn=ChainDive+%28PS2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1328678065,"description":"ChainDive is a Beat-\\\\\\'Em-Up game, developed by Alvion and published by SCEI, which was released in Japan in 2003 for the PS2 exclusively.\n\nThis game is difficult to find, online and offline, especially sincetakedown. To play this game, you will need to mod your PS2 in one of the following methods.\n\n-Install a mod chip (requires soldering and taking apart the PS2)\n-Use Swap Magic (involves swapping discs back and forth)\n-MC Exploit - Cogswap (similar to swap magic, but it doesn\\\\\\'t come in a form of a disc. Instead, it\\\\\\'s installed into the memory card and it\\\\\\'s free)\n-Free McBoot (http://freemcboot.info/) (This is similarly installed onto your memory card for free.)\n-Softmod (requires a hard drive, Network Adaptor, and hacking programs. Enables you to store and play games, music, andphotos right off of the hard drive).\n\n---\n\nAlternatively, you can attempt to find a legitimate copy and a Japanese PS2, or use one of the above mods to attempt region-free play. Not all of these methods will allow you to run discs from other regions. Free McBoot, for example, only allows you to play backups.\n\nOn older PS2 models, the laser might be too weak to read most backup discs, and it can burn the laser out quickly. For best results, burn the ISO using either DVD+R discs DVD-R discs at the slowest speed your disc-burning program will allow (Try to go for 4X burning speed or lower). Verbatim brand DVDs are considered the best. Do some research to check if your PS2 laser will read burned discs.\n\nIf you have a decent computer, you can also download PCSX2 to emulate your PS2 ISOs without having to burn anything. http://pcsx2.net/\n\n\nEnjoy!","torrent":{"xt":"urn:btih:d46c0694e7e1ef9315610c33155e0cc44f3ac3cc","amp;dn":"ChainDive+%28PS2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d46c0694e7e1ef9315610c33155e0cc44f3ac3cc","infoHashBuffer":{"type":"Buffer","data":[212,108,6,148,231,225,239,147,21,97,12,51,21,94,12,196,79,58,195,204]},"announce":[],"urlList":[]}}