{"title":"Democracy Now - 29 aug 2011","uid":6638076,"size":451456980,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d4b50e2b8e1160235f4c610c58ec4ffdf0f4a9ed&amp;dn=Democracy+Now+-+29+aug+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1314637413,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\n\nHeadlines for Aug 29, 2011\n\n- Hurricane Irene Pummels East Coast With Massive Flooding; At Least 22 Dead\n- Libya: NATO Bombs Gaddafi's Hometown\n- U.S. Journalist Among 10,000 Prisoners Freed in Libya\n- U.S. Claims Senior Level Al-Qaeda Officer Killed By CIA Drone Attack in Pakistan\n- Report: U.S. Special Forces May Have Killed BBC Journalist in Afghanistan\n- Suicide Mosque Bombing Kills at Least 28 in Iraq\n- Israel Orders Reinforcements Deployed to Gaza Strip, Egypt Border\n- Wikileaks Cables Confirm U.S. Efforts to Push Genetically Engineered Food Abroad\n- U.S. Soldier Suspected Of Killing Four Found Dead In Philadelphia Suburb\n- Widow of Army Ranger Removed From Event After Confronting Donald Rumsfeld\n- Canada Holds State Funeral to Honor Opposition Leader Jack Layton\n\n\nSpecial reports\n\n- &quot;We Are Still Under Siege&quot;: Vermont Gov. Shumlin on Catastrophic Flooding &amp; Climate Change\n\nEmergency officials say at least 22 people across the eight states may have died as a result of Hurricane Irene, which spanned more than 500 miles at some points. After making landfall in North Carolina on Saturday, the hurricane was downgraded first to a tropical storm and then to a post-tropical cyclone as it hit New York City, flooding waterfronts and low-lying areas. Up to to 4 million customers from North Carolina to Maine remain without electricity. Authorities say it could take more than a week to restore all of the power. Meanwhile, in Vermont, Tropical Storm Irene dropped heavy rains late on Sunday, causing flash floods, forcing hundreds of evacuations, and leaving 40,000 to 50,000 people without power. It is becoming the state's worst natural disaster since the Great Flood of 1927. Vermont Gov. Peter Shumlin joins us for an update from Vermont, where nearly every community is surrounded by hills and valleys, with small streams feeding into rivers. Shumlin notes that since he was sworn into office seven months ago, &quot;this is the second major disaster as a result of storms. We had storms this spring that flooded our downtowns and put us through many of the same exercises we're going through right now. We didn't use to get weather patterns like this in Vermont. The point is, we in the colder states will see the results of climate change first.&quot;\n\n\n- Bill McKibben: Will Hurricane Irene Be a Wake-Up Call About Climate Change?\n\nHurricane Irene received a massive amount media coverage, but television reports made little or no reference to the role global warming played in the storm. We speak with someone with his eye on climate change and its impact. &quot;We've had not only this extraordinary flooding, but on the same day that Hurricane Irene was coming down, Houston set its all time temperature record, 109 degrees,&quot; says Bill McKibben, co-founder and director of 350.org. &quot;We're in a new situation.&quot; McKibben is among hundreds of people arrested last week during ongoing sit-ins outside the White House, protesting the proposed Keystone XL pipeline that would carry tar sands oil from Alberta, Canada, to the Gulf of Mexico. On Friday, the U.S. State Department's final environmental review of the proposed pipeline found that the project will have &quot;limited adverse environmental impacts.&quot; Protesters will begin their second week of sit-ins today, and continue to demand President Obama veto approval for the pipeline. &quot;There has never been a purer test of whether or not we're prepared to stand up to climate change or not,&quot; says McKibben.\n\n\n- Shored Up: Debate Over Development on Barrier Islands Intensifies After Hurricane\n\nHurricane Irene caused significant beach erosion as it made landfall at North Carolina's Outer Banks - a 200-mile-long string of barrier islands. It also crashed into the Jersey shore, Long Island and other popular East Coast beaches this weekend. Many of these areas are filled with high-priced oceanfront real estate, and the battle to save these beaches and communities costs billions of dollars each year. We speak with Ben Kalina, who was just in Long Beach Island, New Jersey, covering the effects of Hurricane Irene. He is associate producer of the documentary called &quot;A Sea Change&quot; and is working on another documentary about developing barrier islands titled &quot;Shored Up.&quot; &quot;Maybe beach replenishment is not the answer here,&quot; says Kalina. &quot;In order to avoid massive casualties and loss of life and loss of property in the future, we need to start taking a different look at how we develop these islands.&quot;\n\n\n- NYC Criticized For Failing To Evacuate Prisoners at Rikers Island Ahead of Hurricane\n\nEven though Hurricane Irene prompted a series of extraordinary measures in New York City - a complete shutdown of the public transit system and mass evacuations on an unprecedented scale - officials did not take any steps to evacuate some 12,000 prisoners held in a city jail on Riker's Island. According to the New York City Department of Corrections' website, more than three-quarters of Rikers Island's 400 acres are built on landfill, which is generally thought to be more vulnerable to natural disasters. Mayor Micheal Bloomberg said prisoners there were not in any danger, but human rights organizations condemned the city's decision. Today also marks the sixth anniversary of another massive storm and a decision not to evacuate prisoners. It was August 29, 2005, when Hurricane Katrina led to the flooding of New Orleans, and prisoners in city and parish jails were left to fend for themselves. We speak with James Ridgeway, a reporter for Mother Jones magazine and founder and co-editor of SolitaryWatch, a website that tracks solitary confinement and torture in American prisons.\n\n\n- Global Warming &amp; War: New Study Finds Link Between Climate Change and Conflict\n\nA new study has found that that often war is associated with global climate change. According to the report, there are links between the climate phenomenon, El NiÃƒÂ±o, and outbreaks of violence in countries from southern Sudan to Indonesia and Peru. The scientists find that El NiÃƒÂ±o, which brings hot and dry conditions to tropical nations, doubles the risk of civil war in up to 90 countries, and may help account for a fifth of conflicts worldwide during the past 50 years. We speak with the report's lead author, Solomon Hsiang, a postdoctoral researcher at the Woodrow Wilson School of Public and International Affairs at Princeton University.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:d4b50e2b8e1160235f4c610c58ec4ffdf0f4a9ed","amp;dn":"Democracy+Now+-+29+aug+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4b50e2b8e1160235f4c610c58ec4ffdf0f4a9ed","infoHashBuffer":{"type":"Buffer","data":[212,181,14,43,142,17,96,35,95,76,97,12,88,236,79,253,240,244,169,237]},"announce":[],"urlList":[]}}