{"title":"Bradley Manning - Truth and Consequences (2011) Greg Mitchell","uid":6603602,"size":187282,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d52dbebd2422546599978831b62e364bc50f28f6&amp;dn=Bradley+Manning+-+Truth+and+Consequences+%282011%29+Greg+Mitchell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"WentloogWhix","files":1,"time":1313318511,"description":"&quot;Bradley Manning: Truth and Consequences&quot; is written by award-winning author Greg Mitchell, whose daily blog on WikiLeaks for The Nation magazine and recent book &quot;The Age of WikiLeaks&quot; have gained a wide following, and praise from Daniel Ellsberg, Amy \nGoodman, Glenn Greenwald, Bill Moyers and others.\n\nIn his new book, Mitchell traces Manning from his childhood in Oklahoma to Baghdad, where he was arrested in May 2010 and charged with sending to WikiLeaks explosive secret reports relating to the Iraq and Afghanistan wars, and diplomatic cables exposing sensitive U.S. relations around the world--and corrupt or abusive practices by other regimes. Is Manning guilty? If so, what was his motivation?\n\nThen Mitchell probes the controversy that has swirled around Manning's harsh treatment in the brig at the Marine base in Quantico, Va., which has led to repeated charges of &quot;cruel and unusual punishment,&quot; the firing of the chief U.S. State Department spokesman, and demonstrations all over the world -- even as some pundits and politicians in the U.S. call for Manning's execution.\n\nThe book follows the Manning story right up to March 20, 2011, and includes for the first time in print lengthy excerpts from the online &quot;chat logs&quot; used as evidence to arrest him--and from Manning's remarkable recent letter detailing inhumane conditions he endures in prison. It also explores the documents that Manning allegedly leaked and their ongoing impact in the U.S. and around the globe, along with updated look at the continuing saga of WikiLeaks and Julian Assange.\n","torrent":{"xt":"urn:btih:d52dbebd2422546599978831b62e364bc50f28f6","amp;dn":"Bradley+Manning+-+Truth+and+Consequences+%282011%29+Greg+Mitchell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d52dbebd2422546599978831b62e364bc50f28f6","infoHashBuffer":{"type":"Buffer","data":[213,45,190,189,36,34,84,101,153,151,136,49,182,46,54,75,197,15,40,246]},"announce":[],"urlList":[]}}