{"title":"Teaching the Early Modern Period","uid":6604245,"size":1338200,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d59dc8fc727ffcf62832b5b6329142c381f640be&amp;dn=Teaching+the+Early+Modern+Period&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_F1_","files":-1,"time":1313337660,"description":"Teaching the Early Modern Period\nDerval Conroy (Editor), Danielle Clarke (Editor)\n\nPaperback: 240 pages\nPublisher: Palgrave Macmillan (July 5, 2011)\nLanguage: English\nISBN-10: 0230284515\nISBN-13: 978-0230284517\n\nReview:\n&quot;This book is an excellent addition to materials on pedagogy not simply for the early modern period but in general. The range of responses is fittingly diverse and much thought has been put into designing a well-crafted and innovative collection. The key importance of the volume is its geographical, disciplinary and cultural range. One of the great virtues of this book is its diversity, and it will appeal to scholars, postgraduates and teachers in the UK, USA, Europe and Australia.&quot; -- Jerome de Groot, University of Manchester, UK\n\nProduct Description:\nTeaching the Early Modern Period is an innovative project bringing together leading early modernists from a wide geographical and disciplinary background. Scholars from English, History and French Studies unite in this unique volume to examine the challenges which the early modern period provides in the third-level classroom. Alongside nine essays the volume is interspersed with shorter reflections of fourteen invited professors from Ireland, the UK, France, the Netherlands, South Africa, Canada and the USA. The contributors provide a rare transcontinental insight into current pedagogical praxis in a number of Western national traditions, presenting a wide range of case-studies of how research can inform teaching from scholars who refuse to accept a divorce between the two.","torrent":{"xt":"urn:btih:d59dc8fc727ffcf62832b5b6329142c381f640be","amp;dn":"Teaching+the+Early+Modern+Period","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d59dc8fc727ffcf62832b5b6329142c381f640be","infoHashBuffer":{"type":"Buffer","data":[213,157,200,252,114,127,252,246,40,50,181,182,50,145,66,195,129,246,64,190]},"announce":[],"urlList":[]}}