{"title":"Great.Train.Rides.2009","uid":6597325,"size":1465462323,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:d5a1941b1090aee93f30f251f82bf96ac6eb6a17&amp;dn=Great.Train.Rides.2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"w6643","files":2,"time":1313068664,"description":"Blu-ray captures like no other format the sweeping beauty and extraordinary natural wonders of America s premier national parks. Filmed and mastered in High Definition, Scenic National Parks takes you off the\nbeaten path to discover untamed places, unique wildlife, and invigorating activities.\n\nGreat Train Rides\nCombining stunning scenery and the romance of the rails, this is your\nticket to high adventure! From the elegance of the American Orient\nExpress to the restored glory of the Grand Canyon Railway, recapture a\nbygone era of travel aboard six classic railroads, including the Empire\nBuilder to Glacier National Park, the Denali Star to Denali National\nPark, and the Coastal Starlight to Mount Rainier National Park.\n\nBonus Program -Lodges &amp; Inns\nExperience luxurious getaways and rustic National Park retreats that\nare almost as celebrated as the wondrous landscapes that surround them.\nThe massive rock fireplace in Yellowstone s Old Faithful Inn, the secluded\nsplendor of Yosemite s Ahwahnee Hotel, and the natural warm springs\npool at Death Valley s Furnace Creek Inn are just some of the treasures\nyou ll find off the beaten path.","torrent":{"xt":"urn:btih:d5a1941b1090aee93f30f251f82bf96ac6eb6a17","amp;dn":"Great.Train.Rides.2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5a1941b1090aee93f30f251f82bf96ac6eb6a17","infoHashBuffer":{"type":"Buffer","data":[213,161,148,27,16,144,174,233,63,48,242,81,248,43,249,106,198,235,106,23]},"announce":[],"urlList":[]}}