{"title":"TechnoCalyps (2009)","uid":6570970,"size":1138908071,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d7baef7f097fdac205b5487a0dfd3d63ae36ead2&amp;dn=TechnoCalyps+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"naba888","files":5,"time":1311970016,"description":"TechnoCalyps (2006) - with Terence McKenna, Director: Frank Theys\n\nAre we prepared for dealing with the prospect that humanity is not the end of evolution? Technocalyps is an intriguing three-part documentary on the notion of transhumanism by Belgian visual artist and filmmaker Frank Theys. The latest findings in genetics, robotics, artificial intelligence, bionics and nanotechnology appear in the media every day, but with no analysis of their common aim: that of exceeding human limitations. The director conducts his enquiry into the scientific, ethical and metaphysical dimensions of technological development. The film includes interviews by top experts and thinkers on the subject worldwide, including Marvin Minsky, Terence McKenna, Hans Moravec, Bruce Sterling, Robert Anton Wilson, Richard Seed, Margareth Wertheim, Kirkpatrick Sale, Ralph C. Merkle, Mark Pesce, Ray Kurzweil, Rabbi Youssouf Kazen, Rael and many others. Part 1: 'Transhuman' gives an overview of recent technological developments (biogenetics, artificial intelligence, robotics, implants, nanotechnology,...) and prognoses made by leading scientists about the impact of these developments in the near future. Part 2: 'Preparing for the Singularity' - In this part advocates and opponents of a transhuman future are weighed against each other; prognoses are done when we can expect the transhuman revolution and how people are preparing for it already now. Part 3: 'The Metaphysics of Technology' - This part covers the metaphysical consequences of the new technological revolution.\n\n1 - Name: Technocalyps - Transhuman - 1.avi - Size: 357.4 MiB - Duration: 0:50:56 - Bitrate: 980 Kbps\n2 - Name: Technocalyps - Preparing for the Singularity - 2.avi - Size: 350.2 MiB - Duration: 0:51:36 - Bitrate: 948 Kbps\n3 - Name: Technocalyps - The Digital Messiah - 3.avi - Size: 378.6 MiB - Duration: 0:54:2 - Bitrate: 979 Kbps\n\ntags: transhuman, robot, computer, cyborg, enlightenment, illumination, evolution, omega, singularity, information, rapture, antichrist, nwo, illuminati, gaia, mind, consciousness, meditation, technology, messiah, android, intelligence, ai, nanotechnology","torrent":{"xt":"urn:btih:d7baef7f097fdac205b5487a0dfd3d63ae36ead2","amp;dn":"TechnoCalyps+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7baef7f097fdac205b5487a0dfd3d63ae36ead2","infoHashBuffer":{"type":"Buffer","data":[215,186,239,127,9,127,218,194,5,181,72,122,13,253,61,99,174,54,234,210]},"announce":[],"urlList":[]}}