{"title":"Bob Dylan - 2011-06-29 - Koengen, Bergen, Norway - Bergen Callin","uid":6505980,"size":515423034,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d8307a4268dd4fc9b882dd21f4d1adba0fb0f292&amp;dn=Bob+Dylan+-+2011-06-29+-+Koengen%2C+Bergen%2C+Norway+-+Bergen+Callin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FatFreddy437","files":21,"time":1309430210,"description":"Bob Dylan - 2011-06-29 - Bergen, Norway\nKoengen\nBergen, Norway\nJune 29th, 2011.\n\nLinage: CA-11&gt;EdirolR09-HR&gt;Audacity(amplification)&gt;16bit-44100HzWave&gt;CDWave&gt;Flac\nPosition: Golden Circle, dead center, 8 meters from stage.\nTaper: Duckman.\n\n1. Rainy Day Women #12 &amp; 35 (Bob on keyboard)\n2. It's All Over Now, Baby Blue (Bob center stage on harp)\n3. Things Have Changed (Bob center stage on harp)\n4. Tangled Up In Blue (Bob center stage on harp)\n5. Beyond Here Lies Nothin' (Bob on guitar)\n6. Simple Twist Of Fate (Bob on guitar)\n7. High Water (For Charley Patton) (Bob center stage on harp, Donnie on banjo)\n8. Tryin' To Get To Heaven (Bob on keyboard)\n9. Tweedle Dee &amp; Tweedle Dum (Bob on guitar)\n10. Desolation Row (Bob on keyboard)\n11. Highway 61 Revisited (Bob on keyboard)\n12. Forgetful Heart (Bob center stage on harp, Donnie on viola)\n13. Thunder On The Mountain (Bob on keyboard)\n14. Ballad Of A Thin Man (Bob center stage on harp)\n15. Encoreapplause\n(encore)\n16. Like A Rolling Stone (Bob on keyboard)\n17. Bandintroductions\n18. All Along The Watchtower (Bob on keyboard)\n19. Blowin' In The Wind (Bob on keyboard then center stage on harp, Donnie on violin)\n\n------------------------------\nSetlist from Boblinks.com; http://www.boblinks.com/062911s.html\n------------------------------\n\nBob Dylan back in my hometown Bergen, at what must be Europes worst sounding arena.\nBob was in an excellent mood, joking around with Donnie, while Charlie Sexton (and I still don't understand how he got his gig in Dylans band back) spent most of the concert tuning his guitars, and changing them between every song. Charlie, just get ONE that works, and stick with it - they all sounded the same tonight anyway.\nIt kept raining most of the show, which turned out to be a good thing, as checking levels are a lot easier under a rain-poncho, and a big Norwegian rain-hat makes a great microphone-rack.\nAnyway, another great show from Bob, though not in my personal-attendance top five. Bob was great, the band was not all that inspired tonight - and they kept looking like they were dead scared of fucking something up.\nI kept having to duck down, as two security-dudes kept running back and forth in front of me, scanning the crowd. Hopefully it won't be to noticeable.\n\nSuzanne Vega did a good job as suppport-act, didn't get her set on tape unfortunately.\n\nI did tape this as 24bit, and could seed that as 24bit in a few days if there's interest.\n\nIn close vicinity (as always): One Loudclapper. Three drunken housewives. One drunk dude in a cowboyhat, talking to his friends all the time.\nStill turned out quite listenable.\n\n---------------------------------------------------------------------------------------\n\nPlease do NOT re-encode to MP3 and share. MP3s are only for personal use, spreading of this should only be done in FLAC.\nDo NOT upload this elsewhere without asking me first.\nNo NOT sell, and do NOT remove the info-file when sharing.\nPlease respect the artists, and buy their original work - as they permits us to upload and share this!","torrent":{"xt":"urn:btih:d8307a4268dd4fc9b882dd21f4d1adba0fb0f292","amp;dn":"Bob+Dylan+-+2011-06-29+-+Koengen%2C+Bergen%2C+Norway+-+Bergen+Callin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8307a4268dd4fc9b882dd21f4d1adba0fb0f292","infoHashBuffer":{"type":"Buffer","data":[216,48,122,66,104,221,79,201,184,130,221,33,244,209,173,186,15,176,242,146]},"announce":[],"urlList":[]}}