{"title":"Judith Lucys Spiritual Adventure s01e03 Seekers REAL","uid":6652245,"size":231215104,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d97c32db583cb80fc7fef299f88520bf7b12402d&amp;dn=Judith+Lucys+Spiritual+Adventure+s01e03+Seekers+REAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"richardg8092","files":1,"time":1315204478,"description":"Judith Lucy's Spiritual Adventure s01e03 Seekers REAL\n\n\nWorld-renowned psychic John Edward has made a living communicating with dead people. Having visited psychics in the past as she tried to make sense of her parent's deaths, Judith has an honest chat with John about sceptics, what people are looking for when they go to his shows, and what happens when we die?\n\nDeciding that, as she believes in nothing spiritual, she might as well try anything, Judith follows in her late mother's footsteps and takes the plunge into a rebirthing session, before heading to the home of spiritual seekers - Byron Bay. Among the crystals, cheese cloth and incense, Judith is spoilt for choice when it comes to New Age spiritual practices. She settles back in the rainforest for a spot of shamanic journeying, slips into and out of something more comfortable for a naked tantric massage, submits herself to a gong-filled yurt for vibrational cleansing, and heads to a place called the Lotus Temple for a group healing session from practitioners from The Divine University, who offer the chance to channel higher beings.\n\nBut Judith finds her spiritual waters are muddied when she chats to &quot;mind reading&quot; performer and sceptic Philip Escoffey, who uses the powers of suggestion and illusion to try and prove to people that all &quot;spirituality&quot;, from religion to psychics, is nothing more than showbiz. So is he right, or are John Edward and the Byron seekers closer to the truth? Or is there something in between?","torrent":{"xt":"urn:btih:d97c32db583cb80fc7fef299f88520bf7b12402d","amp;dn":"Judith+Lucys+Spiritual+Adventure+s01e03+Seekers+REAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d97c32db583cb80fc7fef299f88520bf7b12402d","infoHashBuffer":{"type":"Buffer","data":[217,124,50,219,88,60,184,15,199,254,242,153,248,133,32,191,123,18,64,45]},"announce":[],"urlList":[]}}