{"title":"Quantum of Solace(2008)DVDRip.AC3(ENG)-DROCK","uid":6652388,"size":733712877,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:da91b7f3ea0d3fd05e2397d11584bb9f562685d7&amp;dn=Quantum+of+Solace%282008%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1315208787,"description":"A devastating betrayal sends James Bond from Australia to Italy and South America on a mission of vengeance that pits the suave super-spy against a powerful businessman with diabolical intentions. Betrayed by Vesper, 007 (Daniel Craig) suppresses the urge to make his latest mission personal as he teams with M (Judi Dench) to interrogate Mr. White (Jesper Christensen). It soon becomes apparent that the organization behind the blackmailing of Vesper is more powerful than Bond and M had previously anticipated, and after discovering forensic evidence that links an MI6 traitor to a bank in Haiti, Bond immediately sets out to gather more intelligence.\n\nOnce in Haiti, a case of mistaken identity leads Bond into the company of the ravishing Camille (Olga Kurylenko), a dangerous beauty with her own vendetta. It's Camille who leads Bond to a ruthless businessman named Dominic Greene (Mathieu Amalric), who is soon revealed to be the mastermind of a powerful but clandestine organization. Greene is conspiring to corner the market on one of the world's most precious natural resources, and in order to make that happen he has forged a deal with an exiled general named Medrano (Joaquin Cosio). By enlisting the aid of his many associates and using his vast resources to force contacts within the CIA and the British government into bending to his will, Greene plans to overthrow the current regime of a Latin American country and hand control over to General Medrano in exchange for a parcel of land that appears barren on the surface, but actually houses a natural resource that will make Greene the most powerful man on the planet. But Bond's mission to uncover the culprit who blackmailed Vesper and prevent Dominic Greene from exerting his will on the entire world won't be easy, because now everyone from the CIA to the terrorists and even M are out to get him. \n\nRipped with Handbrake.\n\nLength: 1 Hour 46 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:da91b7f3ea0d3fd05e2397d11584bb9f562685d7","amp;dn":"Quantum+of+Solace%282008%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da91b7f3ea0d3fd05e2397d11584bb9f562685d7","infoHashBuffer":{"type":"Buffer","data":[218,145,183,243,234,13,63,208,94,35,151,209,21,132,187,159,86,38,133,215]},"announce":[],"urlList":[]}}