{"title":"Brother, Can You Spare a Dime? - 1975 Docu 1930s-70s","uid":6573059,"size":737272017,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dcb46dd468934479e7caa0921c628544f36ac648&amp;dn=Brother%2C+Can+You+Spare+a+Dime%3F+-+1975+Docu+1930s-70s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"rambam1776","files":-1,"time":1312056502,"description":"Brother, Can You Spare a Dime?\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 680kbps \nDuration.............: 1:51:12\nResolution...........: 600*452 \nFramerate............: 23.976 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 192 kbps CBR \nAudio Channels.......: 1 \nFilesize.............: 736,864,788 \nNO SUBTITLES\n\n &lt;a href=&quot;\nhttp://bayimg.com/OAJNnaadF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/OAJNnaadF&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0072742/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0072742/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Brother,_Can_You_Spare_a_Dime%3F_(film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Brother,_Can_You_Spare_a_Dime%3F_(film)&lt;/a&gt;\n\nThis documentary compiles newsclips from the 1930s to chronicle the entire decade of The Great Depression. The mood of the country is exemplified in a series of clips contrasting Franklin D. Roosevelt and James Cagney. Films of relevance to the documentary's task are also given attention, including I Am A Fugitive From A Chain Gang. The documentary includes many songs from the period, including Woody Guthrie's &quot;Vigilanted Man,&quot; then swiftly moves through contrasting times up to the mid-1970s.\n\n\nDirected by Philippe Mora\n\nCast\n\nMarlene Dietrich\nJohn Dillinger\nWalt Disney\nJames Dunn\nCliff Edwards\nDwight D. Eisenhower\nBill Elliot\nMadge Evans\nShirley Temple\nStepin Fetchit\nW. C. Fields\nDick Foran\nGerald Ford\nClark Gable\nBenny Goodman\nCary Grant\nWoody Guthrie\nGabby Hayes\nBillie Holiday\nHerbert Hoover\nJ. Edgar Hoover\nGeorge Burns\nThe Andrews Sisters\nFred Astaire\nWarner Baxter\nJack Benny\nBusby Berkeley\nWillie Best\nHumphrey Bogart\nJames Cagney\nCab Calloway\nEddie Cantor\nHobart Cavanaugh\nGeorge Chandler\nCharlie Chaplin\nWinston Churchill\nBetty Compson\nGary Cooper\nBing Crosby\nFrankie Darro\nCecil B. DeMille\n\n\nNOTE - This is not a PBS style documentary. There is no narration, or subtitles telling you who or what you are looking at. It is an &quot;arty&quot; movie that relies on existing knowledge and music to make its points. If you already know the period well, you should like this. For someone seeking to learn from scratch about the Great Depression and America in the 1930s and 1940s, I suspect this film will confuse an annoy you. I am including some comments from other viewers below:\n\nA fascinating trip back in time. If you are interested in the era, it is a treasure trove of footage that youll be glad to get a look at. Not a documentary in the strictest sense, and the lack of narration or a plot will throw off some viewers who find it hard to think for themselves. That the viewer already has some familiarity with the time period is assumed - if you dont know who, say, Huey Long is, theres no caption at the bottom of the screen to tell you who he is or his historical significance. So if English is your second language or you have no previous knowledge of the time period you wont get as much out of it. Its an anecdotal look back on the era, using a montage of newsreels, hollywood films, and period music which is combined to give the feel of things rather than a definitive history. The lack of a clear-cut authoritative voice telling you this is how it happened serves to *gasp* actually make the viewer think about what they are seeing and interpret it for themselves. This gives the film a rather different effect than it might have achieved by relying on the commentary of various talking heads, in a Ken Burns-style documentary format. Not that the material is presented without commentary. It is very artfully edited, sometimes for comedic purposes and sometimes for dramatic ones. This approach is at times frustrating, and you may not always agree with the editors choices. My complaints were that it was a bit lengthy, and that there was a bit too much material regarding Hollywood for my taste, but these are petty gripes in view of what an effective film it is overall.\n\nIt's an arty, impressionistic take on the 1930s, pieced together by a guy in the 1970s from lots of period newsreels and Cagney-type Hollywood films. It's more like Wisconsin Death Trip than American Experience. Luckily I kind of liked it anyway. There's not a word of narration or explanation, so if you don't have at least a working knowledge of Depression-era history you may be lost. I'm a history buff and I still wasn't quite sure what the filmmaker's point was in the end. But if you think you'd enjoy spending a couple of hours immersed in scattershot 1930s footage, some of it familiar but a lot of it more obscure, you might like this. I though it went off the rails in the last 15 minutes or so, when it stops delving into the 30s and rushes through WW2 and up to Nixon and Ford, which really doesn't make any sense. But otherwise, for what it is, I liked it.\n\nA curious experiment. Footage from newsreels, Hollywood movies and other sources are combined around themes that give you a kind of walking tour through the history of the 1930s. There's no narrator, only an occasional title card for a section to get your bearings. Similar in style to the later, more successful, piece The Atomic Cafe that dealt with Cold War atomic hysteria. The effect is something like channel-surfing through history; the aim isn't so much to give you a scholarly portrait of the era as much to capture the zietgeist of the times. Worth checking out if you know something about the era or it might pique your curiosity to learn more about this era of upheaval and change in the US. Probably an influence on All This and World War II, which used music of the Beatles combined with historical footage of WWII to similar, but less effective, results.\n","torrent":{"xt":"urn:btih:dcb46dd468934479e7caa0921c628544f36ac648","amp;dn":"Brother%2C+Can+You+Spare+a+Dime%3F+-+1975+Docu+1930s-70s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcb46dd468934479e7caa0921c628544f36ac648","infoHashBuffer":{"type":"Buffer","data":[220,180,109,212,104,147,68,121,231,202,160,146,28,98,133,68,243,106,198,72]},"announce":[],"urlList":[]}}