{"title":"PBS Now~Prisons for Profit   2008 ","uid":6615487,"size":246715748,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dd6c1afc0af8c50be851362a6a234b4e55668b05&amp;dn=PBS+Now%7EPrisons+for+Profit+++2008+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"john1942","files":1,"time":1313761341,"description":"PBS Now~Prisons for Profit   2008 \n\nCorporations are running many Americans prisons, but will they put profits before prisoners?\n\nA grim new statistic: One in every hundred Americans is now locked behind bars. As the prison population grows faster than the government can build prisons, private companies see an opportunity for profit.\n\nNOW on PBS investigates the government's trend to outsource prisons and prisoners to the private sector. Critics accuse private prisons of standing in the way of sentencing reform and sacrificing public safety to maximize profits.\n\n&quot;The notion that a corporation making a profit off this practice is more important to us than public safety or the human rights of prisoners is outrageous,&quot; Judy Greene, a criminal policy analyst, tells NOW on PBS.\n\nCompanies like Corrections Corporation of America say they're doing their part to solve the problem of inmate overflow and a shortage of beds without sacrificing safety.\n\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\nAlso:\nDeath For Profit  2011\n &lt;a href=&quot;\nhttp://mycuentame.org/immigrantsforsale/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mycuentame.org/immigrantsforsale/&lt;/a&gt;\n\nRoberto Martinez-Medina died in CCA's Stewart Detention Center in Georgia in 2009. Medina had been arrested a month earlier for not having a driver's license.\n\nCCA whistleblower Brian Holcomb spoke with us exclusively to expose how the company repeatedly ignored Medina's pleas for care of his heart ailment while he was imprisoned. Their negligence contributed to Medina's death.\n\nCCA profited off of Medina's incarceration, and ensured a greater profit by denying him critical health care. The inhumane conditions at CCA facilities are directly related to their obsession in cutting costs for profit.\n\nCCA has gone to great lengths to hush Medina's death. ","torrent":{"xt":"urn:btih:dd6c1afc0af8c50be851362a6a234b4e55668b05","amp;dn":"PBS+Now%7EPrisons+for+Profit+++2008+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd6c1afc0af8c50be851362a6a234b4e55668b05","infoHashBuffer":{"type":"Buffer","data":[221,108,26,252,10,248,197,11,232,81,54,42,106,35,75,78,85,102,139,5]},"announce":[],"urlList":[]}}