{"title":"La storia in giallo 138 - Gabrielle Bompard [Mp3 Ita] [TNTvillag","uid":6611013,"size":71471147,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:df5ac5ee4da0dbe6af6d7e5e7715bb4771e2b377&amp;dn=La+storia+in+giallo+138+-+Gabrielle+Bompard+%5BMp3+Ita%5D+%5BTNTvillag&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"darayava","files":1,"time":1313591340,"description":"La storia in giallo 138 - Gabrielle Bompard [Mp3 Ita] [TNTvillage]\n\nLA STORIA IN GIALLO\n\nLa Storia in giallo  ÃƒÂ¨ un programma in onda su radio3 scritto e condotto da Antonella Ferrera, con la regia di Francesco Pannofino, regia del dibattito di Manuel de Lucia, musiche originali di Alessandro Molinari, assistenza tecnica di Fiore Liborio, cura di Diana Vinci.\nRedazione: Carlo Dellonte e Roberto Ritondale Paola Veneto\nDa poco ha subito il mutamento nel nome diventando: Cuore di Tenebra\nLa storia e le storie di personaggi celebri, le vicende tragiche o misteriose che hanno segnato I loro destini e a volte quelli di molti altri. Uomini della politica o del malaffare, uomini di fede o vissuti nel peccato, personalitÃƒÂ  borderline, mitomani o geni maledetti. Le devianze e I turbamenti di grandi artisti di tutti I tempi che hanno riversato nella loro opera la fatica o la follia del vivere.\nLa Storia in Giallo li racconta come in un film, attraverso le voci dei migliori doppiatori italiani. Dopo lo sceneggiato che catapulta l'ascoltatore al centro di una storia, segue l'intervista ad un personaggio della cultura che ne spiega e racconta dinamiche, curiositÃƒÂ  e risvolti inediti.\n\nLa storia in giallo - in onda il 12/11/2005\n\nGABRIELLE BOMPARD\n\n\nAveva poco piÃƒÂ¹ di vent'anni, Gabrielle Bompard. Nella frenetica Parigi di fine Ottocento, sognava una carriera come attrice, ma per lei il destino scelse quella di prostituta prima, di fidanzata di un malvivente, poi. Il nome dell'uomo era Michel Eyraud. Quando la donna si ritrovÃƒÂ² processata per omicidio, sostenne sempre la propria innocenza, nonostante le prove conducessero a lei.\nFu il suo avvocato a sostenere, non senza l'incredulitÃƒÂ  dei giudici, che l'imputata avesse agito sotto ipnosi e per provarlo, trasformÃƒÂ² il processo in uno spettacolo unico: Gabrielle, ipnotizzata, rivisse di fronte al giudice e alla corte la notte in cui fu assassina inconsapevole...\nPer parlare delle tante facce dell'ipnosi, Antonella Ferrera ospita in studio la scrittrice Cinzia Tani, che ha da poco pubblicato il suo ultimo romanzo: &quot;L'insonne&quot;\nLa voce di Gabrielle Bompard ÃƒÂ¨ quella di Susanna Marcomeni.\n\nAVI File Details\n========================================\nName..........: 2005 - Gabrielle Bompard.mp3\nFilesize......: 68Mb\n\nAudio Bitrate.: 192Kbps\nAudio Freq....: 44KHz\nAudio Channels: Mono\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:df5ac5ee4da0dbe6af6d7e5e7715bb4771e2b377","amp;dn":"La+storia+in+giallo+138+-+Gabrielle+Bompard+%5BMp3+Ita%5D+%5BTNTvillag","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df5ac5ee4da0dbe6af6d7e5e7715bb4771e2b377","infoHashBuffer":{"type":"Buffer","data":[223,90,197,238,77,160,219,230,175,109,126,94,119,21,187,71,113,226,179,119]},"announce":[],"urlList":[]}}