{"title":"IP range by country - complete listings - August 2011 IP2country","uid":6622837,"size":1025003,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dfcb28128f03e7b8e3d20bafb291ea8ac001b2f9&amp;dn=IP+range+by+country+-+complete+listings+-+August+2011+IP2country&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mrizzo2","files":-1,"time":1314060986,"description":"We have only just compiled a most up to date listing of IP ranges by country\nfor an upcoming free compiled FoxPro program that will allow you to create your\nown IP filter from a menu of country choices.\n\n\nFrom our latest download of the GeoIPCountryCSV.zip file on the net\nwhich we have sorted for you - by country code into separate files\n\nFor now, here is a list of all countries from which to pick and choose\nwisely to keep to peers that allow for seeding to more relevant areas in hopes\nof efficiency.\n\nCreate your own ipfilter.dat text file using the same format of the text\nfiles included here. Simply copy and paste into one big file, whatever best \nfits your needs, and name it ipfilter.dat as is likely required by\nwhatever software you might be using. ipfilter.dat works for utorrent in \nany event, right now.\n\nIts easy to view using notepad etc and can be added to for such problems as clients that are using defective software as often happens with selected\nqbtorrent and even (more rarely) some utorrent clients etc that show no\nprogress regardless of how much you seed them - even if they come and go.\nThe software should be smart enough to disconnect them - but then who ever\nsaid its a genius that wrote utorrent as it is! No logic to sharing \npatterns whatever! Simply insane!\n\n\nMichael Rizzo Chessman\n\n\nSimply place your ipfilter.dat file in your utorrent applications data\ndirectory (under documents and settings) for the relevant user configuration for\nXP etc (Or search for the existing file and over-write it if desired)\n\t\t","torrent":{"xt":"urn:btih:dfcb28128f03e7b8e3d20bafb291ea8ac001b2f9","amp;dn":"IP+range+by+country+-+complete+listings+-+August+2011+IP2country","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfcb28128f03e7b8e3d20bafb291ea8ac001b2f9","infoHashBuffer":{"type":"Buffer","data":[223,203,40,18,143,3,231,184,227,210,11,175,178,145,234,138,192,1,178,249]},"announce":[],"urlList":[]}}