{"title":"Autisme een leven lang - DVD 3 Deel 5    TBS","uid":6637291,"size":4613792472,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e106dd3a04b59a77814fb3309064629a856f4945&amp;dn=Autisme+een+leven+lang+-+DVD+3+Deel+5++++TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Saggin","files":-1,"time":1314611815,"description":"Autisme een leven lang - DVD 3 Deel 5  \n\n[img]http://www.wessels-ib-support.nl/imagedump/autisme.jpg[/img]\n\na. De zus van Einstein\nb. Onmacht of Onwil\nc. Autimatisch\n\n\na. De zus van Einstein\nDe zus van Einstein\\' is een voorlichtingsdvd over autisÃ‚Â­me voor kinderen van 10 tot 14 \njaar. Op de video leggen kinderen met autisme zelf uit wat autisme voor hen betekent. \nOok een vriendje, klasgenoot en broer komen aan het woord. Er wordt uitgelegd dat \nautisme te maken heeft met de werking van de hersenen. Hierbij wordt een vergelijking \ngemaakt met een computer; het is alsof hun \\'computer\\' op een andere manier is \ngeprogrammeerd. Verschillende aspecten die voor de kinderen zelf en voor hun omgeving \ntot problemen kunnen leiden komen aan bod, zoals het zich moeilijk kunnen inleven in de \nander, detailwaarneming, de behoefte aan visuele ondersteuning, overgevoeligheid voor \ngeluid en de problemen met het aanpassen aan nieuwe situaties. Het leuke van de video \nis dat de hele vormgeving, inhoud en het tempo volledig is afgestemd op kinderen van 10 \ntot 14 jaar. De beelden wisselen elkaar vlot af, er is gebruik gemaakt van \naanstekelijke beelden, heldere taal en regelmatig is de rap de zus van Einstein te \nhoren.\n\nb. Onmacht of Onwil\nProblemen in de communicatie komen bij kinderen met een Autisme Spectrum Stoornis op \nalle niveaus van de taalontwikkeling voor. Zij hebben vaak problemen met het verwerven \nen gebruiken van taal. Als communicatie niet goed verloopt, leidt dit vaak tot onbegrip \nof frustratie bij het kind en zijn omgeving.\n\nc. Autimatisch\nVideo over normale begaafdheid en autisme of 61233 beelden over autisme. Een groepje \nvolwassenen met autisme vertelt over hun diagnoseweg en hun leven met autisme. De film \nillustreert de specifieke moeilijkheden waarmee ze te maken krijgen. Ze stoten op veel \nonbegrip en ongeloof bij het uitleggen van hun handicap: Ons autisme is niet altijd \neven zichtbaar en zeker niet op de klassieke manier.\n\n\n\na. The  sister of Einstein\nb. Unwillingness or inability\nc. Autimatisch\n\n\na. The sister of Einstein\nThe sister of Einstein \\ 'is a voorlichtingsdvd about autism for children ages 10 to 14 \nyears. The video put children with autism themselves what autism means to them. Also a \nfriend, classmate and brother have their say. It is explained that autism is related to \nthe functioning of the brains. Here a comparison is made with a computer it's like they \n 'PC ' is programmed in a different way. Various aspects of the children themselves \nand their surroundings can lead to problems are addressed, as it is difficult to \nempathize with others, detail perception, the need for visual support, sound \nsensitivity and the difficulty in adapting to new situations. The nice thing about \nvideo is that the whole design, content and pace is fully geared to children aged 10 to \n14 years. The images alternate expeditiously, it was used catchy images, clear \nlanguage, and often is the sister of rap Einstein to hear.\n\nb. Unwillingness or inability\nCommunication problems in children with an Autism Spectrum Disorder at all levels of \nlanguage development for. They often have trouble learning and using language. If \ncommunication does not go well, this leads to confusion or frustration in the child and \nhis environment.\n\nc. Autimatisch\nVideo of normal intelligence and autism or autism 61,233 images. A group of adults with \nautism and talks about their diagnoseweg their lives with autism. The film illustrates \nthe particular difficulties they face. She knocks on a lot of incomprehension and \ndisbelief when explaining their disability: Our autism is not always visible and \ncertainly not in the traditional way.\n\nSpotinformatie\n\nBron: VHS\nMenu: Ja\nAudio Taal: Nederlands\nSubs: Geen\n\nBeeld: PAL\nBeeld verhouding: 4:3\nVideo: ReEncoded\nBewerking: Autiboer\nRegio: Vrij\nHoesje: Nee\n\n\n\n\n[img]http://img708.imageshack.us/img708/589/blacksam3.jpg[/img]\n\n\n","torrent":{"xt":"urn:btih:e106dd3a04b59a77814fb3309064629a856f4945","amp;dn":"Autisme+een+leven+lang+-+DVD+3+Deel+5++++TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e106dd3a04b59a77814fb3309064629a856f4945","infoHashBuffer":{"type":"Buffer","data":[225,6,221,58,4,181,154,119,129,79,179,48,144,100,98,154,133,111,73,69]},"announce":[],"urlList":[]}}