{"title":"Ancient Rome","uid":6645409,"size":5291716,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e126b5169c6ab28af69d1a6b12581772e284f868&amp;dn=Ancient+Rome&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bookzilla","files":1,"time":1314930965,"description":"\nAncient Rome masterfully synthesizes the vast period from the second millennium BCE to the sixth century CE, carrying readers through the succession of fateful steps and agonizing crises that marked Roman evolution from an early village settlement to the capital of an extraordinary realm extending from northern Britain to the deserts of Arabia. A host of world-famous figures come to life in these pages, including Alexander the Great, Hannibal, Julius Caesar, Cleopatra, Augustus, Livia, Cicero, Nero, Hadrian, Diocletian, Constantine, Justinian, and Theodora. Filled with chilling narratives of violence, lust, and political expediency, this book not only describes empire-shaping political and military events but also treats social and cultural developments as integral to Roman history. William Dunstan highlights such key topics as the physical environment, women, law, the roles of slaves and freedmen, the plight of unprivileged free people, the composition and power of the ruling class, education, popular entertainment, food and clothing, marriage and divorce, sex, death and burial, finance and trade, scientific and medical achievements, religious institutions and practices, and artistic and literary masterpieces. All readers interested in the classical world will find this a fascinating and compelling history.\n\n\nNovember 2010\nPublisher: Rowman &amp; Littlefield\n630 pages","torrent":{"xt":"urn:btih:e126b5169c6ab28af69d1a6b12581772e284f868","amp;dn":"Ancient+Rome","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e126b5169c6ab28af69d1a6b12581772e284f868","infoHashBuffer":{"type":"Buffer","data":[225,38,181,22,156,106,178,138,246,157,26,107,18,88,23,114,226,132,248,104]},"announce":[],"urlList":[]}}