{"title":"IconBox v. 2.5.0 with keygen","uid":6862810,"size":21756651,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:e142841d3c1526be06887071316692d68df0c2c0&amp;dn=IconBox+v.+2.5.0+with+keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"polisdavid","files":-1,"time":1322967118,"description":"Official Web site: &lt;a href=&quot; http://www.iconboxapp.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.iconboxapp.com/&lt;/a&gt;\n\nNOTE: APPLICATION SHOULD BE BLOCKED FROM INTERNET (by Little Snitch f.i.)\n\nIconBox is a helpful organizational tool for Macs. When the first version of IconBox was released 7 years ago, it was the first Icon Organizer for Mac OS X, allowing users to conveniently organize their collection of icons in an iPhoto-like way. With version 2, IconBox has been completely rewritten and features a brand new interface.\n\nIconBox 2 is one App featuring 4 modes!\n\nMode 1: Organize\n\nWe have the same convenient organization features with a couple of additions. The libraries are now called &quot;Boxes&quot;. Drag icons from the finder into a box, create as many boxes as you like. Furthermore Boxes can be arranged in folders and subfolders and you can re-drag Boxes and folders to change their order. We also created &quot;Smart Boxes&quot;, like iTunes Smart Playlists, these folders are constantly updated based on given criteria. The search feature has been revamped to search for different criteria and the speed has been improved a lot.\n\nBesides organizing, you can export icons to different formats like ICNS, png, tiff, jpeg, gif, the iContainer format and last but not least as a convenient .zip package, ready to share with others.\n\nMode 2: Customize\n\nWith version 2, IconBox features full icon customization. Users can customize their system icons, dock icons, application icons and even their dock in an easy to use drag-and drop way.\n\nMode 3: Tools\n\nThe Tools section is meant to feature different Icon Tools, serving different purposes. In this new release there is 1 tool available, called &quot;XRay&quot;. More tools will be added in future releases. The XRay tool scans your application folder and lists all of the available applications. When clicking an application, you are able to peek inside the contents of an application and filter all the stuff in there by type. (png, tiff, pdf, ins) Furthermore you are able to export selected items or even every item in an application to your disk.\n\nMode 4: Online\n\nThe Online mode contains 3 features.\n\n1: Icon-Of-The-Day: A new icon from a particular icon designer every day, downloadable directly into IconBox 2, straight into the &quot;Downloaded&quot; Box, ready to share or customize. 2: IconFinder: IconBox 2 implements the powerful iconfinder.com API with which you can search all the icons on iconfinder.com without having to leave the App. Found icons are directly downloadable and also feature a link to the Designers' website. 3: Icon Sites: A convenient list of major icon sites on the web, more sites will be added on the go. Double-Clicking a site opens it up in your default web browser.\n\nIconBox 2 features a fully functional 15 day trial with the restriction of importing no more than 250 icons. It can be purchased for $24.99 to remove these restrictions. IconBox 1.5 users can upgrade their copy for only $9.99. IconBox 2 is a free upgrade to IconBox 1.5 users who purchased their copy after January 31, 2010.\n\nWhat's New\n\n* Mac OS X 10.6.8 Compatibility.\n\n* Mac OS X 10.7.2 Lion Compatibility.\n\n* Changed the mode switching toolbar to default Mac OS X toolbar\n  buttons.\n\n* It is now possible to import your complete CandyBar collection, leaving\n  the complete structure intact!\n\n* Fixed a crash when entering an empty value in one of the info fields.\n  (Author, URL, etc.)\n\n* Library more...\n\nSystem Requirements:\nPPC / Intel, Mac OS X 10.6 or later\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:e142841d3c1526be06887071316692d68df0c2c0","amp;dn":"IconBox+v.+2.5.0+with+keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e142841d3c1526be06887071316692d68df0c2c0","infoHashBuffer":{"type":"Buffer","data":[225,66,132,29,60,21,38,190,6,136,112,113,49,102,146,214,141,240,194,192]},"announce":[],"urlList":[]}}