{"title":"Yuvan Yuvathi HQ RIP 1CD","uid":6635969,"size":753109322,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e19ae5f6c20d6e9bdb40f244af1f2303819c14c3&amp;dn=Yuvan+Yuvathi+HQ+RIP+1CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1314559264,"description":"Movie:-Yuvan Yuvathi\nCast:-Bharath, Rima Kallingal, Ameer Sultan, Santhanam, mayilsamy And Many Other's...\nMusic:-Vijay Antony\nDirected:-Kumaravel\n\n\nKollywood has a greater fascination for films with romantic genres. Since time immemorial in Tamil cinema, romance has been the favourite for many filmmakers. In 'Yuvan Yuvathi', GNR Kumaravelu has woven a script that oozes with romance.\n\nMore of a marriage between 'Vinnaithandi Varuvaya' and 'Kushi', 'Yuvan Yuvathi' has been shot stylishly in Seychelles. Bharath plays a romantic young boy while newcomer Rima Kaleengal dons the role of the female lead.\n\nThough the story is pretty familiar, S Ramakrishnan with his dialogues makes it interesting, trendy and updated. And with Santhanam around with his catchy one-liners, 'Yuvan Yuvathi' proceeds well in most parts.\n\nKathirvel Murugan (Bharath) is a software engineer in Chennai. He shares his room with friend Sakkarai (Santhanam). Kathir hails from Usilampatti but wants to project him as city-bred and his ambition is to settle in USA. Kathir's father Sevaka Pandian (Sampathraj) is against his son's attitude. An influential local chieftain, he is against inter-caste marriage and love. Kathir meets Nisha (Rima Kaleengal), who too wants to go abroad. The latter loses her passport and Kathir helps her find it.\n\nSlowly Kathir falls for her. Meanwhile, Sevaka Pandian arranges for his son's wedding with a High Court judge's daughter. In the meantime, Kathir and Nisha get their visa and get ready to leave together for USA.\n\nThe former thinks that he has escaped from his marriage and when he wants to propose to Nisha, he gets a rude shock. She informs him that she is going to USA for her marriage. What happens after this forms the rest of the plot.\n\nBharath is as usual bubbly on screen. His new hair-do and smart looks are impressive; he has action, romance and comedy to do in the movie. He strikes the right chord with his dancing skills as well. Rima Kaleengal is simple but sweet. She suits the character well. She reminds one of Navya Nair in many places.\n\nSanthanam walks way with applause with his witty one-liners. His humour helps us to be engrossed. 'Five Star' fame Krishna plays a cameo. Watch out for Sampathraj. He is at his best in a complex role.\n\nS Ramakrishnan's dialogues liven up the proceedings. Cinematographer Kovi Jagatheeswaran captures the beauty of Seychelles well. Vijay Antony's music is as usual racy...\n\nProduced by Baija and presented by Dr V Ramadoss on Ram Pictures (P) Ltd banner, 'Yuvan Yuvathi', though interesting, has many scenes that are cliched and beaten-to-bush. Locations are new however.\n","torrent":{"xt":"urn:btih:e19ae5f6c20d6e9bdb40f244af1f2303819c14c3","amp;dn":"Yuvan+Yuvathi+HQ+RIP+1CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e19ae5f6c20d6e9bdb40f244af1f2303819c14c3","infoHashBuffer":{"type":"Buffer","data":[225,154,229,246,194,13,110,155,219,64,242,68,175,31,35,3,129,156,20,195]},"announce":[],"urlList":[]}}