{"title":"BurnAware Professional 3.4","uid":6570012,"size":5978690,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e1b8748a6c8dd8f917541c34c604e5f53963fb84&amp;dn=BurnAware+Professional+3.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"djjlicious","files":-1,"time":1311900420,"description":"BurnAware Professional is a powerful CD, DVD and BD disc burning solution intended for users who need maximum control over every aspect of the burning process and use multiple burners for mass-production of various discs and quick creation of disc-to-disc copies.\n\nThe program enables users to create data discs (CD, DVD, Blu-Ray, bootable CD and DVD discs) and discs with multimedia content (Audio CD, MP3 discs and DVD video discs). Apart from this, BurnAware Pro will help you create and burn ISO images (ISO and CUE/BIN image files supported), erase rewritable discs, burn multisession discs and even extract specific files from disc sessions and tracks from Audio CDs. A simple and intuitive interface of the program will make even novices feel comfortable with the program features.\n\nThe software supports the most popular Windows versions, including NT/2000/XP/Vista/7 (32 and 64-bit) and does not require the .NET framework to operate.\n\nData\n\n    Back up or copy your files to CD, DVD or Blu-ray Discs.\n    Supports CD-R/RW, DVD-R/RW, DVD+R/RW, BD-R/RE and DVD-RAM media,\n    including high-capacity double-layer media.\n    Supports UDF (Universal Disc Format 1.02-2.60), Bridge and the \n    ISO9660 file system, including Joliet Unicode extensions.\n    Create a bootable CD or DVD. Use it as a very big floppy boot disc \n    for recovery purposes.\n    El Torito creation support with advanced options: emulation type, \n    sectors, platform, load segment and boot message.\n    Append multisession discs. Discs can be used for sequential recording, \n    as the new data will co-exist perfectly alongside previously recorded data.\n    Any session import support.\n    Supports multisession for DVD-RW/+RW.\n\nMultimedia\n\n    Create Audio CDs. Play a CD on your traditional CD player or car stereo.\n    Supports MP3, WAV, WMA, OGG, M4A, AAC and FLAC audio formats and M3U playlists.\n    Supports title and track CD-Text, including Unicode.\n    On-the-fly writing support with Track-at-once and Disc-at-once recording modes.\n    Create MP3 CDs and DVDs.\n    Supports MP3 and WMA audio formats.\n    Create DVD-Video. Play these DVDs using your standard DVD player, \n    PlayStation  or Xbox.\n    Supports DVD padding.\n\nDisc Images\n\n    Burn disc images. Create a CD, DVD or Blu-ray disc from a disc image file.\n    Supports ISO and CUE/BIN image files.\n    Make standard or boot ISOs. Back up or copy your files to an ISO image file.\n    Supports different file systems and ISO levels.\n    Copy disc to ISO image. This feature can be used for disc backup, \n    as well as for disc copying.\n\nUtilities\n\n    Multiburn. Write ISO image files to multiple recorders simultaneously.\n    Copy CD, DVD or Blu-ray Discs. Make exact copies of your DVD-Video, \n    Audio CD or standard Data discs.\n    Recover files. Extract files from different sessions, \n    corrupted discs or extract audio tracks from Audio CDs.\n    Erase re-writable CD, DVD or Blu-ray discs.\n    Supports quick and complete erase methods.\n\nRead the ReadMe file and enjoy! And seed after downloading!\n","torrent":{"xt":"urn:btih:e1b8748a6c8dd8f917541c34c604e5f53963fb84","amp;dn":"BurnAware+Professional+3.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1b8748a6c8dd8f917541c34c604e5f53963fb84","infoHashBuffer":{"type":"Buffer","data":[225,184,116,138,108,141,216,249,23,84,28,52,198,4,229,245,57,99,251,132]},"announce":[],"urlList":[]}}