{"title":"Gale Group Encyclopedia of Medicine 2nd Ed (5Vol){BBS}","uid":6629652,"size":83437345,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3d69b7ef7387de6c1531d0a83f9bd22a671f8ff&amp;dn=Gale+Group+Encyclopedia+of+Medicine+2nd+Ed+%285Vol%29%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"bigbluesea","files":-1,"time":1314283885,"description":"General reference collections always have a need for current, authoritative consumer-health information. Gale Encyclopedia of Medicine readily serves this function. Written by a team of medical experts at a level accessible to the general reader, this revised edition is designed as a ready-reference source. One hundred new entries and 250 updated entries distinguish this from the earlier edition.\n\nThe 1,750 alphabetically arranged entries range in length from one paragraph to several pages and follow a standard format that varies by the type of article. Articles on diseases, for example, have sections on causes and symptoms, diagnosis, treatment (including alternative treatment), prognosis, and prevention. Topics addressed encompass diseases, disorders, and conditions (Bird flu, Breast cancer, Elephantiasis, Post-traumatic stress disorder); tests and procedures (Cystoscopy, Ear exam with an otoscope,Thyroid nuclear medicine scan); therapies (Cognitive-behavioral therapy, Massage therapy, Pet therapy; alternative treatments (Acupuncture, St. John's wort); and drugs (Antiasthmatic drugs, cocaine). Definitions for the key terms in many articles are highlighted in a sidebar. Some 675 color photos, tables, and line drawings supplement the text. A listing of both print and online resources--such as books, periodicals, and organizations--related to the topic is included at the end of many articles; in addition, a 22-page listing of addresses and Web sites for organizations associated with specific medical conditions is provided. Cross-references direct readers to related entries. An impressively comprehensive, well-constructed 400-page index provides subject access to the contents.\n\nThe Gale Encyclopedia of Medicine is an excellent source for accurate, up-to-date medical information aimed at the layperson and is highly recommended for public, special, and academic libraries. The functionally similar Magill's Medical Guide (2004) has fewer articles and is proportionately less expensive. A useful supplement to this and other print medical sources is the free, frequently updated online MedlinePlus Medical Encyclopedia, from the National Institutes of Health [http://www.nlm.nih.gov/medlineplus/encyclopedia.html]. Nancy Cannon\nCopyright Ã‚Â© American Library Association. All rights reserved\n\n\n    * Hardcover: 4000 pages\n    * Publisher: Gale; 3 edition (June 23, 2006)\n    * Language: English\n    * ISBN-10: 1414403682\n    * ISBN-13: 978-1414403687","torrent":{"xt":"urn:btih:e3d69b7ef7387de6c1531d0a83f9bd22a671f8ff","amp;dn":"Gale+Group+Encyclopedia+of+Medicine+2nd+Ed+%285Vol%29%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3d69b7ef7387de6c1531d0a83f9bd22a671f8ff","infoHashBuffer":{"type":"Buffer","data":[227,214,155,126,247,56,125,230,193,83,29,10,131,249,189,34,166,113,248,255]},"announce":[],"urlList":[]}}