{"title":"The Engadget Show 07-27-2011","uid":6570453,"size":964417556,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:e3eff9bd50e424442a06839a7086183d115ad5a0&amp;dn=The+Engadget+Show+07-27-2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"apfelsine91","files":-1,"time":1311951154,"description":"The Engadget Show - 023: We tour a headphone factory, talk record labels, and look at They Might Be Giants' favorite gadgets\n\nThe Engadget Show is back, and this time we're in full-on rock star mode. We kick things off with a trip to the Engadget Laboratories, where Brian and Terrence test out some sub-$100 headphones on a quartet of guinea pigs. Do you really get what you pay for when you buy a pair of earbuds from your local Big Box retailer?\n\nThings get a bit ritzier when Darren tours Westone's laboratories in Colorado to find out how a pair of $950 in-ear headphones are made. Hint: it involves squirting silicone into our managing editor's ears and a whole lot of sanding.\n\nNext up, we stop by the reviews table, where Tim and Brian take a look at this month's most exciting gadgets, including the new MacBook Air, Sony Vaio Z, Toshiba Thrive, and Droid 3.\n\nJohn Flansburgh and John Linnell of They Might Be Giants pay a visit to Engadget headquarters to show off some of their favorite lo-fi musical gadgets, including the Stylophone and a circuit-bent Speak and Spell. Also, if you've ever wondered what the long reigning kings of underground geek rock would sound like given the T-Pain treatment, this is a segment you're not gonna want to miss.\n\nUniversal Republic Records' VP Digital Colleen Quill also stops by to discuss the role of the major label in the world of Twitter, iTunes, Spotify, and the like. And we wrap things up with a performance by New York City's own Cookies.\n\nThe video stream of the show is above, and you can also download us in HD below. Oh, and if you're still waiting for some Spotify invites, don't worry -- we've got you covered.\n\nHosts: Tim Stevens, Brian Heater\nSpecial guests: Terrence O'Brien, They Might Be Giants , Colleen Quill\nProducer: Guy Streit\nDirector: Michelle Stahl\nExecutive Producers: Joshua Fruhlinger and Michael Rubens\nMusic by: Cookies","torrent":{"xt":"urn:btih:e3eff9bd50e424442a06839a7086183d115ad5a0","amp;dn":"The+Engadget+Show+07-27-2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3eff9bd50e424442a06839a7086183d115ad5a0","infoHashBuffer":{"type":"Buffer","data":[227,239,249,189,80,228,36,68,42,6,131,154,112,134,24,61,17,90,213,160]},"announce":[],"urlList":[]}}