{"title":"What If............  (2010) Christian Movie","uid":6654313,"size":736959548,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e411757f05ac230528482c1b29d212669e740902&amp;dn=What+If............++%282010%29+Christian+Movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cindy25","files":1,"time":1315272334,"description":"What if... tells the story of Ben Walker (Kevin Sorbo), who fifteen years ago left his college sweetheart Wendy (Kristy Swanson), and his calling to be a preacher, in order to pursue a business opportunity. Now with a high-paying executive gig, a trophy fiance', and a new Mercedes, he hasn't considered a family nor felt the need to set foot in a church.\n\nBut God has other plans. While on a thrill ride outside the city, his new car mysteriously breaks down, and he's visited by a tow truck driver named Mike (John Ratzenberger) who claims to be an angel sent to show Ben what his life would look like had he followed his true calling. Suddenly Ben wakes up in the middle of domestic chaos as his &quot;wife&quot; Wendy and daughters (including Disney Channel's Debby Ryan) are getting ready for church, where Ben is the new pastor.\n\nBefore he can get back to his old life, Ben must first embrace this reality and discover the value of faith and family, and perhaps restore his love for those who were heartbroken fifteen years ago: Wendy...and God. In the tradition of &quot;It's a Wonderful Life&quot; and &quot;The Family Man,&quot; What If... is a story of finding your true purpose in life.","torrent":{"xt":"urn:btih:e411757f05ac230528482c1b29d212669e740902","amp;dn":"What+If............++%282010%29+Christian+Movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e411757f05ac230528482c1b29d212669e740902","infoHashBuffer":{"type":"Buffer","data":[228,17,117,127,5,172,35,5,40,72,44,27,41,210,18,102,158,116,9,2]},"announce":[],"urlList":[]}}