{"title":"Democracy Now - 05 aug 2011","uid":6585236,"size":453451995,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e4840b3a33d8d8f725acf8d6740f41dc54a9c169&amp;dn=Democracy+Now+-+05+aug+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1312578693,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Aug 05, 2011\n\n- U.S.: 29,000 Children Have Died in Somalia Famine\n- Toll Rises in Syrian Gov't Attack on Hama\n- Rebels Claim Gaddafi's Son Killed in Air Strike\n- Libyan Regime: NATO Attack Kills 3 Civilians\n- Obama Admin OKs Shell Drilling in Arctic Ocean\n- U.N.: Shell Responsible for Over $1 Billion in Damage to Niger Delta\n- Shells Admits Fault for 2 Nigeria Spills\n- Pentagon Chief Warns of Spending Cuts\n- U.S. Veteran Allowed to Sue Former Defense Secretary Donald Rumsfeld for Torture\n- Obama, Congress Reach Deal on FAA Shutdown\n- Japan Fires 3 Bureaucrats for Nuclear Crisis\n- Italian PM Pushes Austerity Deal\n\n\nSpecial reports\n\n- Cargill Meat Recall Heightens Fears Budgets Cuts Will Weaken Oversight, Threaten Public Health\n\nIn one of the largest meat recalls in U.S. history, this week the food giant Cargill ordered the recall of 36 million pounds of ground turkey. The recall came after at least one person died from Salmonella, and another 76 people fell ill, from turkey products traced to Cargill's processing plant in Springdale, Arkansas. According to the federal Center for Disease Control and Prevention, the Salmonella outbreak involves a strain of the bacteria known as Salmonella Heidelberg, which is resistant to many commonly prescribed antibiotics. Although the recall was announced this week, the outbreak began in March. More than 3,000 people die a year from food poisoning in the United States, and millions more get sick. Food safety advocates say this latest outbreak shows how budget cuts have hampered the ability of federal and state health agencies to effectively protect public health. We speak with Patty Lovera, assistant director of the food safety group, Food &amp; Water Watch. &quot;As Congress comes back this fall...in budget-cutting mode [where] nothing is really sacred, we need to be telling them food safety inspections...are not acceptable places to find these savings,&quot; Lovera says.\n\n\n- Secretive Corporate-Legislative Group ALEC Holds Annual Meeting to Rewrite State Laws\n\nHundreds of state legislators from all 50 states have gathered in New Orleans for the annual meeting of the American Legislative Exchange Council, known as ALEC. Critics say the Washington-based organization plays a key role in helping corporations secretly draft model pro-business legislation that has been used by state lawmakers across the country. Unlike many other organizations, ALEC's membership includes both state lawmakers and corporate executives who gather behind closed doors to discuss and vote on model legislation. In recent months, ALEC has come under increasing scrutiny for its role in drafting bills to attack workers' rights, roll back environmental regulations, privatize education, deregulate major industries, and passing voter ID laws. Nonetheless, this year's annual ALEC meeting boasts the largest attendance in five years, with nearly 2,000 guests in attendance. We go to New Orleans to speak with Lisa Graves, executive director of the Center for Media and Democracy. Last month, her organization released 800 model bills approved by companies and lawmakers at recent ALEC meetings.\n\n\n- New ExposÃƒÂ© Tracks ALEC-Private Prison Industry Effort to Replace Unionized Workers with Prison Labor\n\nMany of the toughest sentencing laws responsible for the explosion of the U.S. population were drafted by the American Legislative Exchange Council, which helps corporations write model legislation. Now a new exposÃƒÂ© reveals ALEC has paved the way for states and corporations to replace unionized workers with prison labor. We speak with Mike Elk, contributing labor reporter at The Nation magazine. He says ALEC and private prison companies &quot;put a mass amount of people in jail, and then they created a situation where they could exploit that.&quot; Elk notes that in 2005 more than 14 million pounds of beef infected with rat feces processed by inmates were not recalled, in order to avoid drawing attention to how many products are made by prison labor.\n\n\n- Jury Still Out on New Orleans Police Accused of Shooting Unarmed Katrina Survivors on Danziger Bridge\n\nThis week federal prosecutors in New Orleans finished presenting their case against police officers involved in the infamous Danziger Bridge shooting in the days after Hurricane Katrina. Four police officers are charged with shooting six unarmed civilians, killing two. A fifth officer is accused of helping them cover up their crimes. On Wednesday, the trial culminated in final arguments, leaving the case in a jury's hands. A verdict could come as early as today.* We are joined in New Orleans by independent journalist Jordan Flaherty, who has been in the courtroom following the case, and Norris Henderson, a longtime community organizer and former co-director of Safe Streets/Strong Communities, a group that played a key role in helping the families of the victims in this case come forward to seek justice. &quot;At the closing statement, one of the most moving moments was Bobbi Bernstein, the federal prosecutor, said, 'The real heroes are these families who continued struggling against a justice system that had failed them for all these years.'&quot; says Flaherty.\n\n*UPDATE: The five New Orleans police officers have been convicted in the deaths of two people and the injuring of four others on the Danziger Bridge in the days after Hurricane Katrina.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:e4840b3a33d8d8f725acf8d6740f41dc54a9c169","amp;dn":"Democracy+Now+-+05+aug+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4840b3a33d8d8f725acf8d6740f41dc54a9c169","infoHashBuffer":{"type":"Buffer","data":[228,132,11,58,51,216,216,247,37,172,248,214,116,15,65,220,84,169,193,105]},"announce":[],"urlList":[]}}