{"title":"Philippe Mora - Swastika (1974) pre-WWII Nazi documentary","uid":6618631,"size":6322612224,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e652c47935da87408193e77cc82a8fb5d0191e66&amp;dn=Philippe+Mora+-+Swastika+%281974%29+pre-WWII+Nazi+documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"oddeven","files":-1,"time":1313899300,"description":"This film has come out of decades of near obscurity.\n\nOriginally director Philippe Mora (Communion, The Return of Captain Invincible, Mad Dog Morgan, to paint a varied picture) planned to make a film of the just published memoirs of Albert Speer &quot;Inside the Third Reich&quot;.  While researching that he and his colleagues met Speer, and bit by bit the existence of a trove of &quot;home movies&quot; and other documentation were uncovered, their existence at that point mainly just rumor. This film arose once the reality of making &quot;Inside the Third Reich&quot; went up in smoke. It was eventually made for TV later, in 1982, with a star-studded cast.\n\nThis film covers the years from 1933 to 1938, so it really covers a time period that hadn't really been saturated with history books and films.  Interestingly, and perhaps for some, annoyingly, if they watch it unaware, the filmmakers imported (this is a UK film) lip readers from Germany, and then dubbed the voices in many of the scenes. Without knowing this you may get frustrated with the sound dropping out - it is really &quot;dropping in&quot;! The subtitles (hard-coded) are all you have as a narrative, and they are a bit sparse.  There is no narrator piecing the story together for you.\n\nA lot of the criticism of this film came from people who thought it portrayed Hitler as too human.  The filmmakers themselves were a bit puzzled with this perception, as they figured that, from the get-go, Hitler was known to be an evil man, and that this presentation was simply to broaden that perspective to allow the general public to break down the wall that was allowing Hitler to remain mythic.  Sort of like accepting the fact that &quot;Just because George W. Bush said it, doesn't mean it is wrong&quot;.\n\nSome notably controversial episodes: Jesse Owens praising his reception in Germany - quite worth exploring his treatment by Hitler, the German people, Roosevelt, and his homecoming parade.  Author James Baldwin was upset by this part of the film. A person who may just be mythical in his entirety, Dirk Brinkley, a supposed American radio personality, is shown singing the praises of Nazi Germany as &quot;the best central government in the world&quot;. I can't find anything conclusive about his existence, just many references to this film - very recursive research! He did bring to mind Howard W. Campbell Jr, a Kurt Vonnegut character from Mother Night.\n\nThere is even a tiny glimpse into that era's erotica.\n\nA fair amount of this footage is in color, which, I presume, for most will be a little jarring.  History of that era seems so naturally black and white.\n\nThere are a ton of extras with so much interesting in the way of details - how it was made, the controversy, the minutiae of the players, etc. There's a five minute audio diatribe called &quot;Puncturing the Myth of Leni Riefenstahl&quot; which pours out the venom on that opportunistic &quot;monster&quot;.\n\nIf watching 95 minutes of &quot;home movies&quot; leaves you hungering for a more direct cerebral massage, definitely do not disregard the extras.\n\nWould make a fine double-feature with &quot;Die Wannseekonferenz&quot; (1984) \n\nUncompressed PAL DVD9 VIDEO_TS files","torrent":{"xt":"urn:btih:e652c47935da87408193e77cc82a8fb5d0191e66","amp;dn":"Philippe+Mora+-+Swastika+%281974%29+pre-WWII+Nazi+documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e652c47935da87408193e77cc82a8fb5d0191e66","infoHashBuffer":{"type":"Buffer","data":[230,82,196,121,53,218,135,64,129,147,231,124,200,42,143,181,208,25,30,102]},"announce":[],"urlList":[]}}