{"title":"Abuela de verano 1x02 [tvrip][spanish]","uid":6581756,"size":522076160,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e667a37068c5d0269ba18fa4318f255f7f594b39&amp;dn=Abuela+de+verano+1x02+%5Btvrip%5D%5Bspanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"furtaperas","files":-1,"time":1312442896,"description":"TÃƒÂ­tulo original: Abuela de Verano\nPaÃƒÂ­s: EspaÃƒÂ±a\nAÃƒÂ±o: 2005\nGÃƒÂ©nero: Comedia\nProductora: Rodad y rodar\nReparto: Rosa MarÃƒÂ­a SardÃƒÂ¡, Nur Al Levi, Blanca ApilÃƒÂ¡nez, Jordi Bosch, Gonzalo Cunill, Albert Dueso, Laura Jou, Pol Mainat, Laura MaÃƒÂ±ÃƒÂ¡, Marc MartÃƒÂ­nez, Elvira MÃƒÂ­nguez, Xavi Mira, Francesc Orella, Ana Rayo, Clara Segura\n\nSINOPSIS\n\nAbuela de Verano es una ambiciosa producciÃƒÂ³n de trece capÃƒÂ­tulos sobre el personaje de Eva, una abuela que cada verano se lleva a sus 12 nietos a una casa de campo que tiene en la comarca gerundense del EmpordÃƒÂ . El argumento sigue las aventuras de esta mujer, interpretada por Rosa MarÃƒÂ­a SardÃƒÂ , que a sus sesenta aÃƒÂ±os tiene la valentÃƒÂ­a de convivir durante el mes de julio con esa tropa de niÃƒÂ±os y niÃƒÂ±as, con edades comprendidas entre los 5 a los 15 aÃƒÂ±os. Eva establece normas especiales en lo referente a turnos de cocina, excursiones en bicicleta, cuidado de animales, horarios y toma de decisiones acordadas democrÃƒÂ¡ticamente. Por ÃƒÂºltimo estÃƒÂ¡n los hijos, el grupo adulto. Cinco familias que abren nuevas tramas consituaciones y conflictos que van y vienen durante toda la serie. Y es que Con el descubrimiento de la vida de los nietos los espectadores podrÃƒÂ¡n recordar hechos de su propia infancia.\n\nEva SaguÃƒÂ©s se dispone como todos los veranos a pasar el mes de julio con sus doce nietos, cinco hijos y sus respectivas parejas en su masÃƒÂ­a del EmpordÃƒÂ  en Girona. Ese es el ÃƒÂºnico tiempo que comparte con ellos puesto que vive en Madrid. Naturalmente, Eva no se enfrenta a esa tarea sola. Para esas colonias veraniegas cuenta con la inestimable ayuda de su jardinero y hombre de confianza Abdel, de su cocinera Mercedes y de la polivalente y maravillosa Carmen con su hija veinteaÃƒÂ±era Teresa, que cada dÃƒÂ­a estÃƒÂ¡ mÃƒÂ¡s guapa y ese aÃƒÂ±o se ha echado un noviete, Roger.\n\nAbuela de verano estÃƒÂ¡ basado en la obra de Rosa RegÃƒÂ s &quot;Diario de una abuela de verano","torrent":{"xt":"urn:btih:e667a37068c5d0269ba18fa4318f255f7f594b39","amp;dn":"Abuela+de+verano+1x02+%5Btvrip%5D%5Bspanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e667a37068c5d0269ba18fa4318f255f7f594b39","infoHashBuffer":{"type":"Buffer","data":[230,103,163,112,104,197,208,38,155,161,143,164,49,143,37,95,127,89,75,57]},"announce":[],"urlList":[]}}