{"title":"F.E.A.R 3 direct play....","uid":6613632,"size":4928032796,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e6999ae53169c95e20d3d836f3435f18b1776b03&amp;dn=F.E.A.R+3+direct+play....&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"amir741","files":76,"time":1313690633,"description":"\n\nGameplay.......\n\nF.E.A.R. 3 includes features such as &quot;co-op, an evolved cover system, and more scares&quot;, according to Day 1 Studios founder and president Denny Thorley.[3] In the game, the players control either Point Man or Paxton Fettel, the protagonist and antagonist, respectively, from the first game, F.E.A.R.. The control system for the Point Man is the same as the previous two games, giving the player a command list typical of most first person shooter games (the ability to fire weapons, throw grenades, melee, activate/use items etc), as well as the ability to slow time. As Fettel, the player assists the Point Man by using telekinesis, stun, possession, a melee attack unique to Fettel and other abilities. In addition to these abilities, the player also has full access to the abilities of any character Fettel possess'. Both chracters have the ability to access and control enemy technology (such as mech suits). Also, the game has both online and offline Co-Op play. And as confirmed at last year's E3, there is split-screen Co-Op. [4] Once you complete a level as Point Man, in the multi player mode, you can then replay that level in single player as Paxton Fettel.\n[edit]Multiplayer\n\nThere are four game modes that are going to be included in F.E.A.R. 3 multiplayer. The four game modes are &quot;Fucking Run&quot; &quot;Contractions&quot; &quot;Soul Survivor&quot; and &quot;Soul King&quot;. &quot;Fucking Run&quot; features 4 players running through waves of enemies, all the while running from Alma's massive &quot;Wall of Death.&quot; The players start off in a safe room and proceed through levels, killing enemies within a certain amount of time. [5] There are several safe rooms throughout the mode, and if a player is downed, one of the co-op players can revive them. If one player is killed the game is over. &quot;Contractions&quot; is a survival round-based game mode where you must barricade and stock up weapons against 20 waves of enemies from the F.E.A.R. 3 single player, similar to Call of Duty's &quot;Nazi Zombies,&quot; although the farther you increase through the waves the tougher it gets by adding a fog effect that creeps closer and closer making the map much more dangerous. &quot;Soul Survivor&quot; has four players pitted against each other with one player playing as a &quot;Spectre&quot; in which he or she has to possess enemies to kill the other three players and turn them into Spectres before the time runs out. &quot;Soul King&quot; is similar to Soul Survivor but with the exception that all the players play as Spectres and must possess enemies to kill each other and collect dropped souls. Teamwork and cooperation is needed for players to win in the game modes.\n\n..................................System Requirements..............................\n\n\nFEAR 3 Minimum System Requirements:\nOS: Windows XP\nCPU: Intel Core 2 Duo 2.4Ghz, AMD Athlon X2 4800+\nRAM: 2GB\nGFX: NVIDIA 8800 GT 512MB RAM, ATI 3850HD 512Mb RAM or better \nHDD: 10GB Free Hard Drive Space\nDirectX: 9.0c\n\n\nFEAR 3 Recommended System Requirements:\nOS: Windows 7\nCPU: Intel Core 2 Duo 2.93Ghz+, Intel quad core 2.66Ghz+, AMD Phenom II X2 550, 3.1Ghz+\nRAM: 4GB\nGFX: NVIDIA GTS 450, ATI 5750HD 512Mb RAM or better\nHDD: 10GB Free Hard Drive Space\nDirectX: 11\n\n","torrent":{"xt":"urn:btih:e6999ae53169c95e20d3d836f3435f18b1776b03","amp;dn":"F.E.A.R+3+direct+play....","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6999ae53169c95e20d3d836f3435f18b1776b03","infoHashBuffer":{"type":"Buffer","data":[230,153,154,229,49,105,201,94,32,211,216,54,243,67,95,24,177,119,107,3]},"announce":[],"urlList":[]}}