{"title":"Cyber Update Des.2011-------WP_16795 - Roxanne Hall and Bobbi ","uid":6859959,"size":758409852,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e6d8b5b2564945917e1e1a64e740f4ae5e2928a7&amp;dn=Cyber+Update+Des.2011-------WP_16795+-+Roxanne+Hall+and+Bobbi+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":1,"time":1322849711,"description":"From Kink.com    (Wiredpussy)\n\n\n\nClive Barker wrote that the most temporary words someone can utter is, &quot;I love you.&quot; Truer words were never spoken for Bobbi Starr, who finds out her partner and, the very beautiful MILF, Roxanne Hall, has been cheating on her. Bobbi turns what looks like an intimate dinner for two into a night of revenge. Restraining Roxanne with zip ties and wrapping her torso and tits topped by erect nipples with cellophane, Bobbi serves up an appetizer of sexual electrical play, with two sets of clover clamps applied to her feet. A metal pussy plug sparking with electricity deep in Roxanne compels the British blonde to cum. Moving to the night's main course, Roxanne's legs are tied back, her wrists behind her back. Finding herself as a sub with sticky pads applied to backside, Roxanne's pussy winks and gapes to Bobbi's bidding. The events move on with Bobbi taking out her rage on Roxanne with the Samurai. Bobbi gets her own pleasure riding Roxanne's face, outfitted with a dildo gag that penetrates deep into the dom. But you can't say that Bobbi isn't fair in the end, and with her fist powerfucking her pussy into orgasmic oblivion, she makes Roxanne cum again and again. Dessert is served with Roxanne in a harness gag while positioned in the doggy position, ass out for invitingly for east access and her breasts topped off with rock-hard nipples like dark cherries (and wired for electrical stimulation). Bobbi ends the night, and the relationship, fucking Roxanne's worn wet cunt with an electric acrylic dildo into one climax to the next. \n\n\n\nScreens &lt;a href=&quot; http://www.wiredpussy.com/site/shoot.jsp?shootId=16795&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.wiredpussy.com/site/shoot.jsp?shootId=16795&lt;/a&gt;\n\n\n\nCheerz  :-)","torrent":{"xt":"urn:btih:e6d8b5b2564945917e1e1a64e740f4ae5e2928a7","amp;dn":"Cyber+Update+Des.2011-------WP_16795+-+Roxanne+Hall+and+Bobbi+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6d8b5b2564945917e1e1a64e740f4ae5e2928a7","infoHashBuffer":{"type":"Buffer","data":[230,216,181,178,86,73,69,145,126,30,26,100,231,64,244,174,94,41,40,167]},"announce":[],"urlList":[]}}