{"title":"Johnny Griffin - Live At Ronnie Scott's (FLAC)","uid":7025417,"size":356347960,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:eb93a5c77439d5167265e2e7f978cfb3520112ab&amp;dn=Johnny+Griffin+-+Live+At+Ronnie+Scott%5C%27s+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"tiddler222","files":12,"time":1328975733,"description":"\nReleased 2008 on the German 'In + Out' label.\n\nReview by Ken Dryden (AMG):\nJohnny Griffin spent several decades living and working in Europe prior to his death, though he made occasional trips to the U.S. These live tracks come from two nights at Ronnie Scott's in London in 2008 a little over a month after Griffin's 80th (and what turned out to he his final) birthday, with the Little Giant joined by trumpeter Roy Hargrove and drummer Billy Cobham, plus bassist Reggie Johnson (an expatriate American also living in Europe) and English pianist David Newton, a last-minute substitute for James Pearson, who had worked with Griffin previously leading the house rhythm section but was unable to make one of the evenings booked. Griffin frequently has Hargrove solo first and the trumpeter steps things up a notch above his usual fine playing in the jazz master's presence. An obvious favorite is Griffin's sassy blues &quot;The JAMFs are Coming,&quot; in which he leaves no doubt about how he feels about them, working in a hilarious quote from &quot;Turkey in the Straw&quot;; Hargrove's rich flÃƒÂ¼gelhorn and Griffin's heartfelt tenor shine in the saxophonist's touching, bittersweet ballad &quot;When We Were One&quot;; while their chemistry is also extraordinary in Clifford Brown's exuberant bop vehicle &quot;The Blues Walk.&quot; James Pearson spells Newton on the rousing take of &quot;Lester Leaps In,&quot; with Hargrove and the pianist bracketing the leader's tightly knit solo. Paul Kuhn takes over the piano for Griffin's warm vocal rendition of &quot;How Deep Is the Ocean.&quot; The rousing finale is an extended workout of Griffin's &quot;Hot Sake,&quot; an easily recognizable reworking of &quot;What Is This Thing Called Love.&quot; It's sad that Johnny Griffin died only two months after these performances, but one hearing will tell you he played his heart out during his final record date.\n\n01. Lester Leaps In   \n02. When We Were One    \n03. The Blues Walk    \n04. Mentor  \n05. How Deep Is The Ocean  \n06. The Jamfs Are Coming    \n07. Hot Sake   \n","torrent":{"xt":"urn:btih:eb93a5c77439d5167265e2e7f978cfb3520112ab","amp;dn":"Johnny+Griffin+-+Live+At+Ronnie+Scott%5C%27s+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb93a5c77439d5167265e2e7f978cfb3520112ab","infoHashBuffer":{"type":"Buffer","data":[235,147,165,199,116,57,213,22,114,101,226,231,249,120,207,179,82,1,18,171]},"announce":[],"urlList":[]}}