{"title":"Ricky Martin - Ricky Martin","uid":6632873,"size":512851599,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ebd0857d712838416a6f27f338b115ecaa29e178&amp;dn=Ricky+Martin+-+Ricky+Martin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cdda-flac","files":-1,"time":1314437347,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51QIX6rQChL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51QIX6rQChL._SS500_.jpg&lt;/a&gt;\n\n\nTitle: Ricky Martin\nArtist: Ricky Martin\nAudio CD (May 11, 1999)\nOriginal Release Date: May 11, 1999\nNumber of Discs: 1\nGenre: Latin\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Livin' la Vida Loca\n02. Spanish Eyes\n03. She's All I Ever Had\n04. Shake Your Bon-Bon\n05. Be Careful (Cuidado con Mi CorazÃƒÂ³n) [Feat. Madonna]\n06. I Am Made of You\n07. Love You for a Day\n08. Private Emotion [Feat. Meja]\n09. The Cup of Life (Spanglish Radio Edit)\n10. You Stay With Me\n11. Livin' la Vida Loca (Spanish Version)\n12. I Count the Minutes\n13. Bella (She's All I Ever Had)\n14. MarÃƒÂ­a [Spanglish Radio Edit]\n\n\nAmazon Review:\nPuerto Rican superstar Ricky Martin's self-titled first English-language album is a triumph of an omnivorous world-pop sensibility--but more important is that at its best, it's a real kick. The first single, &quot;Livin' la Vida Loca,&quot; employs a revved-up ska tempo to praise a girl whose &quot;lips are devil red [and] skin's the color of mocha.&quot; Martin is no less irresistible on the disc's other uptempo numbers, such as &quot;Spanish Eyes,&quot; &quot;The Cup of Life&quot; (the 1998 World Cup theme which with he stole the Grammy telecast a few months before this CD's release), and the Soul Coughing-indebted &quot;Shake Your Bon Bon.&quot; Ricky Martin loses momentum with its draggier ballads--even the much-touted Madonna duet, &quot;Be Careful (Cuidade con Mi Corazon),&quot; doesn't spark--but overall, it deserves its inevitable multiplatinum success.\n\nAllmusic Review:\nIt was just a matter of time before Ricky Martin broke into the pop mainstream. By the end of the '90s, he was no longer the kid that used to be in Menudo or the General Hospital heartthrob -- he was a genuine star, ready to bust out of the Latin pop ghetto. His dynamic performance at the 1999 Grammys stole the show, announcing his presence to middle America -- and conveniently paving the way for the May release of Ricky Martin, his second eponymous album but first English-language record. Like most records that are crafted to sell an artist to a larger audience -- think Celine Dion's Falling Into You -- Ricky Martin is a big, bold album with something to please everyone, from his longtime Latin fans to housewives with a weakness for dramatic ballads. Reportedly two years in the making, the album never makes a wrong move, balancing infectious dance-pop with immaculately crafted power ballads, mid-tempo pop, straight-ahead rockers, and, of course, the inevitable cameos: Madonna on &quot;Be Careful (Cuidado con Mi CorazÃƒÂ³n)&quot; and Meja on &quot;Private Emotion.&quot; Since each track has been so carefully constructed to stand on its own (most likely as a single), the album plays as a series of moments, some more thrilling than others. Although there is inarguably some filler cluttering the record -- and although the production sounds weirdly dated, with tracks like &quot;I Count the Minutes&quot; and &quot;She's All I Ever Had&quot; sounding for all the world as if they were cut in 1985 -- most of the moments work and the opening quartet (&quot;Livin' la Vida Loca,&quot; &quot;Spanish Eyes,&quot; &quot;She's All I Ever Had,&quot; and the irresistibly stupid &quot;Shake Your Bon-Bon&quot;) is positively intoxicating. If the rest of the album doesn't live up to the opening salvo, Martin does carry the day with his fine voice and undeniable charisma -- even when the songs aren't distinctive, he brings them alive. And that's the sign of a true star.","torrent":{"xt":"urn:btih:ebd0857d712838416a6f27f338b115ecaa29e178","amp;dn":"Ricky+Martin+-+Ricky+Martin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebd0857d712838416a6f27f338b115ecaa29e178","infoHashBuffer":{"type":"Buffer","data":[235,208,133,125,113,40,56,65,106,111,39,243,56,177,21,236,170,41,225,120]},"announce":[],"urlList":[]}}