{"title":"Amanda Perez - I Pray (2004)","uid":6561471,"size":81239092,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ebf437dbd8b11873fc94f068aadf6bc7c14b8959&amp;dn=Amanda+Perez+-+I+Pray+%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"piratetorrent1989","files":16,"time":1311498876,"description":"Amanda Nicole Perez is a female American R&amp;B singer-songwriter and record producer of Mexican descent.\n\nAmanda Perez was raised in Fort Wayne, Indiana and grew up in the Waynedale community of Fort Wayne. She also attended North Side High School while in Fort Wayne. In 2001, she released her first single titled \\&quot;Never.\\&quot; \\&quot;Never\\&quot; became Perez\\'s first charting single of her career, peaking at #79 on the Billboard Hot 100 sales chart. In April 2002, she released her first album, titled Where You At?, headed by Los Angeles radio DJ and A&amp;R music producer Mighty Mike Quinn (Mike Q.) under the label Powerhowse Records Beverly Hills, California. Co-production of LP included Los Angeles based producer Tony P. (Palacios). Perez scored her biggest hit in 2003 with the single \\&quot;Angel\\&quot;, which peaked at #20 on the Hot 100 sales chart and #3 at radio. This single helped the album (also called Angel) to become a hit.\n\nQuinn also directed and produced four music videos for Perez, which made MTV and charted Perez on TRL (Total Request Live)at #7 on the MTV show. The album was a hit in the United States, and made her a celebrity in her hometown, inking a deal with Universal Records. It also summoned the attention of other major record companies. And she also lost her dad Rob Vasquez.","torrent":{"xt":"urn:btih:ebf437dbd8b11873fc94f068aadf6bc7c14b8959","amp;dn":"Amanda+Perez+-+I+Pray+%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebf437dbd8b11873fc94f068aadf6bc7c14b8959","infoHashBuffer":{"type":"Buffer","data":[235,244,55,219,216,177,24,115,252,148,240,104,170,223,107,199,193,75,137,89]},"announce":[],"urlList":[]}}