{"title":"Liza Picard's London Historical Series   (4 Audiobooks)","uid":6627450,"size":2160779108,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ee2d9e09c72ff12d91c5273f014974d32e6f0874&amp;dn=Liza+Picard%5C%27s+London+Historical+Series+++%284+Audiobooks%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"neil1966hardy","files":272,"time":1314202601,"description":"Elizabeth's London\nAbridged Edition. Running Time Approx 7 hours 20 minutes\nNarrator Liza Picard\n\nLiza Picard's Elizabeth's London completes a trilogy of books on London throughout history, starting with Restoration London and followed by Dr Johnson's London. From the outset, Picard admits that Elizabethan London proved an even greater challenge to reconstruct, as &quot;few buildings survive&quot;, and &quot;artefacts and clothes from the time are rare&quot;. Nevertheless, through painstaking detail, Picard wonderfully recreates the crowded chaotic sights and smells of everyday life in late 16th-century London.\n\nHer journey starts, like so many admirers of the city from Chaucer to Ackroyd, on the river Thames, &quot;a uniform opaque grey&quot; in Elizabeth's time, but &quot;fairly unpolluted, judging from all the fish in it,&quot; and &quot;a superb processional route between the royal palaces.&quot; From here Picard surveys London life, from its main streets, its water supply and its civic buildings of timber and stone, to the houses, people, clothes, food, drink and entertainment that defined one of the most prosperous cities in 16th-century Europe.\n\nEverything is told in all its raw, sensual detail, from the ways in which &quot;the butcher's professional skills&quot; were used to disembowel those unfortunate enough to be convicted of capital offences, to the cost of pins for dressmaking--one shilling and eight pence per thousand. At times, the sheer detail of Picard's book can be overwhelming, and there is no specific argument that unites her observations, but the sheer scale of information is extremely impressive. \n\n\n\nRestoration London\nAbridged Edition.\nNarrator: Shaun Barrett\n\nMaking use of every possible contemporary source - diaries, memoirs, advice books, government papers, almanacs, even the Register of Patents - Liza Picard presents an enthralling picture of how life in London was really lived in the 1600s: the houses and streets, gardens and parks, cooking, clothes and jewellery, cosmetics, hairdressing, housework, laundry and shopping, medicine and dentistry, sex, education, hobbies, etiquette, law and crime, religion and popular beliefs.\n\n\n\nDr Johnson's London\nAbridged Edition. Running Time Approx 6 hours 40 minutes\nNarrator Fiona Shaw\n\nThis torrent has been ripped from cassettes so may have some auditory 'glitches'. I do not believe, however, that this will spoil your enjoyment of what, I think, is the best audiobook of Liza Picard's 'London' series.\n\nAbout the audiobook :\n\nLiza Picard certainly isn't tired of London. The lives that once thronged its streets are the stuff of her books, and Dr Johnson's London updates her 1997 volume, Restoration London, by one hundred years or so. Samuel Pepys gives way to Samuel Johnson and James Boswell, though, entertainingly, she shows no affection for the pair. She pursues them solely for their era, stretching 30 years from 1740 to 1770, pivoted on the publication of Johnson's Dictionary in 1755. Starting with a &quot;virtual&quot; sedan-chair tour of the city, she proceeds to elucidate every aspect of urban life, with particular attention paid to the poor, and the &quot;middling sort&quot;, a fledgling middle class. This goes some way to redressing a balance which historically has tended to favour the rich and famous, who left behind the majority of buildings and ephemera.\n\nPicard's conversational style, as bursting with rhetorical questions as a primary teacher, belies the breadth of her reading and research. Her informality breathes life into dry descriptions, and her sharp eye lends itself to shrewd selection from source passages. The familiarity of this Blackadder-esque London is borne out by its physical dimensions, with parks, hospitals and even bridges already starting to become recognisable to a contemporary eye, as well as its phenomena, such as lottery tickets and road rage. Although Picard sways between tenses with a giddy ease, adding a sprinkling of her own curious observations, her assimilation of information renders her prose sprightly, whether she be observing a meal in &quot;real time&quot;, or delighting in the medical remedies, often involving quite the worst ingredients (though it's useful to know that powdered roast mouse is a reliable cure for incontinence). \n\n\n\nVictorian London\nAbridged Edition. Running Time Approx. 6 hours 40 minutes.\n\nLike her previous books, this book is the product of the author's passionate interest in the realities of everyday life - and the conditions in which most people lived - so often left out of history books. This period of mid Victorian London covers a huge span: Victoria's wedding and the place of the royals in popular esteem; how the very poor lived, the underworld, prostitution, crime, prisons and transportation; the public utilities - Bazalgette on sewers and road design, Chadwick on pollution and sanitation; private charities - Peabody, Burdett Coutts - and workhouses; new terraced housing and transport, trains, omnibuses and the Underground; furniture and decor; families and the position of women; the prosperous middle classes and their new shops, e.g. Peter Jones, Harrods; entertaining and servants, food and drink; unlimited liability and bankruptcy; the rich, the marriage market, taxes and anti-semitism; the Empire, recruitment and press-gangs. The period begins with the closing of the Fleet and Marshalsea prisons and ends with the first (steam-operated) Underground trains and the first Gilbert &amp; Sullivan. \n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:ee2d9e09c72ff12d91c5273f014974d32e6f0874","amp;dn":"Liza+Picard%5C%27s+London+Historical+Series+++%284+Audiobooks%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee2d9e09c72ff12d91c5273f014974d32e6f0874","infoHashBuffer":{"type":"Buffer","data":[238,45,158,9,199,47,241,45,145,197,39,63,1,73,116,211,46,111,8,116]},"announce":[],"urlList":[]}}