{"title":"Simon&amp;SimonS2","uid":6516170,"size":42295853699,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ee46206183ddada1cafb4460195c0288d05352fd&amp;dn=Simon%26SimonS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"1hottruck","files":63,"time":1309827634,"description":"Simon &amp; Simon (TV Series 1981-1989)\nSeason Two\n(instructions below)\n\nFor Season One go here: http://thepiratebay.se/torrent/6116686/Complete_Simon_and_Simon_Season_1\n\nDescription:\n\\&quot; Brotherly love is put to the test as all these Season Two episodes of the action-packed adventure series Simon &amp; Simon arrive on DVD for the first time! Gerald Mcraney and Jameson Parker star as the sibling sleuths whose approaches to fighting crime are as unrelated as they come. A.J. (Parker) is slick, sophisticated and ambitious. His scruffy oldr brother, Rick (McRaney) would rather kick back and play his guitar. As private investigators, they\\'re on the hunt for criminals, counterfeiters, and contract killers on the streets of San Diego, but in order to succeed they\\'ll have to work together without driving eachother crazy in the Process! You\\'ll love this Emmy-nominated series about the mismatched detective duo with adventure coursing in their blood!\\&quot;\n\n\\&quot;Gerald McRaney and Jameson Parker star in this popular action series about two brothers, one clean-cut, suave, and ambitious, the other scruffy, tough, and eccentric, who together partner in a struggling detective agency in San Diego, CA. In constant competition with larger agencies, they are forced to take on the most difficult and dangerous cases ranging from the steamy intrigue of high society to the dirty corruption of Mexican border towns. Well-written and well-acted, Simon &amp; Simon remains one of the most beloved detective series of its era,\\&quot;\n\nInstructions:\n\nThis torrent includes four .nrg disc image files ripped with nero 7 at top quality from the studio released DVD set. As top quality full rips THEY WILL NOT FIT AS IS ON DVDs AVAILABLE TO THE PUBLIC!! You must first:\n1. Un RAR\n2. Mount the image with Daemon tools\n3. Tell your burning software to either:\n\na. Burn with \\&quot;fit to disc\\&quot; option (which will retain the origional menu and bonus features, but sacrifice quality).\nOR\nb. Use Slysoft\\'s Clone DVD to strip the bonus features and then fit it to disc (which will retain the origional menu but NOT the bonus features, and sacrifice less quality than option a)\nOR\nc. Use your burning software to split off some of the episodes and bonus features, then burn them to more discs (in which case you must create your own menu, but you wil retain top quality video and all the bonus features)\n\nPLEASE SEED BETTER THAN ONE TO ONE!!!\nMy hard drive can only hold one season at a time. When there are enough seeders I will delete it from my computer and upload the next season. So IF YOU DON'T SEED THIS TORRENT WILL DIE!\n\nENJOY!!\nPS: for a current list of automatic torrent trackers go here: http://thepiratebay.se/torrent/6516162/automatic_torrent_trackers_list","torrent":{"xt":"urn:btih:ee46206183ddada1cafb4460195c0288d05352fd","amp;dn":"Simon%26SimonS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee46206183ddada1cafb4460195c0288d05352fd","infoHashBuffer":{"type":"Buffer","data":[238,70,32,97,131,221,173,161,202,251,68,96,25,92,2,136,208,83,82,253]},"announce":[],"urlList":[]}}