{"title":"Space Safety Regulations and Standards{BBS}","uid":6658856,"size":11040678,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eea7bd6f4afef26952f468d8247234663aded51f&amp;dn=Space+Safety+Regulations+and+Standards%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315430865,"description":"When international rules and regulations governing space travel were first being developed, only a few countries had any space presence and commercial space activity was non-existent. Today, over 50 countries have on-orbit satellites and commercial space presence is essential to commercial telecommunications and broadcasting, yet international space law remains in its infancy. Space Safety Regulations and Standards is the definitive book on regulatory initiatives involving space safety, new space safety standards, and safety related to new space technologies under development. More than 30 world experts come together in this book to share their detailed knowledge of regulatory and standard making processes in the area, combining otherwise disparate information into one essential reference and providing case studies to illustrate applications throughout space programs internationally. They address the international regulatory framework that relates to traditional space safety programs as well as the emerging regulatory framework that relates to commercial space programs, space tourism, and efforts to create commercial space station facilities.\n.\n\n\n    * Fully endorsed by the International Association for the Advancement of Space Safety (IAASS) and provides the only definitive reference on regulations and standards for the field of space safety\n\n    * Combines the technical, legal and regulatory information in a clear and integrated reference work suitable for technical professionals, regulators, legal experts, and students in the field\n\n    * Presents a truly global insight from experienced space safety experts worldwide, with representatives from the leading associations, institutions and companies operating in the arena today\n\nProduct Details\n\n    * Hardcover: 544 pages\n    * Publisher: Butterworth-Heinemann (October 7, 2010)\n    * Language: English\n    * ISBN-10: 1856177521\n    * ISBN-13: 978-1856177528","torrent":{"xt":"urn:btih:eea7bd6f4afef26952f468d8247234663aded51f","amp;dn":"Space+Safety+Regulations+and+Standards%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eea7bd6f4afef26952f468d8247234663aded51f","infoHashBuffer":{"type":"Buffer","data":[238,167,189,111,74,254,242,105,82,244,104,216,36,114,52,102,58,222,213,31]},"announce":[],"urlList":[]}}