{"title":"The detective (1968)- Gordon Douglas with Frank Sinatra, Jacquel","uid":6576788,"size":1468841577,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ef71daf30be7c42b8660f0efc9d4fe1b24601920&amp;dn=The+detective+%281968%29-+Gordon+Douglas+with+Frank+Sinatra%2C+Jacquel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vpadilla23","files":4,"time":1312232245,"description":"DIRECTOR: Gordon Douglas\nSTARING: Frank Sinatra, Lee Remick, Jacqueline Bisset, Ralph Meeker, Jack Klugman, Lloy Bochner, William Window, Tony Musante\n\n\nFrank Sinatra's 1968 film The Detective was a serious attempt at a social statement sandwiched between the chairman's two lighthearted detective films Tony Rome and Lady in Cement. Directed by Gordon Douglas (who also directed the Tony Rome films), the plot centers around Detective Joe Leland (Sinatra) and his investigation of the murder of a prominent businessman's gay son. The film was notable at the time for openly depicting the gay community; however, it still falls back on the same tired stereotypes. Rounding out the cast is Lee Remick as Sinatra's nympho-wife, Robert Duvall as a violent homophobic cop, and Jack &quot;the Klugster&quot; Klugman as Sinatra's only honest ally on the force. Off screen, the film was notable for causing the irreparable rift between Sinatra and then-bride Mia Farrow, when she opted to star in Rosemary's Baby instead of this film. Obviously a wise choice, but The Detective is still a solid effort, with a great Jerry Goldsmith score and solid performances from all involved. Interestingly, this film could be considered the unofficial prequel to Die Hard. Both films were based on the same series of detective novels by Roderick Thorpe.\n\n\nATTENTION: The english subs for some reason are not completed in the DVD I ripped, but it is synch and covers a big part of the movie. Sorry for that...","torrent":{"xt":"urn:btih:ef71daf30be7c42b8660f0efc9d4fe1b24601920","amp;dn":"The+detective+%281968%29-+Gordon+Douglas+with+Frank+Sinatra%2C+Jacquel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef71daf30be7c42b8660f0efc9d4fe1b24601920","infoHashBuffer":{"type":"Buffer","data":[239,113,218,243,11,231,196,43,134,96,240,239,201,212,254,27,36,96,25,32]},"announce":[],"urlList":[]}}