{"title":"Quarantine(2008)DVDRip.AC3(ENG)-DROCK","uid":6652508,"size":733596038,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f031fbafe757ca9f7912eb614f7a5c13318c2bef&amp;dn=Quarantine%282008%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1315213053,"description":"Jay Hernandez, Jennifer Carpenter, and Johnathon Schaech star in this remake of Jaume BalaguerÃƒÂ³ and Paco Plaza's successful, Spanish-language horror film [REC], which follows a television reporter and her cameraman as they fall under a mysterious quarantine issued on an inner-city apartment building. Television reporter Angela Vidal (Carpenter) and her trusty cameraman (Steve Harris) were documenting a night in the life of a Los Angeles fire station crew when the firefighters were summoned to a nearby apartment building to answer a routine 911 call. Upon arriving at the scene, Angela and company discover that police have already arrived to investigate the blood-curdling screams ringing out from one of the apartments. One of the women living in the building has been infected with something terrible, but what? When a few of the other residents are viciously attacked, they try to escape and discover that the CDC has quarantined the building. The officials in charge won't relay any information to those trapped inside the building, and it's impossible to seek information from the outside since telephone, Internet, television, and cell-phone access have all been cut off. By the time the quarantine is lifted, the intrepid cameraman's chilling footage provides the only evidence of the horrors that unfolded on that terrible night.\n\nRipped with Handbrake.\n\nLength: 1 Hour 29 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 24fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:f031fbafe757ca9f7912eb614f7a5c13318c2bef","amp;dn":"Quarantine%282008%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f031fbafe757ca9f7912eb614f7a5c13318c2bef","infoHashBuffer":{"type":"Buffer","data":[240,49,251,175,231,87,202,159,121,18,235,97,79,122,92,19,49,140,43,239]},"announce":[],"urlList":[]}}