{"title":"Civilization V Trainer v 4.0.2","uid":6609536,"size":10544,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f0f8e0926706557f6997d9a84b499c5435b7d3e2&amp;dn=Civilization+V+Trainer+v+4.0.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DelphiUniverse","files":-1,"time":1313536655,"description":"=============================================================\nCivilization V Trainer v 4.0.2 for Civilization 5 v 1.0.1.348\n                   ...by DelphiUniverse\n=============================================================\n\n=========================\nChanges since version 4.0\n=========================\n\n* ALT + BACKSPACE hotkey will now only execute and make sound\nif switched cheats are activated. If they are not activated\nit will not make sound anymore, nor execute.\n\n* ALT + LEFT will no longer execute and make sound if there are\nno slots to free.\n\n* ALT + RIGHT will no longer execute and make sound if all 6\nresources are already set to zero.\n\nIMPORTANT:\n* Fixed a problem with the gold pointer. When you start a new game\nand you start with 0 Gold, you must do a next turn before using the\ngold cheat. If you start with more than 0 Gold you can use gold cheat\nright away.\n\n* Made startup slightly faster\n\n* ALT + BACKSPACE didn\\\\\\'t produce sound, is fixed now\n\n* Added customization options by adding a Settings.ini file\n(If you use minimize on run, it will minimize after 6 seconds\nautomatically so that you can have a short peek at the window\nattributes before it minimizes)\n\n* Changed sound type when using hotkeys, can be customized too\n\n* When trainer minimizes it will turn to the lowest priority and\nin addition to that it will suspend the thread for 10 ms for each\niteration. When Trainer window is restored again it will remove\nthe 10 ms suspension and increase priority to normal again.\n\n=========\nIMPORTANT\n=========\n\nWhen using the gold cheat, you MUST do a \\\\\\'next turn\\\\\\' before\nyou use it only IF you start a new game with zero gold. If you\nstart a new game that has anything but zero gold initially, you\ndo not have to do a next turn.\n\n=============\nAbout Trainer\n=============\n\nThis trainer is designed to work with Civilization 5 v 1.0.1.348\nDirectX 9 and DirectX 11.\n\nDo not attempt to use it with earlier or future versions of the game.\nIt will contaminate and corrupt memory if you do.\n\nThis trainer will give you the following:\n\n * Gold\n * Golden Age Progress\n * Golden Age Turns\n * Culture\n * Strategic Resources\n * Luxury Resources\n * Clear spent resource slots\n * Great General\n * Unit Experience\n * Movement\n * Heal units\n * City Modifier\n * Full hotkey support\n * May set custom values\n\n============\nInstallation\n============\n\n1. Create a new folder anywhere you like.\n2. Extract this archive into that folder.\n3. Done.\n\n==========\nHow to use\n==========\n\n1. Start trainer first.\n2. Start game secondly.\n\n===============\nSwitched Cheats\n===============\n\n1: MOVEMENT SWITCH:\nThis cheat will give unlimited movement points to units. Activate it and then click any unit, in any number, in any priority and move them around. Always remember to deactivate a switched cheat before making another turn.\n\nSet the initial movement point in the left editbox to set a default initial value for your units. Why would you want to set a initial movement score when the movement is already infinite?\n\nThe reason is simple: Because if you have 1 movement point left, it will cancel if you try to move it more than 1 hex, its pretty annoying. The default initial value is already set so you do not need to worry about it.\n\n2: EXPERIENCE SWITCH:\nThis cheat will give experience to your units. Set a initial experience value in the editbox on the left, then click all your units. You only need to click them once. Then deactivate the cheat when finished.\n\n3: HEALING SWITCH:\nThis cheat will set health points on your units. Set the health point you want in the editbox on the left side (it can be in the range of 0-10 where 0 is no health and 10 is full health) Then click all units you want to set this health value upon. Deactivate the cheat when finished.\n\n4: CITY MODIFIER SWITCH:\nThis is probably the most complex cheat to use. (It\\\\\\'s really not that complex). This cheat will set the city modifier value (it is in percentage %).\n\nIt will set the modifier value on 3 things: Production, Science and Gold. To have this cheat work you will need to buy OR sell a building that affects any of these 3 areas. Thats it.\n\nQuick hint: I recommend buying:\nUniversity (to enable modifier for science)\nFactory (to enable production modifier)\nStock Exchange (to enable gold modifier)\n\nYou can also sell buildings that affects these areas, the modifier will update that way too.\n\n=============\nHotkeys note:\n=============\n\nALT + F1 = Anti Movement-Cost Cheat\nALT + F2 = Train Unit Experience\nALT + F3 = Set Health on units\n\nALT + F5 = Set City Modifier (Science,Production and Gold)\n\nALT + BACKSPACE = Turn off all cheat switches\n\nALT + INSERT = Resources (Maximum)\nALT + HOME = Gold (Maximum)\nALT + PAGEUP = Culture (Maximum)\n\nALT + DELETE = Golden Age Progress (Maximum)\nALT + END = Golden Age Turns (Maximum)\nALT + PAGEDOWN = Great General Progress (Maximum)\n\nALT + LEFT = Free all used resource slots\nALT + RIGHT = Zero all (Will zero out the following):\n  1: Gold\n  2: Golden Age Progress\n  3: Golden Age Turns\n  4: Culture\n  5: All Strategic and Luxury Resources\n  6: Great General Progress\n\n===============\nUpDown Controls\n===============\n\nI have added Up-Down controls to all edit boxes in the program.\nYou may change values in an edit box in many ways:\n\n1: Click a button to choose a predefined value.\n2: Click the edit box and type a custom value.\n3: Click the up-down control buttons to change values.\n4: Use the up-down arrow keys on your keyboard.\n5: Use mouse wheel to change values.\n\n===============\nTroubleshooting\n===============\n\nQ1: Trainer doesnt work?\nA1: Use only with Civ 5 version 1.0.1.348. It will not work with other versions.\n\nQ2: Trainer still doesnt work?\nA2: Your firewall/antivirus blocked it, unblock it and run it again. I need to do this myself all the time.\n\nQ3: Trainer is still not working?\nA3: The 6 primary cheats will only update after you click a city or do a next turn.\n\nQ4: I use WinXP and the trainer runs and quits almost instantly?\nA4: Try to run it using Win98 Compatability mode.\n\n======\nAuthor\n======\n\nCoded by DelphiUniverse in pure assembly language.\n\nMy favorite coding equipment:\n\n* SteelSeries 7G keyboard (Nothing close to it, nothing above it)\n* 26\\\\\\&quot; 2ms screen for coding happiness\n","torrent":{"xt":"urn:btih:f0f8e0926706557f6997d9a84b499c5435b7d3e2","amp;dn":"Civilization+V+Trainer+v+4.0.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0f8e0926706557f6997d9a84b499c5435b7d3e2","infoHashBuffer":{"type":"Buffer","data":[240,248,224,146,103,6,85,127,105,151,217,168,75,73,156,84,53,183,211,226]},"announce":[],"urlList":[]}}