{"title":"Beastly [MULTI5][PAL][PC][sneak_shot]ArShAd","uid":6586553,"size":1266537422,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f1fa70c2da7c2b2919aec6566553678177160b1b&amp;dn=Beastly+%5BMULTI5%5D%5BPAL%5D%5BPC%5D%5Bsneak_shot%5DArShAd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sneak_shot","files":16,"time":1312631548,"description":"presenting s n e a k _ s h o t\n\n\n\nrelease date:04-08-2011\n\n\n\ndescription:\n\n\nKyle Kingson is the spoiled, shallow prince of his high school kingdom. When he humiliates a witch-like classmate, she retaliates by transforming him into someone as unattractive on the outside as he is on the inside. He has one year to find someone to love him in his new physical state.\n\n\n\nDownload: www.ieType.com/f.php?FNpwbH\nSome properties don't translate very well into video games, no matter how enjoyable they are in the original format. The movie &quot;Titanic,&quot; for example, may be considered a modern classic by some, but very few fans would even entertain the notion that the romantic tale of Jack and Rose could be good material for an interactive endeavor. People still want to try the seemingly impossible and make a video game out of any and every hot property on the market. Such is the case with Beastly, which is a modern retelling of the classic Beauty and the Beast story; it was critically acclaimed as a book and was just turned into a major motion picture. Storm City Games and Visual Impact decided to make a video game tie-in on the Nintendo Wii. Unfortunately, they proved that some things can't ever be translated into video game form.\n\n\n\n\n\nWhile you are playing through the events of the movie, you're not exactly playing as any of the main characters. At the beginning of the game, you choose to be either a male of female student enrolled in the same high school as the main characters. You play through the whole story from beginning to end as a side character, but you'll often find yourself helping out the main characters with things such as counting votes or practicing their golf swing in various minigames. In between each activity, you can log into the school's social network to receive rewards and check up on the story as it's told through the major characters.\n\n\n\n\n\n\nseed comment n enjoy...!!!","torrent":{"xt":"urn:btih:f1fa70c2da7c2b2919aec6566553678177160b1b","amp;dn":"Beastly+%5BMULTI5%5D%5BPAL%5D%5BPC%5D%5Bsneak_shot%5DArShAd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1fa70c2da7c2b2919aec6566553678177160b1b","infoHashBuffer":{"type":"Buffer","data":[241,250,112,194,218,124,43,41,25,174,198,86,101,83,103,129,119,22,11,27]},"announce":[],"urlList":[]}}