{"title":"Democracy Now - 12 aug 2011","uid":6600131,"size":452635610,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f2b043cf15ac2d49507fb738c5a7cdd93c3c7c45&amp;dn=Democracy+Now+-+12+aug+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1313173428,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Aug 12, 2011\n\n- Deficit Super-Committee Finalized With Democratic Picks\n- Obama Urges Public to Pressure Lawmakers Over Economy\n- Texas Gov. Rick Perry to Enter GOP Race\n- GOP Presidential Hopefuls Square-Off in Iowa Debate\n- Republican Front-Runner Mitt Romney: &quot;Corporations Are People&quot;\n- Top 500 U.S. Firms Increase Holdings 58% Since 2008\n- Pennsylvania Judge Sentenced to 28 Years for &quot;Kids-for-Cash&quot; Scheme\n- Report: 773 Pakistani Civilians Killed in U.S. Drone Strikes\n- Libyan Rebels Advance in Brega; Tripoli Residents Protest NATO Bombing\n- Syrian Forces Attack Civilians; Hama Residents Detail Crackdown\n- British PM Threatens to Restrict Social Media in Riot's Aftermath\n- U.S. Boosts Horn of Africa Famine Aid by $17 Million\n- Israel Approves 1,600 New Settlement Homes in Occupied East Jerusalem\n- Industry-Linked Panel Backs Controversial Natural Gas Fracking\n\n\nSpecial reports\n\n- AIDS-Afflicted U.S. Citizen Urges Obama Admin to Reverse Deportation of Australian Husband\n\nThe Obama administration's enforcement of the Defense of Marriage Act is threatening to tear apart the seven-year marriage of a binational gay couple in San Francisco. Bradford Wells, a U.S. citizen, and Anthony John Makk, an Australian national, have lived together for 19 years and were among the first same-sex couples to legally marry in Massachusetts. Anthony is also the primary caretaker for his husband, who has HIV/AIDS. Makk is facing deportation this month after the Obama administration denied them the same immigration benefits routinely given to opposite-sex couples. The decision is based on the so-called Defense of Marriage Act, the 1996 law known as DOMA, which denies federal benefits to same-sex couples. The Obama administration has said it would no longer defend DOMA in the courts, but the law still remains in effect. Bradford Wells and Anthony John Makk join us from San Francisco. We also speak to Rachel Tiven, executive director of Immigration Equality.\n\n\n- Bipartisan &quot;Super-Committee&quot; Turns to Cutting Deficit With &quot;Extraordinary&quot; Powers\n\nThe bipartisan &quot;super-committee&quot; tasked with finding a way out of the U.S. debt crisis has been established, but what can we expect? On Thursday, House Democratic leader Nancy Pelosi named the final three members to the 12-person panel, split evenly between Democrats and Republicans. They will have until November 3 to recommend a plan to cut $1.5 trillion from the deficit over 10 years. We speak with Robert Borosage, founder and president of the Institute for America's Future and co-director of its sister organization, the Campaign for America's Future. Borosage says the committee's authority is unique in Congress, with &quot;powers [that] are quite extraordinary.&quot;\n\n\n- As Texas Gov. Rick Perry Enters GOP Race, New ExposÃƒÂ© Reveals His Close Ties to Radical Evangelicals\n\nRepublican Gov. Rick Perry of Texas is expected to announce his entry into the 2012 presidential race. Perry will make the announcement Saturday at a conference in South Carolina organized by Erick Erickson's RedState.com. Early backers of Perry's presidential run have heralded him as being behind the so-called Texas economic miracle, however many have questioned Perry's economic claims in Texas. Questions have also arisen over Perry's close ties to the radical-wing of the Christian evangelical movement. Last Saturday, Perry helped organize and spoke at a controversial seven-hour Christian prayer rally in Houston titled, &quot;The Response: A Call to Prayer for a Nation in Crisis.&quot; While the prayer session drew 30,000 participants and received national press, little attention was paid to the Christian evangelicals Perry worked with to organize the event. The Texas Observer has just published an explosive article titled, &quot;Rick Perry's Army of God.&quot; It exposes how a group of radical Christians and self-proclaimed prophets from a little-known movement known as New Apostolic Reformation have been quietly pushing for Perry's presidential bid. We speak with the Texas Observer's Forrest Wilder.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f2b043cf15ac2d49507fb738c5a7cdd93c3c7c45","amp;dn":"Democracy+Now+-+12+aug+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2b043cf15ac2d49507fb738c5a7cdd93c3c7c45","infoHashBuffer":{"type":"Buffer","data":[242,176,67,207,21,172,45,73,80,127,183,56,197,167,205,217,60,60,124,69]},"announce":[],"urlList":[]}}