{"title":"Real.Warfare.2.Northern.Crusades.v2.2.5.Update-SKIDROW","uid":6874864,"size":117959160,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f4b39fc6965306695fea570a04fe8890a4942e09&amp;dn=Real.Warfare.2.Northern.Crusades.v2.2.5.Update-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TPBAgri2","files":-1,"time":1323378715,"description":"S  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nReal Warfare 2: Northern Crusades v2.2.5 Update\n\n08-12-2011........Release Date - Protection...........StarForce\nStrategy.............Game Type - Disk(s)....................DOX\n\nRELEASE NOTES\n\nRead changelog.txt for information on updated content\n\nINSTALL NOTES\n\n1. Run RW2NCupdate3setupen\n2. Install\n3. Copy the cracked content from the SKIDROW folder to the main install\nfolder and overwrite\n5. Play the game\n\n\n\n\nReal Warfare 2: Northern Crusades\n\nVersion 2.2.5 (December 2011)\n\nFixed:\n- Crashes during sieges\n- Crashes while generating certain castle layouts\n- A rare error when mission stayed incomplete when all of its tasks were completed\n- A rare error when an army was considered to be located in another region, which led to inability to finish a quest\n- Battle with Prussian foragers near Matowy will be generated correctly now\n- Error when player info window stayed on screen while playing outro\n- Exploit when player could escape from any battle\n- Reserve troops are no longer taken into account while calculating army strength\n- 'Return' option in some dialogs now works correctly instead of closing dialog window\n- A castle will be auto-garrisoned after capturing it in all cases\n- Wrong shadows rendering\n\nImprovements\n- Name generation. All units on strategic map now have correctly generated names. They consist of first names, 2nd name parts (for Mongols), last names or nicknames (for brigands and Prussians). All possible names are historically correct for a given nation.\n- Tactical AI will react to being under fire more actively\n- After completing the story campaign and starting the freeplay mode maps boundaries are expanded\n- Handling of negotiations between weak player and enemy lords\n- New mouse cursor shows inaccessible map areas\n\nGameplay changes\n- Maximum AI army size increased to 30 regiments (was 20). If army contains more than 10 professional regiments (&quot;Knights&quot; or &quot;Sergeants&quot; level), it can contain twice the amount of militia troops.\n- AI will try to hire roughly equal amount of Pikemen and ranged troops (Militia tier)\n- Army spawn points corrected in quest tactical battles (engagement with Pippin brigands and battle with foragers near Chluhov)\n- 50% more regiments will be auto-hired to garrison a castle after capturing it\n- Chance of finding hireable siege equipment in medium and large towns and castles slighhtly increased\n- Chance of having ranged troops in garrisons of towns and castles decreased\n- Minimal ransom is now 20. Maximum ransom capped.\n- AI armies strength hints are now visible near the player and not on the entire map. New 'Recon' skill that affects this distance will be added in a next patch.\n\nVersion 2.2.4 (November 2011)\n\nMajor\n-Several quest errors fixed, mostly in &quot;Intercepting Foragers&quot; and &quot;Reaching the Rally Point&quot;.\n-Lords in &quot;Reaching the Rally Point&quot; move normally after your conversation with Landmeister.\n-Battle statistics window fixed (sometimes it showed wrong enemy army information).\n-Game crash after saving on strategic map fixed.\n-Possible game crash after saving on tactic map fixed.\n-Rare game camera crash on tactic map fixed.\n\nImprovements\n-Huge performance increase on certain PC configurations: GTX video cards + MicrosoftÃ‚Â® WindowsÃ‚Â® 7 operating system (other cards may benefit from this as well)\n-Pathfinding on strategic map is improved, armies will find a way around towns and other obstacles quicker.\n-Tactical battle lighting presets were corrected to reduce blur and glare.\n-Improved tactical map generation\n-High hills are not used when generating northern valleys\n-Probability of autumn maps generation increased from 15 to 25%.\n\nGame process and minor changes\n-Costs of replenishing losses are reduced for sergeants (-25%) and knights (-16%).\n-Bandits aggression is reduced if the player's army is weak.\n-Enemy will demand a smaller ransom if the player's army is significantly weaker. Ransom is not increased until player reaches level 6.\n-&quot;Destroying the Foragers' Camp&quot; quest improved slightly. Enemy army now heads to Matowy only after you receive a message.\n-A dialog screen in &quot;Destroying the Foragers' Camp&quot; can not be closed incorrectly.\n-A victory screen after plundering a village can not be closed incorrectly.\n-Changes in texts.\n-You can't close a start screen incorrectly to avoid battle, and penalty for retreat.\n-Before you start the siege, town\\castle lord may engage you in the field.\n-AI armies replenishing fixed. Winner restores most part of the army.\n-Robbers' bands are restored.\n-Garrisons of captured towns\\castles\\settlements are restored.\n-Extortion is changed. If you consider opponent is too strong, and close battle window, you'll have to offer ransom.\n-Estimate strength of enemy forces in tooltips changed.\n-Upgrading costs were changed, upgrade to sergeants and knights now costs more, mounted archers cost much more.\n-Icons of settlements added to economy and diplomacy map overlays.\n-Army consumes food after a battle.\n-Army does not consume food while stationary.\n-Prussian lords now can hire more sergeants (since they don't have access to knights).\n-Reserves will no longer disappear in assault battles.\n-Numerous cosmetic fixes and improvements in the campaign.\n-Faction relations changes are now shown in log.\n-Retreat penalty added. Retreating army will suffer losses.\n-Real price of hiring professional and elite units now matches description.\n-Now auto-resolving a plunder engagement will give you trophies.\n-Enemy army losses are now taken into account for determining earned experience and trophies after a battle.\n-New diplomatic conversation option added to freeplay - &quot;Personal insult&quot;.\n-Amount of food left is now shown on the main screen (next to commander's level, money and battle experience).\n-Commander skill window now appears automatically after gaining a level.\n\nGame site: &lt;a href=&quot;\nhttp://www.real-warfare.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.real-warfare.com/&lt;/a&gt;\n\nGame forums: &lt;a href=&quot;\nhttp://forum.1cpublishing.eu/forumdisplay.php?f=182&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.1cpublishing.eu/forumdisplay.php?f=182&lt;/a&gt;\n\nTech.support: &lt;a href=&quot;\nhttp://www.1cpublishing.eu/support&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.1cpublishing.eu/support&lt;/a&gt;\n\nÃ‚Â© 2011 1C Company. Developed by Unicorn Games. All rights reserved.","torrent":{"xt":"urn:btih:f4b39fc6965306695fea570a04fe8890a4942e09","amp;dn":"Real.Warfare.2.Northern.Crusades.v2.2.5.Update-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4b39fc6965306695fea570a04fe8890a4942e09","infoHashBuffer":{"type":"Buffer","data":[244,179,159,198,150,83,6,105,95,234,87,10,4,254,136,144,164,148,46,9]},"announce":[],"urlList":[]}}