{"title":"Casino (2 Disc Special Edition) [DVD]","uid":6569505,"size":15664414720,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f56298fd30eb8458ff86feef0be7270741524e50&amp;dn=Casino+%282+Disc+Special+Edition%29+%5BDVD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hoofdkussen","files":-1,"time":1311878855,"description":"www. Norskbits .com - Last ned Filmer, TV-serier, Spill, Program og Musikk http://www.norskbits.com\n\nCheck :: http://www.norskbits.com :: for more of my torrents!\n\n\nFormat: PAL\nLanguage English\nSubtitles: Danish, Finnish, Hebrew, Hungarian, Icelandic, Norwegian, Swedish, English\nRegion: Region 2 (This DVD may not be viewable outside Europe. Read more about DVD formats.)\nNumber of discs: 2\nClassification: 18\nStudio: Universal Pictures UK\nDVD Release Date: 11 July 2005\nRun Time: 117 minutes\nAverage Customer Review: 4.7 out of 5 stars  See all reviews (23 customer reviews)\nASIN: B0009KKWH2\nAmazon Bestsellers Rank: 4,109 in Film &amp; TV (See Top 100 in Film &amp; TV)\n Would you like to update product info, give feedback on images, or tell us about a lower price?\n\n\nAmazon.co.uk Review\nDirector Martin Scorsese reunites with members of his GoodFellas gang (writer Nicholas Pileggi; actors Robert De Niro, Joe Pesci and Frank Vincent) for a three-hour epic about the rise and fall of mobster Sam &quot;Ace&quot; Rothstein (De Niro), a character based on real-life gangster Frank &quot;Lefty&quot; Rosenthal. (It's modelled on Wiseguy and GoodFellas and Pileggi's true crime book Casino: Love and Honour in Las Vegas.) Through Rothstein, the picture tells the story of how the Mafia seized, and finally lost control of, Las Vegas gambling. The first hour plays like a fascinating documentary, intricately detailing the inner workings of Vegas casinos. Sharon Stone is the stand out among the actors; she nabbed an Oscar nomination for her role as the voracious Ginger, the glitzy call girl who becomes Rothstein's wife. The film is not as fast-paced or gripping as Scorsese's earlier gangster pictures (Mean Streets and Good Fellas) but it's still absorbing. And, hey--it's Scorsese! --Jim Emerson, Amazon.com\nSynopsis\nMartin Scorsese, one of America's most influential filmmakers, returns to the world of mobsters, greed, and excess that he explored so compellingly in 1990's Goodfellas. Set in the 1970s and revelling in the minute details of how Las Vegas casinos operate, the film chronicles the rise and fall of casino manager Ace Rothstein (Robert De Niro). As the king of his domain, Ace efficiently runs the business and regularly sends lots of cold cash to his bosses. Helping him keep the casino's employees and customers honest is his best friend, Nicky (Joe Pesci), a violent sociopath. Although Ace aims to run a relatively respectable casino, the volatile Nicky wants to take over the entire gambling mecca, and when Ginger McKenna (Sharon Stone), a seasoned Vegas hustler, enters the picture, Ace and Nicky's friendship is complicated even further. As drugs and alcohol become a bigger part of Ginger's life, all three are eventually brought down by their own greed and blind ambition. Casino shares many similarities with Goodfellas, beginning with a script that was cowritten by Scorsese and Nicholas Pileggi. Regulars De Niro and Pesci are first rate once again as the dissimilar companions, but it is Stone who steals the show with her gruelling, intense performance.\n\n\nwww. Norskbits .com - Last ned Filmer, TV-serier, Spill, Program og Musikk http://www.norskbits.com\n\nCheck :: http://www.norskbits.com :: for more of my torrents!\n","torrent":{"xt":"urn:btih:f56298fd30eb8458ff86feef0be7270741524e50","amp;dn":"Casino+%282+Disc+Special+Edition%29+%5BDVD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f56298fd30eb8458ff86feef0be7270741524e50","infoHashBuffer":{"type":"Buffer","data":[245,98,152,253,48,235,132,88,255,134,254,239,11,231,39,7,65,82,78,80]},"announce":[],"urlList":[]}}