{"title":"The Terence McKenna OmniBus 2012 - Part 01 of 12 - Who Am I?","uid":7029686,"size":221407907,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f6d2aa6ea8c2a9481278854bc0c64c7579109a0e&amp;dn=The+Terence+McKenna+OmniBus+2012+-+Part+01+of+12+-+Who+Am+I%3F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"geogaddi000","files":-1,"time":1329188233,"description":"NOTE: All following installments of The Terence McKenna OmniBus 2012 will be available in the exclusive member's-only area on the following website. Support Independent Artists!\n &lt;a href=&quot;\nhttp://www.cognitionfactor.net/forum/Default.aspx?g=forum&amp;c=8&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cognitionfactor.net/forum/Default.aspx?g=forum&amp;c=8&lt;/a&gt;\n\nGreets Fellow Senients,\n\nIt's great to see so many new subscribers,\nlike you knew this was going to be a nexus of some kind,\nand you aren't wrong.\n\nTo come, through 2012, will be a series of previously unreleased\nTerence Mckenna clips which will essentially; &quot;Unpack the Mckenna Mojo&quot;,\nto quote Dennis Mckenna. It should also tie in nicely with the release\nof his book this year; 'The Brotherhood of the Screaming Abyss'.\n\nTMOM will be released as a series of twelve twelve minute clips,\none per month; each clip will be on a specific subject, culminating on\n21st December 2012, when Terence Mckenna's speculations and predictions,\nin his own words, will be released.\n\nAt the moment, we're thinking about a VJ mix with music from various acid-jazz\nand ambient composers, local and international.\n\nIf you feel you've got something to contribute, musically, CGI, or in any other way,\nplease get in touch. For example, our financial model still has a way to go-:&gt;\n\nI will not be reposting any of this to FB or Twitter just yet, as I feel that\nthis community has put in the time, so for now, it's only from here that\nyou'll be able to pickup the updates and downloads...\n\nSee you all downstream!\n\nSchwann Cybershaman\n\n----\n\nFirstly, welcome to all our new subscribers!\n\nAs promised, here's the first clip in the new Terence Mckenna series, incidentally, uploaded at 2.12 AM 31st January. Spread the word!\n\nChapter One - Who am I? - The unpacking of the Mckenna Mojo begins!\n\nIn case you only just got here, the 'Terence Mckenna Omibus - TMOM-2012', is a series of 12 clips, each 12:12:12 in duration.\nRegister on this Forum for insider information, giveaways and discounts.\n\nThe 12 minute High Definition video (221MB .mp4 file) is only available from the Headspace server\non the link while access lasts. Download restrictions may apply because we're hoping that you'll overload the server\n\nChapter One is not being released via FB, or any other social network right now as we're trying to figure\nout how many of you are interested in Terence's 2012 predictions before our financial model kicks in.\n\nPlease feel free to take advantage of our slackness and share this release as an exclusive scoop,\ntill it is released by social networks on 12 February.\n &lt;a href=&quot;\nhttp://headspace-studios.com/globalserver/TMOM/TMOM1.mp4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://headspace-studios.com/globalserver/TMOM/TMOM1.mp4&lt;/a&gt;\n\nFeedback is essential. Like what would you like Terence to talk about next?\n\nEnjoy the show!\n\nMichael (Schwann Cybershaman) Kawitzky\nHeadspace Studios","torrent":{"xt":"urn:btih:f6d2aa6ea8c2a9481278854bc0c64c7579109a0e","amp;dn":"The+Terence+McKenna+OmniBus+2012+-+Part+01+of+12+-+Who+Am+I%3F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6d2aa6ea8c2a9481278854bc0c64c7579109a0e","infoHashBuffer":{"type":"Buffer","data":[246,210,170,110,168,194,169,72,18,120,133,75,192,198,76,117,121,16,154,14]},"announce":[],"urlList":[]}}