{"title":"Die Falscher (eng subs) [2007] Stefan Ruzowitzky","uid":6858356,"size":855124467,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f73060f6ca6bdb0c4a1cdfb49db8006c607e043d&amp;dn=Die+Falscher+%28eng+subs%29+%5B2007%5D+Stefan+Ruzowitzky&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1322788822,"description":" &lt;a href=&quot;http://bayimg.com/daLCGaAdC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/daLCGaAdC&lt;/a&gt;\n\nThe Counterfeiters (2007) \n\nDie FÃƒÂ¤lscher (original title) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0813547/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0813547/&lt;/a&gt;\n\nGerman language with hard English subtitles\n\nThe Counterfeiters (German: Die FÃƒÂ¤lscher) is a 2007 Austrian-German film written and directed by Stefan Ruzowitzky. It fictionalizes Operation Bernhard, a secret plan by the Nazis during the Second World War to destabilize Great Britain by flooding its economy with forged Bank of England bank notes.The film centres on a Jewish counterfeiter, Salomon 'Sally' Sorowitsch, who is coerced into assisting the Nazi operation at the Sachsenhausen concentration camp.\n\nThe film is based on a memoir written by Adolf Burger, a Jewish Slovak typographer who was imprisoned in 1942 for forging baptismal certificates to save Jews from deportation, and later interned at Sachsenhausen to work on Operation Bernhard. Ruzowitsky consulted closely with Burger through almost every stage of the writing and production. The film won the 2007 Best Foreign Language Film Oscar at the 80th Academy Awards.\n\nKarl Markovics as &quot;Sorowitsch&quot; (Salomon Smolianoff) \nAugust Diehl as &quot;Burger&quot; (Adolf Burger) \nDevid Striesow as &quot;SturmbannfÃƒÂ¼hrer Herzog&quot; (Bernhard KrÃƒÂ¼ger) \nVeit StÃƒÂ¼bner as &quot;Atze&quot; \nSebastian Urzendowsky as &quot;Kolya&quot; \nAugust Zirner as &quot;Dr Klinger&quot; \nMartin Brambach as &quot;HauptscharfÃƒÂ¼hrer Holst&quot; \nAndreas Schmidt as &quot;Zilinski&quot; \nTilo PrÃƒÂ¼ckner as &quot;Hahn&quot; \nLenn Kudrjawizki as &quot;Loszek&quot; \n\nExcept for the score music by Marius Ruhland, the soundtrack consists of classical tangos recorded decades ago by Argentine harmonica player Hugo DÃƒÂ­az, and opera recordings from the 1930s and 1940s.\n\nIt won the foreign language Oscar and there is nothing fake or contrived about this astonishing true story about the men in a German concentration camp who fought their own little war for survival. But survival is not their only aspiration. Loyalty is also an essential currency and the vow never to 'squeal on one's mates' becomes an Everest almost too high to climb. Ultimately, The Counterfeiters is a story about relationships. It's about the relationships between the incarcerated Jewish counterfeiter and his SS superior as well as that with his principle-driven fellow prisoner. The story fascinates, as does the humanity of the man intent on survival who discovers that winning and losing can offer similar rewards. This is a unique story set in horrific times, when atrocities are every day events duplicated without the skill of a specialist.\n\nComplex moral dilemmas make The Counterfeiters an absorbing and engaging drama, and the story is yet another good example of the hundreds if not thousands of stories from WWII that deserve to be told. This story, based on real events, combines elements of a thriller with that of war drama and character study as the specially selected little Jewish team are set to work forging not just documents but foreign currency by the millions. The interdependence between prisoner and captor is only one of the threads examined, while the disagreement over how to manage working for the hated Nazis by the Jews is the film's prime focus.\n\nKarl Markovics plays the central character in a complex physical and mental portrait and imbues him with an irresistible cocktail of characteristics, ranging from noble to weasel. He is not held up to be a typical hero, a paragon of decency; he's a criminal and the war has given him a unique role. But in the film's final scenes, we sense just how he has changed. It's not what we expect and it's ambiguous. It's a successful characterisation because it offers complexity and self-contradiction in recognisably human form. His asymmetrical face and general physical unevenness helps, and his understated performance draws us in.\n\nAugust Diehl has the tough role of the young ideologue, Alfred Burger, who wants to sabotage the work of the counterfeiters on principle, even if it invites a death sentence for the whole team. The film is partly based on the real Alfred Burger's memoirs, and it often asks us to weigh our own moral stance in this complex story.\n\nAlso outstanding is Devid Striesow as Herzog, the concentration camp officer charged by Himmles to deliver the forgeries - and deliver them quickly. He, too, adds layers to the basic figure of Nazi officer until we are no longer sure what and who we see.\n\nSombre as it is, with underlit scenes that deepen our sense of dread, The Counterfeiters is a melancholy work, which is meant as praise. My only gripe is the use of the hand held camera, which draws attention to itself; it adds nothing to the film's dramatic impact.\n\n","torrent":{"xt":"urn:btih:f73060f6ca6bdb0c4a1cdfb49db8006c607e043d","amp;dn":"Die+Falscher+%28eng+subs%29+%5B2007%5D+Stefan+Ruzowitzky","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f73060f6ca6bdb0c4a1cdfb49db8006c607e043d","infoHashBuffer":{"type":"Buffer","data":[247,48,96,246,202,107,219,12,74,28,223,180,157,184,0,108,96,126,4,61]},"announce":[],"urlList":[]}}