{"title":"White Material (2009) 1.5GB 720p DivX HD (moviesbyrizzo) ","uid":6618927,"size":1635065815,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:f7a85fcd206aca8a56d2aaf43840ab70e913506d&amp;dn=White+Material+%282009%29+1.5GB+720p+DivX+HD+%28moviesbyrizzo%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":9,"uploader":"moviesbyrizzo","files":-1,"time":1313912500,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt1135952/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt1135952/&lt;/a&gt;\n\n1280 X 544 DivX 720p HD video resolution at 1800k bitrate - real nice \npicture quality is produced we find using DivX converter Plus (although it\ntakes longer than other converters to produce its results) Great 256k audio\nquality too is included here with our efficient 1.52Gb version.\n\nConverted from the 4GB Titans video file so any subtitles that are likewise\ncompatible will here too work. Included are English subtitles/subtitles template\nalong with Romanian and Czech as found on the net for this version.\n1:45:31 runtime, 24fps\n\nThis movie is about taking chances against insane odds and in fact\nwith little doubt of any other outcome than sheer disaster of complete\nproportions!\n\nIt is about negating reason with stubbornness that defies logic\non any account whatsoever. its about trying to see a self fulfilling\nprophesy come about by egging on disaster and courting it all the way\nthere.\n\nIn some respect it speaks to the madness of multiculturalism that is of the\npernicious and insidious variety equally that is taking over the planet with\nan eventual outcome that seems like nothing any other different from what is\nshown in this movie , in respect of lack of care and abandonment of reason by\nthose seeking some kind of an outcome that will see the end to the presently\ndepicted humankind on the earth, in this movie. The character played by \nMs. Huppert is rather than naive, perhaps more likely actually simply malicious -\nagainst her own sense of existence on this earth and those that rely on her\njudgment too. I do hope we can bring everyone back from the abyss or the edge\nthereof as the case may better be. he character of Manuel in this movie needs\nclose examination as to just what makes him tick - into joining with those who\nare seeking to destroy for their own benefit in what is the conflicting and\ncompeting race for existence on this earth as depicted in the movie between the\nforces typically shown as perennially at odds as it were.\n\nIf you have fortitude in your sensibilities, you should take in this movie\nwith a bottle of Napoleon brandy handy for a couple of gulps all the way through!\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n","torrent":{"xt":"urn:btih:f7a85fcd206aca8a56d2aaf43840ab70e913506d","amp;dn":"White+Material+%282009%29+1.5GB+720p+DivX+HD+%28moviesbyrizzo%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7a85fcd206aca8a56d2aaf43840ab70e913506d","infoHashBuffer":{"type":"Buffer","data":[247,168,95,205,32,106,202,138,86,210,170,244,56,64,171,112,233,19,80,109]},"announce":[],"urlList":[]}}