{"title":"The Shining (2 Disc Special Edition) [DVD]","uid":6569569,"size":10104700928,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f93626efc227b75198c678d1a5284da342fa270f&amp;dn=The+Shining+%282+Disc+Special+Edition%29+%5BDVD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hoofdkussen","files":-1,"time":1311881109,"description":"www. Norskbits .com - Last ned Filmer, TV-serier, Spill, Program og Musikk http://www.norskbits.com\n\nCheck :: http://www.norskbits.com :: for more of my torrents, and the rest of the Kubrick collection!\n\nActors: Tom Cruise, Jack Nicholson, Malcolm McDowell, Vincent DOnoforio, Nicole Kidman\nDirectors: Stanley Kubrick\nFormat: Box set, PAL, Colour, Dolby\nLanguage English\nSubtitles: English\nRegion: Region 2 (This DVD may not be viewable outside Europe. Read more about DVD formats.)\nNumber of discs: 10\nClassification: 18\nStudio: Warner Home Video\nDVD Release Date: 3 Mar 2008\nAverage Customer Review: 4.8 out of 5 stars  See all reviews (18 customer reviews)\nASIN: B000Y3ALR0\nAmazon Bestsellers Rank: 1,575 in Film &amp; TV (See Top 100 in Film &amp; TV)\n#47 in Film &amp; TV &gt; Horror\n#68 in Film &amp; TV &gt; Classics\n#96 in Film &amp; TV &gt; Science Fiction &amp; Fantasy &gt; Science Fiction\n\nAmazon.co.uk Review\nTo date Stanley Kubrick remains one of cinema\\'s most controversial film-maker. This box set highlights some of his greatest work, from the visionary 2001:A Space Odyssey, the violent and highly-debated A Clockwork Orange, the chilling adaptation of The Shining, the acclaimed war drama Full Metal Jacket, to his final piece, the controversial Eyes Wide Shut. And to top it off, the treat of this box set, the fascinating Stanley Kubrick: A Life In Pictures. \n\nStanley Kubrick was one of the most acclaimed and controversial filmmakers of his generation, but he was also an intensely private man who rarely gave interviews and produced most of his films under a shroud of secrecy, which tended to foster a great deal of rumour and speculation about his working methods. Jan Harlan, who worked as Kubrick\\'s assistant and executive producer on several projects directed this feature-length documentary. Narrated by Tom Cruise, this offers a rare in-depth look into Kubrick\\'s career as a filmmaker, structured around interviews with a number of actors, writers, technicians, composers, friends, and family who speak on the record about his relentless perfectionism, his creative vision, his life both on and off the set, his relationships with actors, his unrealised projects, and his importance and influence as an artist. \n\nAmong those who share their thoughts in Stanley Kubrick: A Life In Pictures are actors Jack Nicholson, Tom Cruise, Nicole Kidman, Malcolm McDowell, Peter Ustinov, and Keir Dullea; writers Arthur C. Clarke and Michael Herr; special effects artist Douglas Trumbull; composers Wendy Carlos and Gyorgy Ligeti; filmmakers Woody Allen, Martin Scorsese, Steven Spielberg, Paul Mazursky, and Sydney Pollack; and Kubrick\\'s spouse Christiane Kubrick.\n\nThe choice of titles is undeniably spot on, and the extras really give a sense of who the man was, what his legacy is, and the privilege it was for the people who collaborated with him on his cinematic journey. -- Jennifer Kilchenmann\nDVD Description\nThis Special Edition box set encompasses some of Kubrick\\'s best known and controversial titles, showcasing the late film-maker\\'s talent. The Box Set includes: 2001: A Space Odyssey, A Clockwork Orange, The Shining, Full Metal Jacket, Eyes Wide Shut and the documentary A Life in Pictures.\n\nwww. Norskbits .com - Last ned Filmer, TV-serier, Spill, Program og Musikk http://www.norskbits.com\n\nCheck :: http://www.norskbits.com :: for more of my torrents, and the rest of the Kubrick collection!","torrent":{"xt":"urn:btih:f93626efc227b75198c678d1a5284da342fa270f","amp;dn":"The+Shining+%282+Disc+Special+Edition%29+%5BDVD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f93626efc227b75198c678d1a5284da342fa270f","infoHashBuffer":{"type":"Buffer","data":[249,54,38,239,194,39,183,81,152,198,120,209,165,40,77,163,66,250,39,15]},"announce":[],"urlList":[]}}