{"title":"Brian Lara International Cricket 2007 [English][PSP] ","uid":6532628,"size":164831823,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:f986a8888207f45e0fdf2e6a1240baaf3e4f4ff9&amp;dn=Brian+Lara+International+Cricket+2007+%5BEnglish%5D%5BPSP%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rjaa","files":11,"time":1310401147,"description":"Brian Lara International Cricket 2007 [English][PSP]\n\n\n\nPlatform: PSP\nLanguage: English\nRegion: U.S.\nGenre: Sports\nQuality: UMD\nFormat: ISO\nSize: 157.20 MB\n\nBrian Lara International Cricket 2007 Expands the series trademark fluid, dynamic gameplay mechanics to Deliver A thoroughly entertaining and Competitive game captures all the tension That, skill and intensity of world-class international cricket. Thanks to the official ICC Cricket World Cup 2007 content, Brian Lara International Cricket 2007 features licensed players, Including world cricket stars Andrew Flintoff, Ricky Ponting, Mahendra Dhoni, Muttiah Muralitharan and of course, Brian Lara Himself.\nIn Addition to players, the game leads With A dedicated ICC Cricket World Cup 2007 mode featuring all the official teams, stadia, kits and equipment of the tournament. Further modes include a Fully licensed ICC Champions' Trophy competition and exhibition matches Including One Day Games, Test Matches and exciting 20-over run fests.\n\nBrian Lara International Cricket 2007 adds extra depth to the series' complete batting, bowling and fielding experience whilst trademark accessible playability Retaining STI. The acclaim batting the introduction of play Sees Subtle edges, and the Ability to sweepshots use your feet to dance down wicket and smash the ball over the boundary for six.\n\nBowling Sees a much-improved set of delivery types, thanks to Changes in the way the ball swings in the air and reacts off the pitch, showcasing Shane Warne's huge variation of spinning Deliveries and Steve Harmison's raw pace and Even reverse swing as the ball gradients . In Fielding, There's a new reflex-testing slip catch system and players Can now be run out at ends and be stumped Both by alert wicket keepers.\n\nA Striking Advancement is the photo-realistic visuals, with Hundreds of real player in high Likeness Being Modelled detail, facial expressions Completed with animated to capture the intensity and emotion of international cricket. Stadia, Including all eight official World Cup venues, Have Also Been created with a new level of textured detail and make use of proprietary They shader technology for realistic, and changing lighting effects Subtle s, such as time of day and weather.\n","torrent":{"xt":"urn:btih:f986a8888207f45e0fdf2e6a1240baaf3e4f4ff9","amp;dn":"Brian+Lara+International+Cricket+2007+%5BEnglish%5D%5BPSP%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f986a8888207f45e0fdf2e6a1240baaf3e4f4ff9","infoHashBuffer":{"type":"Buffer","data":[249,134,168,136,130,7,244,94,15,223,46,106,18,64,186,175,62,79,79,249]},"announce":[],"urlList":[]}}