{"title":"Minecraft 1.7.3 by Kaise123 v1.5.1 +Aether!","uid":6568639,"size":18813253,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fa2488aeaf0668dad643eaff118782676c80a921&amp;dn=Minecraft+1.7.3+by+Kaise123+v1.5.1+%2BAether%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kaise123","files":-1,"time":1311848665,"description":"********************Kaise123***************************\n\nThis Minecraft installer was compiled by kaise123 (Kai)\nI take no credit for the loader, which was created by Anjocaido\nAnd Minecraft itself, created by Mojang.\nI merely added all the mods and the 'cracked' loader and made a convenient easy-to-use installer that gives you options =)\n\nThe mods are owned by their respective creators and I take no credit for their creation. To see the source code on open source projects Google the names of the mods (listed below) \n\nThis is an easy-to-use, user-friendly way of putting minecraft on your computer. If you want to download a smaller file, get my old one without Aether or optimine and optifog versions here: http://thepiratebay.se/torrent/6561516/Minecraft_1.7.3_Full_Installer_by_kaise123_UPDATED\n\nYou can contact me via e-mail &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;700e1b1119031541424330171d11191c5e131f1d&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;~ or you can add me on MSN with the same address. Or add me on Skype (kai.waugh)\n\n###############\nINSTRUCTIONS   - Techically optional (read if you have issues from here on in)\n###############\n\nTo install run the installer, it really is that simple! The installer has been tested on all (Current windows) operating systems, and it works perfectly. If you are not the administrator on your system you MAY have some trouble installing. It works fine for a windows 7 standard user though.\n\nThe installer NO LONGER automatically gives you the option to install 32bit or 64bit Java. To play the game you MUST have Java. I recommend having the latest java (ATM its 6 Update 26) PLEASE DO NOT CONTACT ME IF YOU DONT KNOW IF YOU HAVE JAVA. CHECK FIRST (If you don't know how, use Google)\n\nThe installer now has 6 installation options, they are:\n1.) Full - Includes most of the mods (except the aether mod and Optimine+Optifog)\n2.) Full+ - This version Adds optimine and optifog for lower end PC's and increases FPS and general performance (Fixes Lag-Spikes etc.)\n3.) Basic - This version is Minecraft as you'd buy it. the only change is a hack to remove the Unlicenced Copy text.\n4.) Aether - This version includes the Aether and all the Full version mods. The aether is a new world opposite to the nether and adds many things. Due to some conflicts, Far mining and placing and the sun mod from Zombe's pack are disabled. This version has some small bugs. it works fone but after installing, on first run the game will ALMOST DEFINATELY crash on the first use of toomanyitems in a world. Just restart the game and everything should work. I am looking into fixing this. Use the Aether only version if you just want Aether. It doesnt have bugs.\n5.) Aether+ - This version Has EVERY mod that this installer offers. there are some conflicts and this version is slightly buggier. ONLY use this if you want both Aether AND have a slower computer.\n6.)Aether only. this version only includes the Aether\n\nI recommend uninstalling old versions BEFORE installing a new/different one because it will gather a lot of shortcuts in your start menu/Programs and features/Add or remove programs.\n\n\n###############\nNOTES   - Optional\n###############\n\nThe installer will only work on one user (each user needs to install it separately for it to work).\nThe mods included were not made by me, and i take no credit for their making.\nIf you do not want mods choose the Windows XP selection during setup.\nIf you are on XP you CAN use the one with mods (it may work for you, but it didn't for me).\nTo hear in-game sounds you need to have an active internet connection IN-GAME, because it downloads them as-you-play.\n\nIT DOES NOT WORK ON OFFICIAL ONLINE SERVERS, DONT EVEN ASK!!!\n\nHowever the loader allows you to enter a name to use on an online mode=false server.\n\n***When opening the play Minecraft shortcut, you may encounter an error (specifically: Could not find the main class: net.minecraft.launcherframe. Program will exit.) If you encounter this error don't worry! Just try again or use the Alternative loader (shortcuts provided) usually after trying a number of times the standard loader works though. In order for the Alternative loader to work you must have .jar files associated with Java NOT anything else (WinRAR etc.)***\n\nIf you like what you see, or use or play from me please rate the torrent up so others can see that it is trustworthy to use and then more can use what you have appreciated THANKYOU\n\n******************************MODS*****************************************\n\nThe mods included are made by different people. If you want to know how to mod, or where to get these mods don't ask for help here.\nUse GOOGLE!\n\n1.) MC unlicensed copy remover (removes the unlicensed copy text from Minecraft) (also in the vanilla version)\n2.) Dynamic lights\n3.) Mod loader\n4.) Toomanyitems (In-gave inventory editor)\n5.) Zen's Minimap (obvious, right)\n6.) Zombe's modpack (includes many mods, but not all are enable, see the config.txt in the Minecraft mods folder If you know what you are doing. some mods cannot be used due to conflicts (furnace mod, and in the aether version quite a few don't work, and have been disabled))\n7.) The WorldEdit CUI (You can ignore this, but because i am a server Admin it made its way in, it changes nothing in-game)\n\n7.) The Aether (This mod does a lot with one of the main things being adding a new world opposite to the nether, but unlike the nether, it's the opposite of boring!)\n\n8.) Optimine and Optifog (significant increase in FPS on lower-end hardware and lag fixes)\n\n###############\nCHANGES   - Optional\n###############\n\nThe first number changes at a major Minecraft release (1.7, 1.8, 1.9 etc.) and the second changes at a minor update (1.7.1, 1.7.2, 1.7.3 etc.) OR a major mod/installer addition/update and the third changes at a minor change (fixed small bugs, changed wording, cleaned up files etc.)\nPlease note that the version number of the installer IS NOT THE VERSION OF MINECRAFT IT CONTAINS E.g. Installer version 1.5.0 installs Minecraft 1.7.3\n\nVersion 1.5.1\nMinor Bug fix release\nMade aether non-compulsary due to some small bugs\nmade Optimine and optifog non-compulsary due to some small bugs.\nThose two result in the fact that there are now 6 different game versions.\nAdded controlls TXT in the download\nThis will be my Final version for minecraft 1.7.3 unless i find something big i missed :)\nAdded better compression on the installer, resulting in a smaller overall size than 1.5.0 (29m down to about 20mb)\n\nVersion 1.5.0\nMajor Mod/installer Upgrade release\nAdded Aether version/mod\nAdded Optimine and Optifog version\nChanged installer; there are now 3 different versions and you can choose which one you want to use\nNo longer operating-system dependant (that was fixed since 1.7.3 came out, but it's the first time I've tested it on an XP PC so...)\nAmended readme and added some info\nRemoved the Java installations due to size restrictions.\nUpgraded dynamic lights and Zombe's modpack\nSpellcorrected the readme!\nNot released on TPB","torrent":{"xt":"urn:btih:fa2488aeaf0668dad643eaff118782676c80a921","amp;dn":"Minecraft+1.7.3+by+Kaise123+v1.5.1+%2BAether%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa2488aeaf0668dad643eaff118782676c80a921","infoHashBuffer":{"type":"Buffer","data":[250,36,136,174,175,6,104,218,214,67,234,255,17,135,130,103,108,128,169,33]},"announce":[],"urlList":[]}}