{"title":"NHL 12[English][Region Free][iCON][XBOX360][ArShAd][sneak_shot]","uid":6657827,"size":7144469583,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:fa36ee2368fe967d15fb825d4e16819a4c2fac73&amp;dn=NHL+12%5BEnglish%5D%5BRegion+Free%5D%5BiCON%5D%5BXBOX360%5D%5BArShAd%5D%5Bsneak_shot%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sneak_shot","files":-1,"time":1315393536,"description":"presenting s n e a k _ s h o t\n\n\n\nrelease date:06-09-2011\n\n\n\ndescription:\n\n\nAs the sport\\\\\\\\\\\\\\'s next superstar, earn every shift on the ice with stellar play, big hits, and spectacular goals and prove you have the toughness and skill to lead your team to the Stanley CupÃ‚Â®. Be the next legend in hockey with NHL 12. \n\n\n\n\nBe the next legend in hockey with NHL 12. As the sport\\\\\\\\\\\\\\'s next superstar, earn every shift on the ice with stellar play, big hits, and spectacular goals and prove you have the toughness and skill to lead your team to the Stanley CupÃ‚Â®. Take to the ice in all-new interactive environments where bone-crushing hits, glass-shattering collisions, and bruising checks along the boards are always part of the action. Experience the intensity, speed, and physicality of authentic NHL hockey with NHL 12. \n\n\n\n\n\nFull-Contact Physics Engine - From shattered glass and flying helmets to knocking players over the boards and into the bench, experience the skill and aggression of hockey like never before. Crash the crease too hard and you\\\\\\\\\\\\\\'ll knock the net off and send the goalie flying.\n\n\n\n\n\nBe a Pro Revamped - Playing as your created pro, earn every shift on the ice with stellar play, big hits, and spectacular goals. Simulate the action to your next shift so you\\\\\\\\\\\\\\'re always on the ice as you play out your entire career gunning for the Stanley Cup.\n\n\n\nAll-New Dynamic Goalie Interaction - Stonewall your opponents with awe-inspiring desperation saves from your goalie as he covers every possible angle and works through screens and flying players in front of the net. \n\n\n\nGoalies Drop the Gloves - When the action boils over, send a message by leaving the net, dropping the gloves, and trading punches with a heated rival during fights. \n\n\n\nPlay in the Winter Classic - The NHL package jumps to life with the addition of the NHL Winter Classic, the league\\\\\\\\\\\\\\'s premier outdoor hockey event on New Year\\\\\\\\\\\\\\'s Day. Play under snowfall at Pittsburgh\\\\\\\\\\\\\\'s Heinz Field as 70,000+ rabid fans provide inspiration by cheering you on while donning Winter Classic gear.\n\n\n\n\n\n\n\n\n\n\n\nseed comment n enjoy...!!!","torrent":{"xt":"urn:btih:fa36ee2368fe967d15fb825d4e16819a4c2fac73","amp;dn":"NHL+12%5BEnglish%5D%5BRegion+Free%5D%5BiCON%5D%5BXBOX360%5D%5BArShAd%5D%5Bsneak_shot%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa36ee2368fe967d15fb825d4e16819a4c2fac73","infoHashBuffer":{"type":"Buffer","data":[250,54,238,35,104,254,150,125,21,251,130,93,78,22,129,154,76,47,172,115]},"announce":[],"urlList":[]}}