{"title":"An Army at Dawn.pdf","uid":6511802,"size":40308236,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fa56113d7cac8d1280f25b64bb3e33faa3e319c7&amp;dn=An+Army+at+Dawn.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"baboo456","files":1,"time":1309653753,"description":"In An Army at Dawn,, a comprehensive look at the 1942-1943 Allied invasion of North Africa, author Rick Atkinson posits that the campaign was, along with the battles of Stalingrad and Midway, where the &quot;Axis ... forever lost the initiative&quot; and the &quot;fable of 3rd Reich invincibility was dissolved.&quot; Additionally, it forestalled a premature and potentially disastrous cross-channel invasion of France and served as a grueling &quot;testing ground&quot; for an as-yet inexperienced American army. Lastly, by relegating Great Britain to what Atkinson calls the status of &quot;junior partner&quot; in the war effort, North Africa marked the beginning of American geopolitical hegemony. Although his prose is occasionally overwrought, Atkinson's account is a superior one, an agile, well-informed mix of informed strategic overview and intimate battlefield-and-barracks anecdotes. Especially interesting are Atkinson's straightforward accounts of the many &quot;feuds, tiffs and spats&quot; among British and American commanders, politicians, and strategists and his honest assessments of their--and their soldiers'--performance and behavior, for better and for worse.","torrent":{"xt":"urn:btih:fa56113d7cac8d1280f25b64bb3e33faa3e319c7","amp;dn":"An+Army+at+Dawn.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa56113d7cac8d1280f25b64bb3e33faa3e319c7","infoHashBuffer":{"type":"Buffer","data":[250,86,17,61,124,172,141,18,128,242,91,100,187,62,51,250,163,227,25,199]},"announce":[],"urlList":[]}}