{"title":"Nur Kasih The Movie PPVRip (MKV)","uid":6530328,"size":421690258,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fda0993de051ce9fe5b3207fbfd75cafd5cea45e&amp;dn=Nur+Kasih+The+Movie+PPVRip+%28MKV%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Zaini711","files":-1,"time":1310317172,"description":"Tarikh Tayangan : Di Pawagam 19 Mei 2011\n\nPelakon : Remy Ishak, Fizz Fairuz, Tiz Zaqyah, Ayu Raudhah, Liza Othman, Munif Isa, Sara Ali, Adik Mia Sara Nasuha, Adik Ilyas Suhaimi\n\n\nPengarah : Kabir Bakhtiar\n\nLakon Layar : Mira Mustaffa\n\nNur Kasih The Movie adalah sebuah cerita bagaimana sebuah keluarga menghadapi setiap ujian daripada Tuhan. Kematian isteri Aidil telah memberikan kesan yang mendalam terutama kepada Aidil sendiri. Dia ditemani oleh dua orang anaknya iaitu Illyas dan Mariam. Adik kepada Aidil yang bernama Adam dan juga isterinya Nur Amina turut membantu untuk memberi semangat kepada Aidil.\n\nSetelah Aidil kembali pulih, Adam dan Nur Amina pulang ke bandar untuk menjalani hidup seperti biasa. Setelah pelbagai usaha dilakukan, akhirnya Nur Amina mengandung. Berita gembira ini telah membuatkan semua orang gembira terutama Adam sendiri. Tetapi kegembiraan tersebut tidak berpanjangan kerana kandungan tersebut telah keguguran.\n\nAkibat daripada kesedihan itu, Adam dan Nur Amina telah pergi ke Jordon untuk menenangkan diri. Mereka melawat banyak tempat-tempat bersejarah di sana. Sehingga pada suatu hari, mereka telah terlibat dalam satu kemalangan keretapi. Pada saat ini, Adam berdoa kepada Tuhan supaya dikembalikan Nur Amina. Akhirnya, mereka berdua telah selamat.\n\nTetapi, cincin Nur Amina telah hilang. Jadi, Adam pun pergi ke tempat nahas tersebut untuk mencari cincin Nur Amina. Malangnya, ribut taufan telah melanda di kawasan tersebut dan Adam telah hilang. Nur Amina berusaha untuk mencari Adam tanpa berputus asa. Dia juga telah meminta pertolongan daripada Aidil untuk bersama-sama mencari Adam. Setelah puas mencari, akhirnya mereka berjaya menjumpai Adam. Tetapi pada ketika itu, Adam berada di dalam keadaan yang tenat kerana dia telah terlibat dalam satu kemalangan kereta.\n\nAkhirnya mereka telah pulang ke Malaysia. Adam dibawa ke hospital untuk dirawat. Malangnya keadaan Adam menjadi semakin teruk di mana jantungnya lemah. Nur Amina tetap berusaha untuk menyelamatkan Adam dengan cara mencari sumber kewangan untuk membiayai perbelanjaan perubatan untuk Adam. Ketika itu juga, Nur Amina didapati telah mengandung lagi.\n\nSementara itu, tugas Adam sebagai cikgu telah diambil alih oleh Aidil. Pada suatu hari, Aidil telah dibelasah oleh sekumpulan samseng kerana dituduh merampas teman wanita samseng tersebut. Pada masa yang sama juga, Adam berada dalam keadaan yang amat kritikal. Mamat iaitu anak murid kepada Adam cuba untuk menyelamatkan Aidil. Malangnya, dia telah terbunuh.\n\nDengan pengorbanan itu, Adam berjaya diselamatkan kerana Mamat menderma jantungnya kepada Adam. Disebabkan itu Adam sempat melihat anaknya. Walau bagaimanapun, yang hidup tetap akan mati juga. Adam telah mati dahulu sebelum Nur Amina dan Aidil akibat tua.\n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1932688/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1932688/&lt;/a&gt;\n\nPlease donate or visit website to show support\n  &lt;a href=&quot;\nHTTP://URSHOP.COM.MY&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nHTTP://URSHOP.COM.MY&lt;/a&gt;\n","torrent":{"xt":"urn:btih:fda0993de051ce9fe5b3207fbfd75cafd5cea45e","amp;dn":"Nur+Kasih+The+Movie+PPVRip+%28MKV%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fda0993de051ce9fe5b3207fbfd75cafd5cea45e","infoHashBuffer":{"type":"Buffer","data":[253,160,153,61,224,81,206,159,229,179,32,127,191,215,92,175,213,206,164,94]},"announce":[],"urlList":[]}}