{"title":"iCarly, iParty with Victorious","uid":6863196,"size":2174578315,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fe29ca06a02cae0ac68d9cfbec65deda3ee49fe5&amp;dn=iCarly%2C+iParty+with+Victorious+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"masaalkheir","files":1,"time":1322995881,"description":"Carly has been happily dating a boy named Steven Carson, who divides his time between Seattle and Los Angeles because his parents are divorced, for three months. What she doesn't know is that he is also dating Tori Vega when he spends time in Los Angeles.\n\n&quot;And I hung out with him for like 2 hours&quot;\nAdded by Gelo Fabian\nAt Hollywood Arts, AndrÃƒÂ© is psyched that his uncle sold a house to Kenan Thompson, who allows him to have a &quot;small party&quot; there. Because of Rex tweeting about it, way more people than AndrÃƒÂ© expected come (including an irritating guy in a panda bear costume, which Andre and Kenan try to get rid of\n(From Left to Right) Carly Shay, Kenan Thompson, and Tori Vega all hanging out\nAdded by Purpleicarlylover\n). Kenan Thompson is cool with it, though, because he considers anything less than 500 people a &quot;small&quot; party. \n&quot;And Carly&quot;\nAdded by Gelo Fabian\nAfter Carly finds a pic of Steven and Tori on TheSlap.com, Sam suspects him of cheating on Carly and the iCarly team decides to go to the party at Kenan Thompson's house to find out the truth. With the help of one of Spencer's ex-girlfriends, a professional make-up artist, they are given heavy prosthetic makeup to help them sneak into the party without being recognized, After Carly sees Tori and Steven kissing, she discusses her course of action with Sam and Freddie when Tori comes in. After telling her about Steven dating both of them, they team up to take revenge on him. With Kenan Thompson's help, they reveal Steven to be a cheater and a liar live on iCarly.\nRex challenges the party guests to rap battles after Robbie wrecks the karaoke machine and defeats everyone, but is eventually beaten by Sam.\n\nCat has an infection in her throat and uses a headband with a bluetooth speaker and her PearPhone to communicate.\n\nTrina babysits Lane's friend's kids for Lane. She wants to go to the party, so she just takes them with her, but later loses them and Lane finds them asleep by some garbage cans.\n\nSikowitz, Beck, Jade, and Spencer spend the time in Kenan Thompson's jacuzzi.\n\nAt the end, the main cast of both shows sings a mash-up of their theme songs (Leave It All To Me and Make It Shine). The mash-up is titled Leave It All to Shine.","torrent":{"xt":"urn:btih:fe29ca06a02cae0ac68d9cfbec65deda3ee49fe5","amp;dn":"iCarly%2C+iParty+with+Victorious+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe29ca06a02cae0ac68d9cfbec65deda3ee49fe5","infoHashBuffer":{"type":"Buffer","data":[254,41,202,6,160,44,174,10,198,141,156,251,236,101,222,218,62,228,159,229]},"announce":[],"urlList":[]}}