{"title":"tiny core 3.8 iso files","uid":6588051,"size":58763264,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:fe6a58d160225f6b7613fd14deff4ab94447a501&amp;dn=tiny+core+3.8+iso+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cestpasgagne2","files":3,"time":1312703880,"description":"Tiny Core Linux is a very small (10 MB) minimal Linux GUI Desktop. It is based on Linux 2.6 kernel, Busybox, Tiny X, and Fltk. The core runs entirely in ram and boots very quickly. Also offered are Micro Core, a 6 MB image that is the console based engine of Tiny Core, and Multi Core, which includes Tiny Core, Micro Core, networking tools and an installer. Micro Core contains CLI versions of Tiny Core's programs allowing the same functionality of Tiny Core's extensions, only starting with a console based system.\nIt is not a complete desktop nor is all hardware completely supported. It represents only the core needed to boot into a very minimal X desktop typically with wired internet access.\nThe user has complete control over which applications and/or additional hardware to have supported, be it for a desktop, a netbook, an appliance, or server, selectable by the user by installing additional applications from online repositories, or easily compiling most anything you desire using tools provided.\n\nThe latest version: 3.8\nFinal Change Log:\n\nUpdated AppsAudit dependencies menu grouping and added Fetch Missing Dependencies.\nUpdated AppsAudit - updated error reporting and now reports stale extensions.\nUpdated AppsBrowser - clear SearchandProvides field upon results.\nUpdated Wallpaper - Improved GUI. Now with a single window.\nUpdated screenshot to display file name created upon completion.\nUpdated mnttool - added a refresh button.\nUpdated wbarconf - support for no initial .wbar\nUpdated busybox - 1.18.5 new depmod applet and audit of required applets.\nUpdated tc-audit added fetchmissing to fetch missing dependencies.\nUpdated tce-load - now allows re-downloading non-installed extensions to better handle download failures.\nUpdated tce-setup and tce-load to ensure busybox calls thus avoiding conflicts with various gnu utilities.\nUpdated rc.shutdown - removed sleep to improve shutdown speed.\nUpdated search.sh - improved searching by title results and support for fat file-system.\nUpdated provides.sh - support for fat file-system.\nUpdated tce-setup, tce-load, and loadpack.sh - alias for new depmod applet.\nUpdated .profile - new user login sudo issue resolved.\nUpdated rebuildfstab and tc-config for AOE support.\nUpdated tc-functions getpassword to support backspace during input.\nUpdated tce-setup for loading tce directory on cdrom and installable via updates to tc-install and tc-grub4dos\nUpdated multicore.iso now uses extension directories for network, install, or grub4dos.\nNew icons for AppBrowser and AppsAudit.\n\nThanks go to Gerald Clark for the new AOE support.\n &lt;a href=&quot;\nhttp://distro.ibiblio.org/tinycorelinux/welcome.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://distro.ibiblio.org/tinycorelinux/welcome.html&lt;/a&gt;\n\nmd5sums : \n7cea9ccdc703fc2e33729f9f5ebc7124  microcore_3.8.iso\n909c826783d31905963b2fa1657978df  multicore_3.8.iso\nc0a326b36c1ad64024b16d1614f4fc1b  tinycore_3.8.iso","torrent":{"xt":"urn:btih:fe6a58d160225f6b7613fd14deff4ab94447a501","amp;dn":"tiny+core+3.8+iso+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe6a58d160225f6b7613fd14deff4ab94447a501","infoHashBuffer":{"type":"Buffer","data":[254,106,88,209,96,34,95,107,118,19,253,20,222,255,74,185,68,71,165,1]},"announce":[],"urlList":[]}}