{"title":"Azimut Yachts - Luxury Destinations Vol. 1-4 (2011)","uid":6584059,"size":755068078,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fe840dfa93149831dd007ace7ea69c19a6247c53&amp;dn=Azimut+Yachts+-+Luxury+Destinations+Vol.+1-4+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HeyBill","files":42,"time":1312538945,"description":"Azimut Yachts - Luxury Destinations Vol. 1 (2011)\n101. Phil Asher &amp; The Mighty Zaf Feat. Zansika - Shakin' It Up (Instrumental)\n102. Black Powder Feat. Adeola Shyllon - One Chance (Matthew Bandys Limestone Instrumental)\n103. Distant People Feat. Nickson - Great I Am (Distant People's Instrumental Mix)\n104. DaSouL &amp; Fabry Diglio - Sea Of Love (Flute Mix)\n105. Asymmetric Soul Feat. Ella - Now is Our Time (Trancemicsoul Underground Mix Instrumental)\n106. Panevino &amp; Malena Perez - One Breath (Instrumental Mix\n107. Ananda Project Feat. Heather Johnson, Terrance Downs - Kiss... (Feliciano Ricanstruction Instr)\n108. Reel People Feat. Darien - Sure (Frankie Feliciano Ricanstruction Instrumental Mix)\n109. Edmund Feat. Natasha Watts - Fantasy (Seb Skalski Deep Rhode Instrumental)\n110. Warm Days feat. Swindle and Natalie Maddix - Selfish Skies (Atjazz Instrumental Dub)\n\nAzimut Yachts - Luxury Destinations Vol. 2 (2011)\n201. Julius Papp Feat. D'Layna - Dame Mas (Instrumental Remix\n202. Jamiroquai - White Knuckle Ride (Penguin Prison Instrumental Mix)\n203. Michael Watford - For Your Luv (Latest Craze Instrumental Mix)\n204. Negrocan - Cada Vez (Guy Robin Classic Disco Instrumental)\n205. Cool Million Feat. Eugene Wilde - Back for More (Jonny Montana &amp; Craig Stewart Instrumental)\n206. Monique Bingham - You. Me. World (Instrumental Mix)\n207. Yohann Levems Feat. Donna Hidalgo - Vendetta (Carlos Vargas &amp; Matt &amp; Cooper Instrumental Reprise)\n208. Groove Junkies - In The Zone (Dave Doyle Instrumental)\n209. Bernard Badie Feat. Dajae - Truth Hurts (Jonny Montanna &amp; Craig Stewart Instrumental)\n210. Lopazz &amp; Eddie Zarook - Twotwo (Cella Remix)\n211. Monodeluxe Feat. Diviniti - Never Stop (Toni Rox Meets Soulcraft Moving Instrumental Mix\n\nAzimut Yachts - Luxury Destinations Vol. 3 (2011)\n301. Sofy Encanto - Once Again (Deep Instrumental)\n302. Maritri - Angel In Disguise (Steal Vybe Instrumental)\n303. Cantoma - North Shore (Idjut Boys Version Instrumental)\n304. Sub Compression - When It All Comes Back (YokoO Remix)\n305. Goffunk Feat. James Junior - Different Kinda Man (House Device Saxtrumental)\n306. Yvette Rovira - I Remember Love (DJ Spinna Galactic Soul Remix Instrumental)\n307. Black Coffee Feat. Zonke - Gardens of Eden (Ralf Gum Instrumental)\n308. FAMA - Ring My Bell (John Morales Mandm Breakdown Instrumental Mix\n309. Toni Braxton - Make My Heart (The Layabouts Deepen Our Hearts Instrumental)\n310. Elements Of Life Feat Lisa Fischer - Love Will Know (Sunset Ritual Instrumental Mix)\n\nAzimut Yachts - Luxury Destinations Vol. 4 (2011)\n401. Dean Saunders - Electric Univers\n402. Steal Vybe Feat. Alexis Simmons - Is It Possible (Rocco Mixes) (Rocco Deep Instrumental Mix)\n403. Yann Solo &amp; Just 1 Side - Lover Instinct\n404. Neil Pierce Feat. Dawn Tallman - Get Out Of My Head (Instrumental)\n405. Dj Meme Orchestra Feat. Tracey K - Love Is You (Instrumental)\n406. Perspex People - No Giving Up Original Instrumental\n407. Steven Stone Feat. Andrea Love - Just Can't Stop (Drexmeister &amp; Robert Rivera Instrumental Remix\n408. Soul Element Feat. Peven Everett - How Bad I Want Ya (The Remixes) (The Muthafunkaz Instrumental Mix)\n409. Takashi Watanabe - Snare Jazz (Satoshi Fumi Remix)\n410. Danny Clark &amp; Jay Benham Feat. Andrea Love - Call It Done (Doruk Ozlen Instrumental\n411. Julius Papp &amp; Mr. V - Chicago Tribute (Julius Papp Deep Vibration Instrumental)\n","torrent":{"xt":"urn:btih:fe840dfa93149831dd007ace7ea69c19a6247c53","amp;dn":"Azimut+Yachts+-+Luxury+Destinations+Vol.+1-4+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe840dfa93149831dd007ace7ea69c19a6247c53","infoHashBuffer":{"type":"Buffer","data":[254,132,13,250,147,20,152,49,221,0,122,206,126,166,156,25,166,36,124,83]},"announce":[],"urlList":[]}}