{"title":"Little Einsteins Raket Redt Vuurvogel (Multi Audio)(Multi Subs) ","uid":6522378,"size":4701309381,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ff0108299c3d3c23049c21db2a685bb8c38221b3&amp;dn=Little+Einsteins+Raket+Redt+Vuurvogel+%28Multi+Audio%29%28Multi+Subs%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"juutje","files":-1,"time":1310039403,"description":"Little Einsteins Raket Redt Vuurvogel \n\n\nNog voor je &quot;Lanceren&quot; kan zeggen, zoeven de Kleine Einsteins door de lucht in een nieuwe film vol actie, muziek, magie en plezier. Wat is behalve Raket groot, rood en kan vliegen? Ontmoet een nieuwe vriendin van Raket: de mysterieuze Vuurvogel! Ze sprenkelt magische muziekkracht overal waar ze vliegt en vult de wereld met schoonheid en blijdschap. Maar wanneer een gemene reus Vuurvogel gevangen neemt, reizen Raket, Leo, June, Quincy en Annie helemaal naar Rusland om haar te bevrijden zodat ze weer muziek in de wereld kan brengen. Vergeet niet, alleen met jouw hulp, door te zingen, te dansen en muziek te maken, kunnen de Kleine Einsteins hun missie uitvoeren en de wereld redden.\nGeÃƒÂ¯nspireerd door de muziek van Igor Stravinsky's ballet &quot;De Vuurvogel&quot;. Vol met thema's van samenwerken, vriendschap en medeleven, is Raket redt Vuurvogel een magische reis, die jij en je peuter steeds opnieuw zullen willen beleven!\n\nAlle leeftijden!\n &lt;a href=&quot;\nhttp://www.disneyinfo.nl/dvddetail.php?film=2708&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.disneyinfo.nl/dvddetail.php?film=2708&lt;/a&gt;\n\nLittle Einsteins Rocket Firebird Rescue\n\nBefore you &quot;Launch&quot; to say, the Little Einsteins zooming through the sky in a new action-packed movie, music, magic and fun. What's great except Rocket, red and can fly? Meet a new friend of Rocket: the mysterious Firebird! She sprinkles magical music power everywhere she flies, filling the world with beauty and joy. But when an evil giant, captures Firebird, traveling Rocket, Leo, June, Quincy and Annie all the way to Russia to free her again so she can bring music into the world. Remember, only with your help, by singing, dancing and music making, the Little Einsteins and their mission to save the world.\nInspired by the music of Igor Stravinsky's ballet &quot;The Firebird&quot;. Filled with themes of cooperation, friendship and compassion, Rocket's Firebird rescue a magical journey that you and your toddler will want to experience again and again!\n\nAll ages!\n\n\t\nFile Format: Video_TS folder Pal \nFile size: 4 .36 GB\nFormat : DVD5\nSource: Retail\nGenre: Animation Kinderfilm\nSubtitle: English  Dutch  French Spanish Italian German Arabic  subs optional\t\nLanguage: English  Dutch  French Spanish Italian German Arabic audio\nMenu: Yes \nExtra: Yes\nCover Yes\n\nEnjoy The Movie\n \n\n \t","torrent":{"xt":"urn:btih:ff0108299c3d3c23049c21db2a685bb8c38221b3","amp;dn":"Little+Einsteins+Raket+Redt+Vuurvogel+%28Multi+Audio%29%28Multi+Subs%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff0108299c3d3c23049c21db2a685bb8c38221b3","infoHashBuffer":{"type":"Buffer","data":[255,1,8,41,156,61,60,35,4,156,33,219,42,104,91,184,195,130,33,179]},"announce":[],"urlList":[]}}